burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>


        <peripheral>
            <name>AXI</name>
            <description>System and memory architectur</description>
            <groupName>AXI</groupName>
            <baseAddress>0x51000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PERIPH_ID4</name>
                    <displayName>PERIPH_ID4</displayName>
                    <description>AXI peripheral ID4 register</description>
                    <addressOffset>0x1FD0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000004</resetValue>
                    <fields>
                        <field>
                            <name>CNT4KB</name>
                            <description>4KB count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JEP106CCODE</name>
                            <description>JEP106 continuation code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERIPH_ID0</name>
                    <displayName>PERIPH_ID0</displayName>
                    <description>AXI peripheral ID0 register</description>
                    <addressOffset>0x1FE0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PARTNUM</name>
                            <description>Part number[7:0]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERIPH_ID1</name>
                    <displayName>PERIPH_ID1</displayName>
                    <description>AXI peripheral ID1 register</description>
                    <addressOffset>0x1FE4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000000B4</resetValue>
                    <fields>
                        <field>
                            <name>JEP106ID</name>
                            <description>JEP106 Identity[3:0]</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PARTNUM</name>
                            <description>Part number[11:8]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERIPH_ID2</name>
                    <displayName>PERIPH_ID2</displayName>
                    <description>AXI peripheral ID2 register</description>
                    <addressOffset>0x1FE8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000002B</resetValue>
                    <fields>
                        <field>
                            <name>PARTREV</name>
                            <description>Part revision</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JEP106CF</name>
                            <description>JEP106 code flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JEP106ID</name>
                            <description>Part number[11:8]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERIPH_ID3</name>
                    <displayName>PERIPH_ID3</displayName>
                    <description>AXI peripheral ID3 register</description>
                    <addressOffset>0x1FEC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CUSTREV</name>
                            <description>Customer version</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CUSTMOD</name>
                            <description>Customer modification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_ID0</name>
                    <displayName>COMP_ID0</displayName>
                    <description>AXI componet ID0 register</description>
                    <addressOffset>0x1FF0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000000D</resetValue>
                    <fields>
                        <field>
                            <name>PREAMB</name>
                            <description>Preamble bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_ID1</name>
                    <displayName>COMP_ID1</displayName>
                    <description>AXI componet ID1 register</description>
                    <addressOffset>0x1FF4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000000F0</resetValue>
                    <fields>
                        <field>
                            <name>CLASS</name>
                            <description>Component class</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PARTNUM</name>
                            <description>Preamble bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_ID2</name>
                    <displayName>COMP_ID2</displayName>
                    <description>AXI componet ID2 register</description>
                    <addressOffset>0x1FF8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000005</resetValue>
                    <fields>
                        <field>
                            <name>PREAMB</name>
                            <description>Preamble bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_ID3</name>
                    <displayName>COMP_ID3</displayName>
                    <description>AXI componet ID3 register</description>
                    <addressOffset>0x1FFC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000000B1</resetValue>
                    <fields>
                        <field>
                            <name>PREAMB</name>
                            <description>Preamble bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP0BM_ISS_CTL</name>
                    <displayName>MP0BM_ISS_CTL</displayName>
                    <description>AXI Master Port 0 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x2008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP1BM_ISS_CTL</name>
                    <displayName>MP1BM_ISS_CTL</displayName>
                    <description>AXI Master Port 1 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x3008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP2BM_ISS_CTL</name>
                    <displayName>MP2BM_ISS_CTL</displayName>
                    <description>AXI Master Port 2 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x4008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP3BM_ISS_CTL</name>
                    <displayName>MP3BM_ISS_CTL</displayName>
                    <description>AXI Master Port 3 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x5008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP4BM_ISS_CTL</name>
                    <displayName>MP4BM_ISS_CTL</displayName>
                    <description>AXI Master Port 4 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x6008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP5BM_ISS_CTL</name>
                    <displayName>MP5BM_ISS_CTL</displayName>
                    <description>AXI Master Port 5 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x7008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP6BM_ISS_CTL</name>
                    <displayName>MP6BM_ISS_CTL</displayName>
                    <description>AXI Master Port 6 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x8008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP7BM_ISS_CTL</name>
                    <displayName>MP7BM_ISS_CTL</displayName>
                    <description>AXI Master Port 7 bus matrix issuing functionality control regist</description>
                    <addressOffset>0x9008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override target write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override target read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP0BM_CTL</name>
                    <displayName>MP0BM_CTL</displayName>
                    <description>AXI Master Port 0 bus matrix functionality control regist</description>
                    <addressOffset>0x2024</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BPDIS</name>
                            <description>Beats packing function disable configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP1BM_CTL</name>
                    <displayName>MP1BM_CTL</displayName>
                    <description>AXI Master Port 1 bus matrix functionality control regist</description>
                    <addressOffset>0x3024</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BPDIS</name>
                            <description>Beats packing function disable configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP6BM_CTL</name>
                    <displayName>MP6BM_CTL</displayName>
                    <description>AXI Master Port 6 bus matrix functionality control regist</description>
                    <addressOffset>0x8024</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BPDIS</name>
                            <description>Beats packing function disable configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP7BM_CTL</name>
                    <displayName>MP7BM_CTL</displayName>
                    <description>AXI Master Port 7 bus matrix functionality control regist</description>
                    <addressOffset>0x9024</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BPDIS</name>
                            <description>Beats packing function disable configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
