burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>MP0_LB_CTL</name>
                    <displayName>MP0_LB_CTL</displayName>
                    <description>AXI Master Port 0 long burst functionality control regist</description>
                    <addressOffset>0x202c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LBEN</name>
                            <description>Control long burst function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP1_LB_CTL</name>
                    <displayName>MP1_LB_CTL</displayName>
                    <description>AXI Master Port 1 long burst functionality control regist</description>
                    <addressOffset>0x302c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LBEN</name>
                            <description>Control long burst function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP0_ISS_CTL</name>
                    <displayName>MP0_ISS_CTL</displayName>
                    <description>AXI Master Port 0 issuing functionality control regist</description>
                    <addressOffset>0x2108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override AMIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override AMIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP1_ISS_CTL</name>
                    <displayName>MP1_ISS_CTL</displayName>
                    <description>AXI Master Port 1 issuing functionality control regist</description>
                    <addressOffset>0x3108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override AMIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override AMIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP6_ISS_CTL</name>
                    <displayName>MP6_ISS_CTL</displayName>
                    <description>AXI Master Port 6 issuing functionality control regist</description>
                    <addressOffset>0x8108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override AMIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override AMIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MP7_ISS_CTL</name>
                    <displayName>MP7_ISS_CTL</displayName>
                    <description>AXI Master Port 7 issuing functionality control regist</description>
                    <addressOffset>0x9108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override AMIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override AMIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP0_CTL</name>
                    <displayName>SP0_CTL</displayName>
                    <description>AXI Slave Port 0 functionality control regist</description>
                    <addressOffset>0x42024</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TRANSALT</name>
                            <description>Transaction alteration configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP1_CTL</name>
                    <displayName>SP1_CTL</displayName>
                    <description>AXI Slave Port 1 functionality control regist</description>
                    <addressOffset>0x43024</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TRANSALT</name>
                            <description>Transaction alteration configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP2_CTL</name>
                    <displayName>SP2_CTL</displayName>
                    <description>AXI Slave Port 2 functionality control regist</description>
                    <addressOffset>0x44024</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TRANSALT</name>
                            <description>Transaction alteration configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP0_AHBISS_CTL</name>
                    <displayName>SP0_AHBISS_CTL</displayName>
                    <description>AXI Slave Port 0 AHB issuing functionality control regist</description>
                    <addressOffset>0x42028</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RD_AHB_ISSOV</name>
                            <description>Converts AHB-Lite read transaction to single beat AXI transaction function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WR_AHB_ISSOV</name>
                            <description>Converts AHB-Lite write transaction to single beat AXI transaction function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP1_AHBISS_CTL</name>
                    <displayName>SP1_AHBISS_CTL</displayName>
                    <description>AXI Slave Port 1 AHB issuing functionality control regist</description>
                    <addressOffset>0x43028</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RD_AHB_ISSOV</name>
                            <description>Converts AHB-Lite read transaction to single beat AXI transaction function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WR_AHB_ISSOV</name>
                            <description>Converts AHB-Lite write transaction to single beat AXI transaction function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP2_AHBISS_CTL</name>
                    <displayName>SP2_AHBISS_CTL</displayName>
                    <description>AXI Slave Port 2 AHB issuing functionality control regist</description>
                    <addressOffset>0x44028</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RD_AHB_ISSOV</name>
                            <description>Converts AHB-Lite read transaction to single beat AXI transaction function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WR_AHB_ISSOV</name>
                            <description>Converts AHB-Lite write transaction to single beat AXI transaction function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP0_RDQOS_CTL</name>
                    <displayName>SP0_RDQOS_CTL</displayName>
                    <description>AXI Slave Port 0 read QOS control regist</description>
                    <addressOffset>0x42100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDQOS</name>
                            <description>Read channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP1_RDQOS_CTL</name>
                    <displayName>SP1_RDQOS_CTL</displayName>
                    <description>AXI Slave Port 1 read QOS control regist</description>
                    <addressOffset>0x43100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDQOS</name>
                            <description>Read channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP2_RDQOS_CTL</name>
                    <displayName>SP2_RDQOS_CTL</displayName>
                    <description>AXI Slave Port 2 read QOS control regist</description>
                    <addressOffset>0x44100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDQOS</name>
                            <description>Read channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP3_RDQOS_CTL</name>
                    <displayName>SP3_RDQOS_CTL</displayName>
                    <description>AXI Slave Port 3 read QOS control regist</description>
                    <addressOffset>0x45100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDQOS</name>
                            <description>Read channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP4_RDQOS_CTL</name>
                    <displayName>SP4_RDQOS_CTL</displayName>
                    <description>AXI Slave Port 4 read QOS control regist</description>
                    <addressOffset>0x46100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDQOS</name>
                            <description>Read channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP5_RDQOS_CTL</name>
                    <displayName>SP5_RDQOS_CTL</displayName>
                    <description>AXI Slave Port 5 read QOS control regist</description>
                    <addressOffset>0x47100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDQOS</name>
                            <description>Read channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP0_WRQOS_CTL</name>
                    <displayName>SP0_WRQOS_CTL</displayName>
                    <description>AXI Slave Port 0 write QOS control regist</description>
                    <addressOffset>0x42104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRQOS</name>
                            <description>Write channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP1_WRQOS_CTL</name>
                    <displayName>SP1_WRQOS_CTL</displayName>
                    <description>AXI Slave Port 1 write QOS control regist</description>
                    <addressOffset>0x43104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRQOS</name>
                            <description>Write channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP2_WRQOS_CTL</name>
                    <displayName>SP2_WRQOS_CTL</displayName>
                    <description>AXI Slave Port 2 write QOS control regist</description>
                    <addressOffset>0x44104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRQOS</name>
                            <description>Write channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP3_WRQOS_CTL</name>
                    <displayName>SP3_WRQOS_CTL</displayName>
                    <description>AXI Slave Port 3 write QOS control regist</description>
                    <addressOffset>0x45104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRQOS</name>
                            <description>Write channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP4_WRQOS_CTL</name>
                    <displayName>SP4_WRQOS_CTL</displayName>
                    <description>AXI Slave Port 4 write QOS control regist</description>
                    <addressOffset>0x46104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRQOS</name>
                            <description>Write channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP5_WRQOS_CTL</name>
                    <displayName>SP5_WRQOS_CTL</displayName>
                    <description>AXI Slave Port 5 write QOS control regist</description>
                    <addressOffset>0x47104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRQOS</name>
                            <description>Write channel QoS configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
