burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>SP0_ISS_CTL</name>
                    <displayName>SP0_ISS_CTL</displayName>
                    <description>AXI Slave Port 0 issuing functionality control regist</description>
                    <addressOffset>0x42108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override ASIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override ASIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP1_ISS_CTL</name>
                    <displayName>SP1_ISS_CTL</displayName>
                    <description>AXI Slave Port 1 issuing functionality control regist</description>
                    <addressOffset>0x43108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override ASIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override ASIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP2_ISS_CTL</name>
                    <displayName>SP2_ISS_CTL</displayName>
                    <description>AXI Slave Port 2 issuing functionality control regist</description>
                    <addressOffset>0x44108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override ASIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override ASIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP3_ISS_CTL</name>
                    <displayName>SP3_ISS_CTL</displayName>
                    <description>AXI Slave Port 3 issuing functionality control regist</description>
                    <addressOffset>0x45108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override ASIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override ASIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP4_ISS_CTL</name>
                    <displayName>SP4_ISS_CTL</displayName>
                    <description>AXI Slave Port 4 issuing functionality control regist</description>
                    <addressOffset>0x46108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override ASIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override ASIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SP5_ISS_CTL</name>
                    <displayName>SP5_ISS_CTL</displayName>
                    <description>AXI Slave Port 5 issuing functionality control regist</description>
                    <addressOffset>0x47108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WR_ISSOV</name>
                            <description>Override ASIB write issuing function</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RD_ISSOV</name>
                            <description>Override ASIB read issuing function</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
