burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>RFIFOMPF0</name>
                    <displayName>RFIFOMPF0</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x880</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>RFIFOMPF1</name>
                    <displayName>RFIFOMPF1</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x884</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF2</name>
                    <displayName>RFIFOMPF2</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x888</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF3</name>
                    <displayName>RFIFOMPF3</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x88C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF4</name>
                    <displayName>RFIFOMPF4</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x890</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF5</name>
                    <displayName>RFIFOMPF5</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x894</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF6</name>
                    <displayName>RFIFOMPF6</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x898</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF7</name>
                    <displayName>RFIFOMPF7</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x89C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF8</name>
                    <displayName>RFIFOMPF8</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8A0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF9</name>
                    <displayName>RFIFOMPF9</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8A4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF10</name>
                    <displayName>RFIFOMPF10</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8A8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF11</name>
                    <displayName>RFIFOMPF11</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8AC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF12</name>
                    <displayName>RFIFOMPF12</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8B0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF13</name>
                    <displayName>RFIFOMPF13</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8B4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF14</name>
                    <displayName>RFIFOMPF14</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8B8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF15</name>
                    <displayName>RFIFOMPF15</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8BC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF16</name>
                    <displayName>RFIFOMPF16</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8C0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF17</name>
                    <displayName>RFIFOMPF17</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8C4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF18</name>
                    <displayName>RFIFOMPF18</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8C8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF19</name>
                    <displayName>RFIFOMPF19</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8CC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF20</name>
                    <displayName>RFIFOMPF20</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8D0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF21</name>
                    <displayName>RFIFOMPF21</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8D4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF22</name>
                    <displayName>RFIFOMPF22</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8D8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF23</name>
                    <displayName>RFIFOMPF23</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8DC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF24</name>
                    <displayName>RFIFOMPF24</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8E0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF25</name>
                    <displayName>RFIFOMPF25</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8E4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF26</name>
                    <displayName>RFIFOMPF26</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8E8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFIFOMPF27</name>
                    <displayName>RFIFOMPF27</displayName>
                    <description>Receive FIFO/mailbox private filter x register</description>
                    <addressOffset>0x8EC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMFDx</name>
                            <description>FIFO/mailbox filter data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
