burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>RWM1CS</name>
                    <displayName>RWM1CS</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x control status information register</description>
                    <addressOffset>0xB50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSRR</name>
                            <description>Received SRR bit</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RIDE</name>
                            <description>Received IDE bit</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RRTR</name>
                            <description>Received RTR bit</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDLC</name>
                            <description>Received DLC bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>RWM2CS</name>
                    <displayName>RWM2CS</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x control status information register</description>
                    <addressOffset>0xB60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSRR</name>
                            <description>Received SRR bit</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RIDE</name>
                            <description>Received IDE bit</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RRTR</name>
                            <description>Received RTR bit</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDLC</name>
                            <description>Received DLC bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>RWM3CS</name>
                    <displayName>RWM3CS</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x control status information register</description>
                    <addressOffset>0xB70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSRR</name>
                            <description>Received SRR bit</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RIDE</name>
                            <description>Received IDE bit</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RRTR</name>
                            <description>Received RTR bit</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDLC</name>
                            <description>Received DLC bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>PN_RWM0I</name>
                    <displayName>PN_RWM0I</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
                    <addressOffset>0xB44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RID</name>
                            <description>Received ID bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>PN_RWM1I</name>
                    <displayName>PN_RWM1I</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
                    <addressOffset>0xB54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RID</name>
                            <description>Received ID bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>PN_RWM2I</name>
                    <displayName>PN_RWM2I</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
                    <addressOffset>0xB64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RID</name>
                            <description>Received ID bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>PN_RWM3I</name>
                    <displayName>PN_RWM3I</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
                    <addressOffset>0xB74</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RID</name>
                            <description>Received ID bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>RWM0D0</name>
                    <displayName>RWM0D0</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
                    <addressOffset>0xB48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDB0</name>
                            <description>Received data byte 0</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB1</name>
                            <description>Received data byte 1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB2</name>
                            <description>Received data byte 2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB3</name>
                            <description>Received data byte 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RWM1D0</name>
                    <displayName>RWM1D0</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
                    <addressOffset>0xB58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDB0</name>
                            <description>Received data byte 0</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB1</name>
                            <description>Received data byte 1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB2</name>
                            <description>Received data byte 2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB3</name>
                            <description>Received data byte 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RWM2D0</name>
                    <displayName>RWM2D0</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
                    <addressOffset>0xB68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDB0</name>
                            <description>Received data byte 0</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB1</name>
                            <description>Received data byte 1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB2</name>
                            <description>Received data byte 2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB3</name>
                            <description>Received data byte 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RWM3D0</name>
                    <displayName>RWM3D0</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
                    <addressOffset>0xB78</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDB0</name>
                            <description>Received data byte 0</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB1</name>
                            <description>Received data byte 1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB2</name>
                            <description>Received data byte 2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB3</name>
                            <description>Received data byte 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>RWM0D1</name>
                    <displayName>RWM0D1</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x data 1 register</description>
                    <addressOffset>0xB4C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDB4</name>
                            <description>Received data byte 4</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB5</name>
                            <description>Received data byte 5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB6</name>
                            <description>Received data byte 6</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB7</name>
                            <description>Received data byte 7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>RWM1D1</name>
                    <displayName>RWM1D1</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x data 1 register</description>
                    <addressOffset>0xB5C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDB4</name>
                            <description>Received data byte 4</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB5</name>
                            <description>Received data byte 5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB6</name>
                            <description>Received data byte 6</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB7</name>
                            <description>Received data byte 7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>RWM2D1</name>
                    <displayName>RWM2D1</displayName>
                    <description>CAN_sleep mode received wakeup mailbox x data 1 register</description>
                    <addressOffset>0xB6C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDB4</name>
                            <description>Received data byte 4</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB5</name>
                            <description>Received data byte 5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB6</name>
                            <description>Received data byte 6</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDB7</name>
                            <description>Received data byte 7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

