burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CRC</name>
            <description>CRC calculation unit</description>
            <groupName>CRC</groupName>
            <baseAddress>0x58024C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>Data register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>CRC calculation result bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FDATA</name>
                    <displayName>FDATA</displayName>
                    <description>Free data register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FDATA</name>
                            <description>Free data register bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL</name>
                    <displayName>CTL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REV_O</name>
                            <description>Reverse output data value in bit order</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REV_I</name>
                            <description>Reverse type for input date</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PS</name>
                            <description>Size of polynomial</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RST</name>
                            <description>Software writes and reads</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDATA</name>
                    <displayName>IDATA</displayName>
                    <description>Initialization data register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>IDATA</name>
                            <description>Configurable initial CRC data value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POLY</name>
                    <displayName>POLY</displayName>
                    <description>Polynomial register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x04C11DB7</resetValue>
                    <fields>
                        <field>
                            <name>POLY</name>
                            <description>User configurable polynomial value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CTC</name>
            <description>Clock trim controller</description>
            <groupName>CTC</groupName>
            <baseAddress>0x40008400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CTC</name>
                <value>144</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL0</name>
                    <displayName>CTL0</displayName>
                    <description>Control register 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00002000</resetValue>
                    <fields>
                        <field>
                            <name>TRIMVALUE</name>
                            <description>IRC48M trim value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWREFPUL</name>
                            <description>Software reference source sync pulse</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>AUTOTRIM</name>
                            <description>Hardware automatically trim mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNTEN</name>
                            <description>CTC counter enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EREFIE</name>
                            <description>EREFIF interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>Error (ERRIF) interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKWARNIE</name>
                            <description>Clock trim warning (CKWARNIF) interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOKIE</name>
                            <description>Clock trim OK (CKOKIF) interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL1</name>
                    <displayName>CTL1</displayName>
                    <description>Control register 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x2022BB7F</resetValue>
                    <fields>
                        <field>
                            <name>REFPOL</name>
                            <description>Reference signal source polarity</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>

                        <field>
                            <name>REFSEL</name>
                            <description>Reference signal source selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REFPSC</name>
                            <description>Reference signal source prescaler</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLIM</name>
                            <description>Clock trim base limit value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RLVALUE</name>
                            <description>CTC counter reload value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REFCAP</name>
                            <description>CTC counter capture when reference sync pulse</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REFDIR</name>
                            <description>CTC trim counter direction when reference sync pulse</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TRIMERR</name>
                            <description>Trim value error bit</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REFMISS</name>
                            <description>Reference sync pulse miss</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKERR</name>
                            <description>Clock trim error bit</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EREFIF</name>
                            <description>Expect reference interrupt flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRIF</name>
                            <description>Error interrupt flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKWARNIF</name>
                            <description>Clock trim warning interrupt flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKOKIF</name>
                            <description>Clock trim OK interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTC</name>
                    <displayName>INTC</displayName>
                    <description>Interrupt clear register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EREFIC</name>
                            <description>EREFIF interrupt clear bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>wirte-only</access>
                        </field>
                        <field>
                            <name>ERRIC</name>
                            <description>ERRIF interrupt clear bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>wirte-only</access>
                        </field>
                        <field>
                            <name>CKWARNIC</name>
                            <description>CKWARNIF interrupt clear bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>wirte-only</access>
                        </field>
                        <field>
                            <name>CKOKIC</name>
                            <description>CKOKIF interrupt clear bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>wirte-only</access>
                        </field>
                    </fields>
                </register>
