burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>SC</name>
                    <displayName>SC</displayName>
                    <description>Synchronization codes register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FE</name>
                            <description>Frame End Code in Embedded Synchronous Mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LE</name>
                            <description>Line End Code in Embedded Synchronous Mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LS</name>
                            <description>Line Start Code in Embedded Synchronous Mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>FS</name>
                            <description>Frame Start Code in Embedded Synchronous Mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCUMSK</name>
                    <displayName>SCUMSK</displayName>
                    <description>Synchronization codes unmask register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FEM</name>
                            <description>Frame End Code unMask Bits in Embedded Synchronous Mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LEM</name>
                            <description>Line End Code unMask Bits in Embedded Synchronous Mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LSM</name>
                            <description>Line Start Code unMask Bits in Embedded Synchronous Mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>FSM</name>
                            <description>Frame Start Code unMask Bits in Embedded Synchronous Mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CWSPOS</name>
                    <displayName>CWSPOS</displayName>
                    <description>Cropping window start position register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WVSP</name>
                            <description>Window Vertical Start Position</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>13</bitWidth>
                        </field>
                        <field>
                            <name>WHSP</name>
                            <description>Window Horizontal Start Position</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CWSZ</name>
                    <displayName>CWSZ</displayName>
                    <description>Cropping window size register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WVSZ</name>
                            <description>Window Vertical Size</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                        <field>
                            <name>WHSZ</name>
                            <description>Window Horizontal Size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>DATA register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DT3</name>
                            <description>Pixel Data 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DT2</name>
                            <description>Pixel Data 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DT1</name>
                            <description>Pixel Data 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DT0</name>
                            <description>Pixel Data 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
