burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CH2PADDR</name>
                    <displayName>CH2PADDR</displayName>
                    <description>Channel 2 peripheral base address regist</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Peripheral base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>CH2M0ADDR</name>
                    <displayName>CH2M0ADDR</displayName>
                    <description>Channel 2 memory 0 base address regist</description>
                    <addressOffset>0x4c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M0ADDR</name>
                            <description>Memory 0 base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2M1ADDR</name>
                    <displayName>CH2M1ADDR</displayName>
                    <description>Channel 2 memory 1 base address regist</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M1ADDR</name>
                            <description>Memory 1 base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>CH2FCTL</name>
                    <displayName>CH2FCTL</displayName>
                    <description>Channel 2 FIFO control regist</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FEEIE</name>
                            <description>Enable bit for FIFO error and exception interrupt</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCNT</name>
                            <description>FIFO counter</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDMEN</name>
                            <description>Multi-data mode enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCCV</name>
                            <description>FIFO counter critical value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3CTL</name>
                    <displayName>CH3CTL</displayName>
                    <description>Channel 3 control regist</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MBURST</name>
                            <description>Transfer burst type of memory</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBURST</name>
                            <description>Transfer burst type of peripheral</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBS</name>
                            <description>Memory buffer select</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBMEN</name>
                            <description>Switch-buffer mode enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRIO</name>
                            <description>Priority level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAIF</name>
                            <description>Peripheral address increment fixed</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MWIDTH</name>
                            <description>Transfer width of memory</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWIDTH</name>
                            <description>Transfer width of peripheral</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MNAGA</name>
                            <description>Next address generation algorithm of memory</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PNAGA</name>
                            <description>Next address generation algorithm of peripheral</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEN</name>
                            <description>Circular mode enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TM</name>
                            <description>Transfer mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                     
                        <field>
                            <name>FTFIE</name>
                            <description>Enable bit for full transfer finish interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTFIE</name>
                            <description>Enable bit for half transfer finish interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TAEIE</name>
                            <description>Enable bit for tranfer access error interrupt</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDEIE</name>
                            <description>Enable bit for single data mode exception interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3CNT</name>
                    <displayName>CH3CNT</displayName>
                    <description>Channel 3 counter regist</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transfer counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3PADDR</name>
                    <displayName>CH3PADDR</displayName>
                    <description>Channel 3 peripheral base address regist</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Peripheral base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3M0ADDR</name>
                    <displayName>CH3M0ADDR</displayName>
                    <description>Channel 3 memory 0 base address regist</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M0ADDR</name>
                            <description>Memory 0 base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3M1ADDR</name>
                    <displayName>CH3M1ADDR</displayName>
                    <description>Channel 3 memory 1 base address regist</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M1ADDR</name>
                            <description>Memory 1 base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>CH3FCTL</name>
                    <displayName>CH3FCTL</displayName>
                    <description>Channel 3 FIFO control regist</description>
                    <addressOffset>0x6c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FEEIE</name>
                            <description>Enable bit for FIFO error and exception interrupt</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCNT</name>
                            <description>FIFO counter</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDMEN</name>
                            <description>Multi-data mode enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCCV</name>
                            <description>FIFO counter critical value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4CTL</name>
                    <displayName>CH4CTL</displayName>
                    <description>Channel 4 control regist</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MBURST</name>
                            <description>Transfer burst type of memory</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBURST</name>
                            <description>Transfer burst type of peripheral</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBS</name>
                            <description>Memory buffer select</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBMEN</name>
                            <description>Switch-buffer mode enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRIO</name>
                            <description>Priority level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAIF</name>
                            <description>Peripheral address increment fixed</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MWIDTH</name>
                            <description>Transfer width of memory</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWIDTH</name>
                            <description>Transfer width of peripheral</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MNAGA</name>
                            <description>Next address generation algorithm of memory</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PNAGA</name>
                            <description>Next address generation algorithm of peripheral</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEN</name>
                            <description>Circular mode enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TM</name>
                            <description>Transfer mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                     
                        <field>
                            <name>FTFIE</name>
                            <description>Enable bit for full transfer finish interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTFIE</name>
                            <description>Enable bit for half transfer finish interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TAEIE</name>
                            <description>Enable bit for tranfer access error interrupt</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDEIE</name>
                            <description>Enable bit for single data mode exception interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4CNT</name>
                    <displayName>CH4CNT</displayName>
                    <description>Channel 4 counter regist</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transfer counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
