burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>RM_CH14CFG</name>
                    <displayName>RM_CH14CFG</displayName>
                    <description>Request multiplexer channel 14 configuration regist</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_CH15CFG</name>
                    <displayName>RM_CH15CFG</displayName>
                    <description>Request multiplexer channel 15 configuration regist</description>
                    <addressOffset>0x3c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_INTF</name>
                    <displayName>RM_INTF</displayName>
                    <description>Request multiplexer channel interrupt flag register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SOIF15</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF14</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF13</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF12</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF11</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF10</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF9</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF8</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF7</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF6</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF5</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF4</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF3</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF2</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF1</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOIF0</name>
                            <description>Synchronization overrun event flag of request multiplexer channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_INTC</name>
                    <displayName>RM_INTC</displayName>
                    <description>Request multiplexer channel interrupt flag clear register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SOIFC15</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC14</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC13</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC12</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC11</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC10</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC9</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC8</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC7</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC6</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC5</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC4</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC3</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC2</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC1</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC0</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>




                    </fields>
                </register>
                <register>
                    <name>RG_CH0CFG</name>
                    <displayName>RG_CH0CFG</displayName>
                    <description>Request generator channel 0 configuration regist</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
