burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>RG_CH1CFG</name>
                    <displayName>RG_CH1CFG</displayName>
                    <description>Request generator channel 1 configuration regist</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH2CFG</name>
                    <displayName>RG_CH2CFG</displayName>
                    <description>Request generator channel 2 configuration regist</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH3CFG</name>
                    <displayName>RG_CH3CFG</displayName>
                    <description>Request generator channel 3 configuration regist</description>
                    <addressOffset>0x10c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH4CFG</name>
                    <displayName>RG_CH4CFG</displayName>
                    <description>Request generator channel 4 configuration regist</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH5CFG</name>
                    <displayName>RG_CH5CFG</displayName>
                    <description>Request generator channel 5 configuration regist</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH6CFG</name>
                    <displayName>RG_CH6CFG</displayName>
                    <description>Request generator channel 6 configuration regist</description>
                    <addressOffset>0x118</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH7CFG</name>
                    <displayName>RG_CH7CFG</displayName>
                    <description>Request generator channel 7 configuration regist</description>
                    <addressOffset>0x11c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_INTF</name>
                    <displayName>RG_INTF</displayName>
                    <description>Request generator channel interrupt flag register</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TOIF7</name>
                            <description>Trigger overrun event flag of request generator channel 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF6</name>
                            <description>Trigger overrun event flag of request generator channel 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF5</name>
                            <description>Trigger overrun event flag of request generator channel 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF4</name>
                            <description>Trigger overrun event flag of request generator channel 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF3</name>
                            <description>Trigger overrun event flag of request generator channel 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF2</name>
                            <description>Trigger overrun event flag of request generator channel 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF1</name>
                            <description>Trigger overrun event flag of request generator channel 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF0</name>
                            <description>Trigger overrun event flag of request generator channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_INTC</name>
                    <displayName>RG_INTC</displayName>
                    <description>Rquest generator channel interrupt flag clear register</description>
                    <addressOffset>0x144</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TOIFC7</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC6</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC5</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC4</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC3</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC2</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC1</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC0</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
