burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>EVEN0</name>
                    <displayName>EVEN0</displayName>
                    <description>Event enable register  0 (EXTI_EVEN0)</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EVEN0</name>
                            <description>Enable Event on line 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN1</name>
                            <description>Enable Event on line 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN2</name>
                            <description>Enable Event on line 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN3</name>
                            <description>Enable Event on line 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN4</name>
                            <description>Enable Event on line 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN5</name>
                            <description>Enable Event on line 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN6</name>
                            <description>Enable Event on line 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN7</name>
                            <description>Enable Event on line 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN8</name>
                            <description>Enable Event on line 8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN9</name>
                            <description>Enable Event on line 9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN10</name>
                            <description>Enable Event on line 10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN11</name>
                            <description>Enable Event on line 11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN12</name>
                            <description>Enable Event on line 12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN13</name>
                            <description>Enable Event on line 13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN14</name>
                            <description>Enable Event on line 14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN15</name>
                            <description>Enable Event on line 15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN16</name>
                            <description>Enable Event on line 16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN17</name>
                            <description>Enable Event on line 17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN18</name>
                            <description>Enable Event on line 18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN19</name>
                            <description>Enable Event on line 19</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN20</name>
                            <description>Enable Event on line 20</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN21</name>
                            <description>Enable Event on line 21</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN22</name>
                            <description>Enable Event on line 22</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN23</name>
                            <description>Enable Event on line 23</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN24</name>
                            <description>Enable Event on line 24</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN25</name>
                            <description>Enable Event on line 25</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN26</name>
                            <description>Enable Event on line 26</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN27</name>
                            <description>Enable Event on line 27</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN28</name>
                            <description>Enable Event on line 28</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN29</name>
                            <description>Enable Event on line 29</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN30</name>
                            <description>Enable Event on line 30</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN31</name>
                            <description>Enable Event on line 31</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTEN0</name>
                    <displayName>RTEN0</displayName>
                    <description>
                        Rising Edge Trigger Enable register 0
                        (EXTI_RTEN0)
                    </description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTEN0</name>
                            <description>
                                Rising edge trigger enable of
                                line 0
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN1</name>
                            <description>
                                Rising edge trigger enable of
                                line 1
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN2</name>
                            <description>
                                Rising edge trigger enable of
                                line 2
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN3</name>
                            <description>
                                Rising edge trigger enable of
                                line 3
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN4</name>
                            <description>
                                Rising edge trigger enable of
                                line 4
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN5</name>
                            <description>
                                Rising edge trigger enable of
                                line 5
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN6</name>
                            <description>
                                Rising edge trigger enable of
                                line 6
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN7</name>
                            <description>
                                Rising edge trigger enable of
                                line 7
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN8</name>
                            <description>
                                Rising edge trigger enable of
                                line 8
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN9</name>
                            <description>
                                Rising edge trigger enable of
                                line 9
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN10</name>
                            <description>
                                Rising edge trigger enable of
                                line 10
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN11</name>
                            <description>
                                Rising edge trigger enable of
                                line 11
                            </description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN12</name>
                            <description>
                                Rising edge trigger enable of
                                line 12
                            </description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN13</name>
                            <description>
                                Rising edge trigger enable of
                                line 13
                            </description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN14</name>
                            <description>
                                Rising edge trigger enable of
                                line 14
                            </description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN15</name>
                            <description>
                                Rising edge trigger enable of
                                line 15
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN16</name>
                            <description>
                                Rising edge trigger enable of
                                line 16
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN17</name>
                            <description>
                                Rising edge trigger enable of
                                line 17
                            </description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN18</name>
                            <description>
                                Rising edge trigger enable of
                                line 18
                            </description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN19</name>
                            <description>
                                Rising edge trigger enable of
                                line 19
                            </description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN20</name>
                            <description>
                                Rising edge trigger enable of
                                line 20
                            </description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN21</name>
                            <description>
                                Rising edge trigger enable of
                                line 21
                            </description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN22</name>
                            <description>
                                Rising edge trigger enable of
                                line 22
                            </description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN23</name>
                            <description>
                                Rising edge trigger enable of
                                line 23
                            </description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN24</name>
                            <description>
                                Rising edge trigger enable of
                                line 24
                            </description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN25</name>
                            <description>
                                Rising edge trigger enable of
                                line 25
                            </description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN26</name>
                            <description>
                                Rising edge trigger enable of
                                line 26
                            </description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN27</name>
                            <description>
                                Rising edge trigger enable of
                                line 27
                            </description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN28</name>
                            <description>
                                Rising edge trigger enable of
                                line 28
                            </description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN29</name>
                            <description>
                                Rising edge trigger enable of
                                line 29
                            </description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN30</name>
                            <description>
                                Rising edge trigger enable of
                                line 30
                            </description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN31</name>
                            <description>
                                Rising edge trigger enable of
                                line 31
                            </description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
