burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>SWIEV0</name>
                    <displayName>SWIEV0</displayName>
                    <description>
                        Software interrupt event register
                        (EXTI_SWIEV0)
                    </description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWIEV0</name>
                            <description>
                                Interrupt/Event software trigger on line
                                0
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV1</name>
                            <description>
                                Interrupt/Event software trigger on line
                                1
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV2</name>
                            <description>
                                Interrupt/Event software trigger on line
                                2
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV3</name>
                            <description>
                                Interrupt/Event software trigger on line
                                3
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV4</name>
                            <description>
                                Interrupt/Event software trigger on line
                                4
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV5</name>
                            <description>
                                Interrupt/Event software trigger on line
                                5
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV6</name>
                            <description>
                                Interrupt/Event software trigger on line
                                6
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV7</name>
                            <description>
                                Interrupt/Event software trigger on line
                                7
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV8</name>
                            <description>
                                Interrupt/Event software trigger on line
                                8
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV9</name>
                            <description>
                                Interrupt/Event software trigger on line
                                9
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV10</name>
                            <description>
                                Interrupt/Event software trigger on line
                                10
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV11</name>
                            <description>
                                Interrupt/Event software trigger on line
                                11
                            </description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV12</name>
                            <description>
                                Interrupt/Event software trigger on line
                                12
                            </description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV13</name>
                            <description>
                                Interrupt/Event software trigger on line
                                13
                            </description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV14</name>
                            <description>
                                Interrupt/Event software trigger on line
                                14
                            </description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV15</name>
                            <description>
                                Interrupt/Event software trigger on line
                                15
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV16</name>
                            <description>
                                Interrupt/Event software trigger on line
                                16
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV17</name>
                            <description>
                                Interrupt/Event software trigger on line
                                17
                            </description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV18</name>
                            <description>
                                Interrupt/Event software trigger on line
                                18
                            </description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV19</name>
                            <description>
                                Interrupt/Event software trigger on line
                                19
                            </description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV20</name>
                            <description>
                                Interrupt/Event software trigger on line
                                20
                            </description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV21</name>
                            <description>
                                Interrupt/Event software trigger on line
                                21
                            </description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV22</name>
                            <description>
                                Interrupt/Event software trigger on line
                                22
                            </description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV23</name>
                            <description>
                                Interrupt/Event software trigger on line
                                23
                            </description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV24</name>
                            <description>
                                Interrupt/Event software trigger on line
                                24
                            </description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV25</name>
                            <description>
                                Interrupt/Event software trigger on line
                                25
                            </description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV26</name>
                            <description>
                                Interrupt/Event software trigger on line
                                26
                            </description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV27</name>
                            <description>
                                Interrupt/Event software trigger on line
                                27
                            </description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV28</name>
                            <description>
                                Interrupt/Event software trigger on line
                                28
                            </description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV29</name>
                            <description>
                                Interrupt/Event software trigger on line
                                29
                            </description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV30</name>
                            <description>
                                Interrupt/Event software trigger on line
                                30
                            </description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV31</name>
                            <description>
                                Interrupt/Event software trigger on line
                                31
                            </description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
