burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>SWIEV1</name>
                    <displayName>SWIEV1</displayName>
                    <description>
                        Software interrupt event register
                        (EXTI_SWIEV1)
                    </description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWIEV32</name>
                            <description>
                                Interrupt/Event software trigger on line
                                32
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV33</name>
                            <description>
                                Interrupt/Event software trigger on line
                                33
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV34</name>
                            <description>
                                Interrupt/Event software trigger on line
                                34
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV35</name>
                            <description>
                                Interrupt/Event software trigger on line
                                35
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV36</name>
                            <description>
                                Interrupt/Event software trigger on line
                                36
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV37</name>
                            <description>
                                Interrupt/Event software trigger on line
                                37
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PD1</name>
                    <displayName>PD1</displayName>
                    <description>Pending register (EXTI_PD1)</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PD32</name>
                            <description>Interrupt pending status of line 32</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD33</name>
                            <description>Interrupt pending status of line 33</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD34</name>
                            <description>Interrupt pending status of line 34</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD35</name>
                            <description>Interrupt pending status of line 35</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD36</name>
                            <description>Interrupt pending status of line 36</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD37</name>
                            <description>Interrupt pending status of line 37</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ENET0_DMA</name>
            <description>Ethernet: DMA controller operation</description>
            <groupName>ENET0</groupName>
            <baseAddress>0x40029000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x60</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DMA_BCTL</name>
                    <displayName>DMA_BCTL</displayName>
                    <description>Ethernet DMA bus control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00020101</resetValue>
                    <fields>
                        <field>
                            <name>SWR</name>
                            <description>Software reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAB</name>
                            <description>DMA Arbitration</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DPSL</name>
                            <description>Descriptor skip length</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DFM</name>
                            <description>Descriptor format mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PGBL</name>
                            <description>Programmable burst length</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>RTPR</name>
                            <description>RxDMA and TxDMA transfer priority ratio</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FB</name>
                            <description>Fixed burst</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDP</name>
                            <description>Rx DMA PGBL</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>UIP</name>
                            <description>Use independent PGBL</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FPBL</name>
                            <description>Four times PGBL mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AA</name>
                            <description>Address-aligned</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MB</name>
                            <description>Mixed burst</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TPEN</name>
                    <displayName>DMA_TPEN</displayName>
                    <description>
                        Ethernet DMA transmit poll enable
                        register
                    </description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TPE</name>
                            <description>Transmit poll enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RPEN</name>
                    <displayName>DMA_RPEN</displayName>
                    <description>
                        Ethernet DMA receive poll enable
                        register
                    </description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RPE</name>
                            <description>Receive poll enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RDTADDR</name>
                    <displayName>DMA_RDTADDR</displayName>
                    <description>
                        Ethernet DMA receive descriptor table address
                        register
                    </description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SRT</name>
                            <description>Start address of receive table</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TDTADDR</name>
                    <displayName>DMA_TDTADDR</displayName>
                    <description>
                        Ethernet DMA transmit descriptor table
                        address register
                    </description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STT</name>
                            <description>Start address of transmit table</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_STAT</name>
                    <displayName>DMA_STAT</displayName>
                    <description>Ethernet DMA status register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TS</name>
                            <description>Transmit status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TPS</name>
                            <description>
                                Transmit process stopped
                                status
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBU</name>
                            <description>
                                Transmit buffer unavailable
                                status
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TJT</name>
                            <description>
                                Transmit jabber timeout
                                status
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RO</name>
                            <description>Receive overflow status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TU</name>
                            <description>Transmit underflow status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RS</name>
                            <description>Receive status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RBU</name>
                            <description>
                                Receive buffer unavailable
                                status
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPS</name>
                            <description>
                                Receive process stopped
                                status
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RWT</name>
                            <description>
                                Receive watchdog timeout
                                status
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ET</name>
                            <description>Early transmit status</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FBE</name>
                            <description>Fatal bus error status</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ER</name>
                            <description>Early receive status</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AI</name>
                            <description>Abnormal interrupt summary</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NI</name>
                            <description>Normal interrupt summary</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RP</name>
                            <description>Receive process state</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TP</name>
                            <description>Transmit process state</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EB</name>
                            <description>Error bits status</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSC</name>
                            <description>MSC status</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WUM</name>
                            <description>WUM status</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TST</name>
                            <description>Time stamp trigger status</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
