burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>DMA_CTL</name>
                    <displayName>DMA_CTL</displayName>
                    <description>
                        Ethernet DMA control
                        register
                    </description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SRE</name>
                            <description>Start/stop receive enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OSF</name>
                            <description>Operate on second frame</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTHC</name>
                            <description>Receive threshold control</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FUF</name>
                            <description>Forward undersized good frames</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FERF</name>
                            <description>Forward error frames</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STE</name>
                            <description>Start/stop transmission enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TTHC</name>
                            <description>Transmit threshold control</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>FTF</name>
                            <description>Flush transmit FIFO</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFD</name>
                            <description>Transmit Store-and-Forward</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAFRF</name>
                            <description>Disable flushing of received frames</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RSFD</name>
                            <description>Receive Store-and-Forward</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTCERFD</name>
                            <description>Dropping of TCP/IP checksum error frames disable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_INTEN</name>
                    <displayName>DMA_INTEN</displayName>
                    <description>
                        Ethernet DMA interrupt enable
                        register
                    </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIE</name>
                            <description>Transmit interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPSIE</name>
                            <description>
                                Transmit process stopped interrupt
                                enable
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TBUIE</name>
                            <description>
                                Transmit buffer unavailable interrupt
                                enable
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TJTIE</name>
                            <description>
                                Transmit jabber timeout interrupt
                                enable
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ROIE</name>
                            <description>Receive overflow interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TUIE</name>
                            <description>Transmit underflow interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>Receive interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RBUIE</name>
                            <description>
                                Receive buffer unavailable interrupt
                                enable
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RPSIE</name>
                            <description>
                                Receive process stopped interrupt
                                enable
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RWTIE</name>
                            <description>
                                receive watchdog timeout interrupt
                                enable
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETIE</name>
                            <description>
                                Early transmit interrupt
                                enable
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FBEIE</name>
                            <description>
                                Fatal bus error interrupt
                                enable
                            </description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERIE</name>
                            <description>
                                Early receive interrupt
                                enable
                            </description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AIE</name>
                            <description>
                                Abnormal interrupt summary
                                enable
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NIE</name>
                            <description>
                                Normal interrupt summary
                                enable
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_MFBOCNT</name>
                    <displayName>DMA_MFBOCNT</displayName>
                    <description>
                        Ethernet DMA missed frame and buffer
                        overflow counter register
                    </description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSFC</name>
                            <description>
                                Missed frames by the
                                controller
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MSFA</name>
                            <description>
                                Missed frames by the
                                application
                            </description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RSWDC</name>
                    <displayName>DMA_RSWDC</displayName>
                    <description>
                        Ethernet DMA receive state watchdog counter
                        register
                    </description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WDCFRS</name>
                            <description>Watchdog counter for receive status (RS)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CTDADDR</name>
                    <displayName>DMA_CTDADDR</displayName>
                    <description>
                        DMA current transmit descriptor address
                        register
                    </description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TDAP</name>
                            <description>
                                transmit descriptor address
                                pointer
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CRDADDR</name>
                    <displayName>DMA_CRDADDR</displayName>
                    <description>
                        Ethernet DMA current receive descriptor address
                        register
                    </description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDAP</name>
                            <description>Receive descriptor address pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CTBADDR</name>
                    <displayName>DMA_CTBADDR</displayName>
                    <description>
                        Ethernet DMA current transmit buffer address
                        register
                    </description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TBAP</name>
                            <description>Transmit buffer address pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CRBADDR</name>
                    <displayName>DMA_CRBADDR</displayName>
                    <description>
                        Ethernet DMA current receive buffer address
                        register
                    </description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RBAP</name>
                            <description>
                                receive buffer address
                                pointer
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
