burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>MAC_WUM</name>
                    <displayName>MAC_WUM</displayName>
                    <description>
                        Ethernet MAC wakeup management register
                        (MAC_WUM)
                    </description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PWD</name>
                            <description>Power down</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MPEN</name>
                            <description>Magic Packet enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WFEN</name>
                            <description>Wakeup frame enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MPKR</name>
                            <description>Magic packet received</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUFR</name>
                            <description>Wakeup frame received</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GU</name>
                            <description>Global unicast</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUFFRPR</name>
                            <description>
                                Wakeup frame filter register pointer
                                reset
                            </description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_DBG</name>
                    <displayName>MAC_DBG</displayName>
                    <description>
                        Ethernet MAC debug register
                        (MAC_DBG)
                    </description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MRNI</name>
                            <description>MAC receive state not idle</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXAFS</name>
                            <description>Rx asynchronous FIFO status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXFW</name>
                            <description>RxFIFO is writing</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFRS</name>
                            <description>RxFIFO read operation status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXFS</name>
                            <description>RxFIFO state</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>

                        <field>
                            <name>MTNI</name>
                            <description>MAC transmit state not idle</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOMT</name>
                            <description>Status of MAC transmitter</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCS</name>
                            <description>Pause condition status</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFRS</name>
                            <description>TxFIFO read operation status</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXFW</name>
                            <description>TxFIFO is writing</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFNE</name>
                            <description>TxFIFO not empty flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFF</name>
                            <description>TxFIFO Full flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_INTF</name>
                    <displayName>MAC_INTF</displayName>
                    <description>
                        Ethernet MAC interrupt flag register
                        (MAC_INTF)
                    </description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WUM</name>
                            <description>WUM status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSC</name>
                            <description>MSC status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSCR</name>
                            <description>MSC receive status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSCT</name>
                            <description>MSC transmit status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMST</name>
                            <description>Time stamp trigger status</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_INTMSK</name>
                    <displayName>MAC_INTMSK</displayName>
                    <description>
                        Ethernet MAC interrupt mask register
                        (MAC_INTMSK)
                    </description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WUMIM</name>
                            <description>WUM interrupt mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMSTIM</name>
                            <description>
                                Time stamp trigger interrupt
                                mask
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR0H</name>
                    <displayName>MAC_ADDR0H</displayName>
                    <description>
                        Ethernet MAC address 0 high register
                        (MAC_ADDR0H)
                    </description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x8000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR0H</name>
                            <description>MAC  address0 high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MO</name>
                            <description>Always 1</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR0L</name>
                    <displayName>MAC_ADDR0L</displayName>
                    <description>
                        Ethernet MAC address 0 low
                        register
                    </description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR0L</name>
                            <description>MAC address0 low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR1H</name>
                    <displayName>MAC_ADDR1H</displayName>
                    <description>
                        Ethernet MAC address 1 high register
                        (MAC_ADDR1H)
                    </description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1H</name>
                            <description>MAC address1 high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MB</name>
                            <description>Mask byte</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>SAF</name>
                            <description>Source address filter</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AFE</name>
                            <description>Address filter enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR1L</name>
                    <displayName>MAC_ADDR1L</displayName>
                    <description>
                        Ethernet MAC address1 low
                        register
                    </description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1L</name>
                            <description>MAC address1 low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR2H</name>
                    <displayName>MAC_ADDR2H</displayName>
                    <description>
                        Ethernet MAC address 2 high register
                        (MAC_ADDR2H)
                    </description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR2H</name>
                            <description>
                                Ethernet MAC address 2 high
                                register
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MB</name>
                            <description>Mask byte</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>SAF</name>
                            <description>Source address filter</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AFE</name>
                            <description>Address filter enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR2L</name>
                    <displayName>MAC_ADDR2L</displayName>
                    <description>
                        Ethernet MAC address 2 low
                        register
                    </description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR2L</name>
                            <description>MAC address2 low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR3H</name>
                    <displayName>MAC_ADDR3H</displayName>
                    <description>
                        Ethernet MAC address 3 high register
                        (MAC_ADDR3H)
                    </description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR3H</name>
                            <description>MAC address3 high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MB</name>
                            <description>Mask byte</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>SAF</name>
                            <description>Source  address filter</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AFE</name>
                            <description>Address filter enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAC_ADDR3L</name>
                    <displayName>MAC_ADDR3L</displayName>
                    <description>
                        Ethernet MAC address 3 low
                        register
                    </description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR3L</name>
                            <description>MAC address3 low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
