burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ENET0_PTP</name>
            <description>Ethernet: Precision time protocol</description>
            <groupName>ENET0</groupName>
            <baseAddress>0x40028700</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PTP_TSCTL</name>
                    <displayName>PTP_TSCTL</displayName>
                    <description>
                        Ethernet PTP time stamp control register
                        (PTP_TSCTL)
                    </description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00002000</resetValue>
                    <fields>
                        <field>
                            <name>TMSEN</name>
                            <description>Time stamp enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMSFCU</name>
                            <description>
                                Time stamp fine or coarse
                                update
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMSSTI</name>
                            <description>
                                Time stamp system time
                                initialize
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMSSTU</name>
                            <description>
                                Time stamp system time
                                update
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMSITEN</name>
                            <description>
                                Time stamp interrupt trigger
                                enable
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMSARU</name>
                            <description>
                                Time stamp addend register
                                update
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARFSEN</name>
                            <description>All received frames snapshot enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCROM</name>
                            <description>Subsecond counter rollover mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PFSV</name>
                            <description>PTP frame snooping version</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ESEN</name>
                            <description>Received Ethernet snapshot enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IP6SEN</name>
                            <description>Received IPv6 snapshot enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IP4SEN</name>
                            <description>Received IPv4 snapshot enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETMSEN</name>
                            <description>Received event type message snapshot enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MNMSEN</name>
                            <description>Received master node message snapshot enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CKNT</name>
                            <description>Clock node type for time stamp</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MAFEN</name>
                            <description>MAC address filter enable for PTP frame</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_SSINC</name>
                    <displayName>PTP_SSINC</displayName>
                    <description>
                        Ethernet PTP subsecond increment
                        register
                    </description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STMSSI</name>
                            <description>
                                System time subsecond
                                increment
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSH</name>
                    <displayName>PTP_TSH</displayName>
                    <description>
                        Ethernet PTP time stamp high
                        register
                    </description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STMS</name>
                            <description>System time second</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSL</name>
                    <displayName>PTP_TSL</displayName>
                    <description>
                        Ethernet PTP time stamp low register
                        (PTP_TSL)
                    </description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STMSS</name>
                            <description>System time subseconds</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                        <field>
                            <name>STS</name>
                            <description>System time sign</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSUH</name>
                    <displayName>PTP_TSUH</displayName>
                    <description>
                        Ethernet PTP time stamp high update
                        register
                    </description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSUS</name>
                            <description>Time stamp update second</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSUL</name>
                    <displayName>PTP_TSUL</displayName>
                    <description>
                        Ethernet PTP time stamp low update register
                        (PTP_TSUL)
                    </description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSUSS</name>
                            <description>
                                Time stamp update
                                subseconds
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                        <field>
                            <name>TMSUPNS</name>
                            <description>
                                Time stamp update positive or negative
                                sign
                            </description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSADDEND</name>
                    <displayName>PTP_TSADDEND</displayName>
                    <description>
                        Ethernet PTP time stamp addend
                        register
                    </description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSA</name>
                            <description>Time stamp addend</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_ETH</name>
                    <displayName>PTP_ETH</displayName>
                    <description>
                        Ethernet PTP expected time high
                        register
                    </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ETSH</name>
                            <description>Expected time stamp high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_ETL</name>
                    <displayName>PTP_ETL</displayName>
                    <description>
                        Ethernet PTP expected time low
                        register
                    </description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ETSL</name>
                            <description>Expected time stamp low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_TSF</name>
                    <displayName>PTP_TSF</displayName>
                    <description>
                        Ethernet PTP time stamp flag
                        register
                    </description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSSCO</name>
                            <description>Timestamp second counter overflow</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TTM</name>
                            <description>Target time match</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTP_PPSCTL</name>
                    <displayName>PTP_PPSCTL</displayName>
                    <description>
                        Ethernet PTP PPS control
                        register
                    </description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PPSOFC</name>
                            <description>PPS output frequency configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
