burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>ENET1_MSC</name>
            <description>Ethernet: MAC statistics counters</description>
            <groupName>ENET1</groupName>
            <baseAddress>0x4002A100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MSC_CTL</name>
                    <displayName>MSC_CTL</displayName>
                    <description>
                        Ethernet MSC control register
                        (MSC_CTL)
                    </description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTR</name>
                            <description>Counter reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTSR</name>
                            <description>Counter stop rollover</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTOR</name>
                            <description>Reset on read</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCFZ</name>
                            <description>MSC counter freeze</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PMC</name>
                            <description>Preset MSC counter</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>AFHPM</name>
                            <description>Almost full or half preset mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_RINTF</name>
                    <displayName>MSC_RINTF</displayName>
                    <description>
                        Ethernet MSC receive interrupt flag register
                        (MSC_RINTF)
                    </description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFCE</name>
                            <description>Received frames CRC error</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFAE</name>
                            <description>Received frames alignment error</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RGUF</name>
                            <description>Received Good Unicast Frames</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_TINTF</name>
                    <displayName>MSC_TINTF</displayName>
                    <description>
                        Ethernet MSC transmit interrupt flag register
                        (MSC_TINTF)
                    </description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TGFSC</name>
                            <description>Transmitted good frames single collision</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TGFMSC</name>
                            <description>
                                Transmitted good frames more single
                                collision
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TGF</name>
                            <description>Transmitted good frames</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_RINTMSK</name>
                    <displayName>MSC_RINTMSK</displayName>
                    <description>
                        Ethernet MSC receive interrupt mask register
                        (MSC_RINTMSK)
                    </description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFCEIM</name>
                            <description>
                                Received frame CRC error interrupt
                                mask
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFAEIM</name>
                            <description>
                                Received frames alignment error interrupt
                                mask
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RGUFIM</name>
                            <description>
                                Received good unicast frames interrupt
                                mask
                            </description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_TINTMSK</name>
                    <displayName>MSC_TINTMSK</displayName>
                    <description>
                        Ethernet MSC transmit interrupt mask
                        register (MSC_TINTMSK)
                    </description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TGFSCIM</name>
                            <description>
                                Transmitted good frames single collision interrupt
                                mask
                            </description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TGFMSCIM</name>
                            <description>
                                Transmitted good frames more single interrupt
                                collision mask
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TGFIM</name>
                            <description>
                                Transmitted good frames interrupt
                                mask
                            </description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_SCCNT</name>
                    <displayName>MSC_SCCNT</displayName>
                    <description>
                        Ethernet MSC transmitted good frames after a
                        single collision counter
                    </description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCC</name>
                            <description>
                                Transmitted good frames after a single
                                collision counter
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_MSCCNT</name>
                    <displayName>MSC_MSCCNT</displayName>
                    <description>
                        Ethernet MSC transmitted good frames after
                        more than a single collision
                    </description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSCC</name>
                            <description>
                                Transmitted good frames after more than
                                a single collision counter
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_TGFCNT</name>
                    <displayName>MSC_TGFCNT</displayName>
                    <description>
                        Ethernet MSC transmitted good frames counter
                        register
                    </description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TGF</name>
                            <description>
                                Transmitted good frames
                                counter
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_RFCECNT</name>
                    <displayName>MSC_RFCECNT</displayName>
                    <description>
                        Ethernet MSC received frames with CRC error
                        counter register
                    </description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFCER</name>
                            <description>
                                Received frames with CRC error
                                counter
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_RFAECNT</name>
                    <displayName>MSC_RFAECNT</displayName>
                    <description>
                        Ethernet MSC received frames with alignment
                        error counter register
                    </description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFAER</name>
                            <description>
                                Received frames with alignment error
                                counter
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC_RGUFCNT</name>
                    <displayName>MSC_RGUFCNT</displayName>
                    <description>
                        MSC received good unicast frames counter
                        register
                    </description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RGUF</name>
                            <description>
                                Received good unicast frames
                                counter
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
