burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>
  <peripheral>
      <name>FAC</name>
      <description>Filter arithmetic accelerator</description>
      <groupName>FAC</groupName>
      <baseAddress>0x48024800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
            <interrupt>
                <name>FAC_GLOBAL</name>
                <value>153</value>
            </interrupt>
      <registers>
    <register>
        <name>X0BCFG</name>
        <displayName>X0BCFG</displayName>
        <description>FAC X0 buffer configure register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>X0_WBFF</name>
            <description>Buffer full flag of watermark</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>X0B_SIZE</name>
            <description>X0 buffer size, the number of feed-forward taps</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>X0B_ADDR</name>
            <description>X0 buffer base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
     <register>
        <name>X1BCFG</name>
        <displayName>X1BCFG</displayName>
        <description>FAC X1 buffer configure register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>X1B_SIZE</name>
            <description>X1 buffer size</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>X1B_ADDR</name>
            <description>X1 buffer base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
    <register>
        <name>YBCFG</name>
        <displayName>YBCFG</displayName>
        <description>FAC Y buffer configure register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>Y_WBEF</name>
            <description>Buffer empty flag of watermark</description>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>YB_SIZE</name>
            <description>Y buffer size</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>YB_ADDR</name>
            <description>Y buffer base address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
    <register>
        <name>PARACFG</name>
        <displayName>PARACFG</displayName>
        <description>FAC Parameter configure register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>EXE</name>
            <description>Execution</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FUN</name>
            <description>Function</description>
            <bitOffset>24</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IPR</name>
            <description>Input parameter IPR</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IPQ</name>
            <description>Input parameter IPQ</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IPP</name>
            <description>Input parameter IPP</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
    <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>FAC Control register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>RST</name>
            <description>Reset FAC unit</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CPEN</name>
            <description>Clipping enable</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FLTEN</name>
            <description>Floating point format enable</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DWEN</name>
            <description>DMA write channel enable</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DREN</name>
            <description>DMA read channel enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GSTEIE</name>
            <description>Gain saturation error interrupt enable</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STEIE</name>
            <description>Saturation error interrupt enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>UFEIE</name>
            <description>Underflow error interrupt enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OFEIE</name>
            <description>Overflow error interrupt enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WIE</name>
            <description>Write interrupt enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RIE</name>
            <description>Read interrupt enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
    <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>FAC Status register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000001</resetValue>
        <fields>
 <field>
            <name>GSTEF</name>
            <description>Gain saturation error flag, it is set when gain exceed range</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>STEF</name>
            <description>Saturation error flag</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>UFEF</name>
            <description>Underflow error flag</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OFEF</name>
            <description>Overflow error flag</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>X0BFF</name>
            <description>X0 buffer full flag</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>YBEF</name>
            <description>Y buffer empty flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
      </fields>
        </register>
    <register>
        <name>WDATA</name>
        <displayName>WDATA</displayName>
        <description>FAC write data register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>WDATA</name>
            <description>Write data</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
    <register>
        <name>RDATA</name>
        <displayName>RDATA</displayName>
        <description>FAC read data register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>RDATA</name>
            <description>Read data</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
