burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

        <peripheral derivedFrom="GPIOC">
            <name>GPIOD</name>
            <baseAddress>0x58020C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOC">
            <name>GPIOE</name>
            <baseAddress>0x58021000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOC">
            <name>GPIOF</name>
            <baseAddress>0x58021400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOC">
            <name>GPIOG</name>
            <baseAddress>0x58021800</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOC">
            <name>GPIOH</name>
            <baseAddress>0x58021C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOC">
            <name>GPIOJ</name>
            <baseAddress>0x58022400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOC">
            <name>GPIOK</name>
            <baseAddress>0x58022800</baseAddress>
        </peripheral>
        <peripheral>
            <name>HAU</name>
            <description>HAU acceleration unit</description>
            <groupName>HAU</groupName>
            <baseAddress>0x48021400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HAU_TRNG</name>
                <value>80</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL</name>
                    <displayName>CTL</displayName>
                    <description>HAU control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ALGM</name>
                            <description>Algorithm selection bit 1</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KLM</name>
                            <description>Key length mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDS</name>
                            <description>Multiple DMA selection</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DINE</name>
                            <description>DI register is not empty</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NWIF</name>
                            <description>Number of words in IN FIFO</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ALGM0</name>
                            <description>Algorithm selection bit 0</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HMS</name>
                            <description>HAU  mode selection</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAM</name>
                            <description>Data type mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAE</name>
                            <description>DMA enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START</name>
                            <description>Start message digest calculation</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DI</name>
                    <displayName>DI</displayName>
                    <description>HAU data input register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DI</name>
                            <description>Message data input</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>HAU configuration register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALEN</name>
                            <description>Digest calculation enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>VBL</name>
                            <description>Valid bits length in the last word</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO0</name>
                    <displayName>DO0</displayName>
                    <description>HAU data  output register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO0</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO1</name>
                    <displayName>DO1</displayName>
                    <description>HAU data output register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO1</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO2</name>
                    <displayName>DO2</displayName>
                    <description>HAU data output register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO2</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO3</name>
                    <displayName>DO3</displayName>
                    <description>HAU data output register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO3</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO4</name>
                    <displayName>DO4</displayName>
                    <description>HAU data output register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO4</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO5</name>
                    <displayName>DO5</displayName>
                    <description>HAU data output register</description>
                    <addressOffset>0x324</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO5</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO6</name>
                    <displayName>DO6</displayName>
                    <description>HAU data output register</description>
                    <addressOffset>0x328</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO6</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DO7</name>
                    <displayName>DO7</displayName>
                    <description>HAU data output register</description>
                    <addressOffset>0x32C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DO7</name>
                            <description>message digest result of hash algorithm</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>HAU interrupt enable register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CCIE</name>
                            <description>calculation completion interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIIE</name>
                            <description>Data input interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>HAU status and interrupt flag register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>BUSY</name>
                            <description>Busy flag bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMAS</name>
                            <description>DMA status flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CCF</name>
                            <description>Digest calculation completion flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DIF</name>
                            <description>Data input flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS0</name>
                    <displayName>CTX0</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <field>
                            <name>CTX0</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS1</name>
                    <displayName>CTX1</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX1</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS2</name>
                    <displayName>CTX2</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX2</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS3</name>
                    <displayName>CTX3</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX3</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS4</name>
                    <displayName>CTX4</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX4</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS5</name>
                    <displayName>CTX5</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX5</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS6</name>
                    <displayName>CTX6</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX6</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS7</name>
                    <displayName>CTX7</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX7</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
