burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CTXS37</name>
                    <displayName>CTX37</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX37</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS38</name>
                    <displayName>CTX38</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX38</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS39</name>
                    <displayName>CTX39</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX39</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS40</name>
                    <displayName>CTX40</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX40</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS41</name>
                    <displayName>CTX41</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x19C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX41</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS42</name>
                    <displayName>CTX42</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX42</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS43</name>
                    <displayName>CTX43</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX43</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS44</name>
                    <displayName>CTX44</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX44</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS45</name>
                    <displayName>CTX45</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX45</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS46</name>
                    <displayName>CTX46</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX46</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS47</name>
                    <displayName>CTX47</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX47</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS48</name>
                    <displayName>CTX48</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX48</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS49</name>
                    <displayName>CTX49</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX49</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS50</name>
                    <displayName>CTX50</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX50</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS51</name>
                    <displayName>CTX51</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX51</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS52</name>
                    <displayName>CTX52</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX52</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTXS53</name>
                    <displayName>CTX53</displayName>
                    <description>Context switch register x</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTX53</name>
                            <description>The complete internal status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
