burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>FLT2INTC</name>
                    <displayName>FLT2INTC</displayName>
                    <description>Filter 2 interrupt flag clear regist</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMFC</name>
                            <description>Clear the malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLFC</name>
                            <description>Clear the clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCDOFC</name>
                            <description>Clear the regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICDOFC</name>
                            <description>Clear the inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3INTC</name>
                    <displayName>FLT3INTC</displayName>
                    <description>Filter 3 interrupt flag clear regist</description>
                    <addressOffset>0x28C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMFC</name>
                            <description>Clear the malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLFC</name>
                            <description>Clear the clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCDOFC</name>
                            <description>Clear the regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICDOFC</name>
                            <description>Clear the inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0ICGS</name>
                    <displayName>FLT0ICGS</displayName>
                    <description>Filter 0 inserted channel group selection regist</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>ICGSEL</name>
                            <description>Inserted channel group selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1ICGS</name>
                    <displayName>FLT1ICGS</displayName>
                    <description>Filter 1 inserted channel group selection regist</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>ICGSEL</name>
                            <description>Inserted channel group selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2ICGS</name>
                    <displayName>FLT2ICGS</displayName>
                    <description>Filter 2 inserted channel group selection regist</description>
                    <addressOffset>0x210</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>ICGSEL</name>
                            <description>Inserted channel group selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3ICGS</name>
                    <displayName>FLT3ICGS</displayName>
                    <description>Filter 3 inserted channel group selection regist</description>
                    <addressOffset>0x290</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>ICGSEL</name>
                            <description>Inserted channel group selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0SFCFG</name>
                    <displayName>FLT0SFCFG</displayName>
                    <description>Filter 0 sinc filter configuration regist</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SFO</name>
                            <description>Sinc filter order</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFOR</name>
                            <description>Sinc filter oversampling ratio (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IOR</name>
                            <description>Integrator oversampling ratio</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1SFCFG</name>
                    <displayName>FLT1SFCFG</displayName>
                    <description>Filter 1 sinc filter configuration regist</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SFO</name>
                            <description>Sinc filter order</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFOR</name>
                            <description>Sinc filter oversampling ratio (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IOR</name>
                            <description>Integrator oversampling ratio</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT2SFCFG</name>
                    <displayName>FLT2SFCFG</displayName>
                    <description>Filter 2 sinc filter configuration regist</description>
                    <addressOffset>0x214</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SFO</name>
                            <description>Sinc filter order</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFOR</name>
                            <description>Sinc filter oversampling ratio (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IOR</name>
                            <description>Integrator oversampling ratio</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3SFCFG</name>
                    <displayName>FLT3SFCFG</displayName>
                    <description>Filter 3 sinc filter configuration regist</description>
                    <addressOffset>0x294</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SFO</name>
                            <description>Sinc filter order</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFOR</name>
                            <description>Sinc filter oversampling ratio (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IOR</name>
                            <description>Integrator oversampling ratio</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0IDATA</name>
                    <displayName>FLT0IDATA</displayName>
                    <description>Filter 0 inserted group conversion data regist</description>
                    <addressOffset>0x118</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATA</name>
                            <description>Inserted group conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICCH</name>
                            <description>Inserted channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1IDATA</name>
                    <displayName>FLT1IDATA</displayName>
                    <description>Filter 1 inserted group conversion data regist</description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATA</name>
                            <description>Inserted group conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICCH</name>
                            <description>Inserted channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT2IDATA</name>
                    <displayName>FLT2IDATA</displayName>
                    <description>Filter 2 inserted group conversion data regist</description>
                    <addressOffset>0x218</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATA</name>
                            <description>Inserted group conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICCH</name>
                            <description>Inserted channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3IDATA</name>
                    <displayName>FLT3IDATA</displayName>
                    <description>Filter 3 inserted group conversion data regist</description>
                    <addressOffset>0x298</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATA</name>
                            <description>Inserted group conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICCH</name>
                            <description>Inserted channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0RDATA</name>
                    <displayName>FLT0RDATA</displayName>
                    <description>Filter 0 regular channel conversion data regist</description>
                    <addressOffset>0x11c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDATA</name>
                            <description>Regular channel conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCHPDT</name>
                            <description>Regular channel pending data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCCH</name>
                            <description>Regular channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1RDATA</name>
                    <displayName>FLT1RDATA</displayName>
                    <description>Filter 1 regular channel conversion data regist</description>
                    <addressOffset>0x19c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDATA</name>
                            <description>Regular channel conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCHPDT</name>
                            <description>Regular channel pending data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCCH</name>
                            <description>Regular channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT2RDATA</name>
                    <displayName>FLT2RDATA</displayName>
                    <description>Filter 0 regular channel conversion data regist</description>
                    <addressOffset>0x21C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDATA</name>
                            <description>Regular channel conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCHPDT</name>
                            <description>Regular channel pending data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCCH</name>
                            <description>Regular channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
