burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>FLT3RDATA</name>
                    <displayName>FLT3RDATA</displayName>
                    <description>Filter 3 regular channel conversion data regist</description>
                    <addressOffset>0x29C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDATA</name>
                            <description>Regular channel conversion data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCHPDT</name>
                            <description>Regular channel pending data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCCH</name>
                            <description>Regular channel most recently converted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0TMHT</name>
                    <displayName>FLT0TMHT</displayName>
                    <description>Filter 0 threshold monitor high threshold regist</description>
                    <addressOffset>0x120</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTVAL</name>
                            <description>Threshold monitor high threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTBSD</name>
                            <description>High threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1TMHT</name>
                    <displayName>FLT1TMHT</displayName>
                    <description>Filter 1 threshold monitor high threshold regist</description>
                    <addressOffset>0x1a0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTVAL</name>
                            <description>Threshold monitor high threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTBSD</name>
                            <description>High threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT2TMHT</name>
                    <displayName>FLT2TMHT</displayName>
                    <description>Filter 2 threshold monitor high threshold regist</description>
                    <addressOffset>0x220</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTVAL</name>
                            <description>Threshold monitor high threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTBSD</name>
                            <description>High threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3TMHT</name>
                    <displayName>FLT3TMHT</displayName>
                    <description>Filter 3 threshold monitor high threshold regist</description>
                    <addressOffset>0x2A0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTVAL</name>
                            <description>Threshold monitor high threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTBSD</name>
                            <description>High threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0TMLT</name>
                    <displayName>FLT0TMLT</displayName>
                    <description>Filter 0 threshold monitor low threshold regist</description>
                    <addressOffset>0x124</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LTVAL</name>
                            <description>Threshold monitor low threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTBSD</name>
                            <description>Low threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1TMLT</name>
                    <displayName>FLT1TMLT</displayName>
                    <description>Filter 1 threshold monitor low threshold regist</description>
                    <addressOffset>0x1a4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LTVAL</name>
                            <description>Threshold monitor low threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTBSD</name>
                            <description>Low threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2TMLT</name>
                    <displayName>FLT2TMLT</displayName>
                    <description>Filter 2 threshold monitor low threshold regist</description>
                    <addressOffset>0x224</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LTVAL</name>
                            <description>Threshold monitor low threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTBSD</name>
                            <description>Low threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3TMLT</name>
                    <displayName>FLT3TMLT</displayName>
                    <description>Filter 3 threshold monitor low threshold regist</description>
                    <addressOffset>0x2A4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LTVAL</name>
                            <description>Threshold monitor low threshold value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTBSD</name>
                            <description>Low threshold event break signal distribution</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0TMSTAT</name>
                    <displayName>FLT0TMSTAT</displayName>
                    <description>Filter 0 threshold monitor status regist</description>
                    <addressOffset>0x128</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTF</name>
                            <description>Threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LTF</name>
                            <description>Threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1TMSTAT</name>
                    <displayName>FLT1TMSTAT</displayName>
                    <description>Filter 1 threshold monitor status regist</description>
                    <addressOffset>0x1a8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTF</name>
                            <description>Threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LTF</name>
                            <description>Threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2TMSTAT</name>
                    <displayName>FLT2TMSTAT</displayName>
                    <description>Filter 2 threshold monitor status regist</description>
                    <addressOffset>0x228</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTF</name>
                            <description>Threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LTF</name>
                            <description>Threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3TMSTAT</name>
                    <displayName>FLT3TMSTAT</displayName>
                    <description>Filter 3 threshold monitor status regist</description>
                    <addressOffset>0x3A8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTF</name>
                            <description>Threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LTF</name>
                            <description>Threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0TMFC</name>
                    <displayName>FLT0TMFC</displayName>
                    <description>Filter 0 threshold monitor flag clear regist</description>
                    <addressOffset>0x12c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTFC</name>
                            <description>Clear the threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTFC</name>
                            <description>Clear the threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1TMFC</name>
                    <displayName>FLT1TMFC</displayName>
                    <description>Filter 1 threshold monitor flag clear regist</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTFC</name>
                            <description>Clear the threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTFC</name>
                            <description>Clear the threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2TMFC</name>
                    <displayName>FLT2TMFC</displayName>
                    <description>Filter 2 threshold monitor flag clear regist</description>
                    <addressOffset>0x22C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTFC</name>
                            <description>Clear the threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTFC</name>
                            <description>Clear the threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3TMFC</name>
                    <displayName>FLT3TMFC</displayName>
                    <description>Filter 3 threshold monitor flag clear regist</description>
                    <addressOffset>0x2AC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTFC</name>
                            <description>Clear the threshold monitor high threshold flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTFC</name>
                            <description>Clear the threshold monitor low threshold flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>FLT0EMMAX</name>
                    <displayName>FLT0EMMAX</displayName>
                    <description>Filter 0 extremes monitor maximum regist</description>
                    <addressOffset>0x130</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x80000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXVAL</name>
                            <description>Extremes monitor maximum value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MAXDC</name>
                            <description>Extremes monitor maximum data channel</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1EMMAX</name>
                    <displayName>FLT1EMMAX</displayName>
                    <description>Filter 1 extremes monitor maximum regist</description>
                    <addressOffset>0x1b0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x80000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXVAL</name>
                            <description>Extremes monitor maximum value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MAXDC</name>
                            <description>Extremes monitor maximum data channel</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
