burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>WCTL15</name>
                    <displayName>WCTL15</displayName>
                    <description>Write control register 15</description>
                    <addressOffset>0x3c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL16</name>
                    <displayName>WCTL16</displayName>
                    <description>Write control register 16</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL17</name>
                    <displayName>WCTL17</displayName>
                    <description>Write control register 17</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL18</name>
                    <displayName>WCTL18</displayName>
                    <description>Write control register 18</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL19</name>
                    <displayName>WCTL19</displayName>
                    <description>Write control register 19</description>
                    <addressOffset>0x4c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL20</name>
                    <displayName>WCTL20</displayName>
                    <description>Write control register 20</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL21</name>
                    <displayName>WCTL21</displayName>
                    <description>Write control register 21</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL22</name>
                    <displayName>WCTL22</displayName>
                    <description>Write control register 22</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL23</name>
                    <displayName>WCTL23</displayName>
                    <description>Write control register 23</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL24</name>
                    <displayName>WCTL24</displayName>
                    <description>Write control register 24</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL25</name>
                    <displayName>WCTL25</displayName>
                    <description>Write control register 25</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL26</name>
                    <displayName>WCTL26</displayName>
                    <description>Write control register 26</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL27</name>
                    <displayName>WCTL27</displayName>
                    <description>Write control register 27</description>
                    <addressOffset>0x6c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL28</name>
                    <displayName>WCTL28</displayName>
                    <description>Write control register 28</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WCTL29</name>
                    <displayName>WCTL29</displayName>
                    <description>Write control register 29</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by writing</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
