burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>RLK13</name>
                    <displayName>RLK13</displayName>
                    <description>Read lock regist 13</description>
                    <addressOffset>0xb4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK14</name>
                    <displayName>RLK14</displayName>
                    <description>Read lock regist 14</description>
                    <addressOffset>0xb8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK15</name>
                    <displayName>RLK15</displayName>
                    <description>Read lock regist 15</description>
                    <addressOffset>0xbc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK16</name>
                    <displayName>RLK16</displayName>
                    <description>Read lock regist 16</description>
                    <addressOffset>0xc0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK17</name>
                    <displayName>RLK17</displayName>
                    <description>Read lock regist 17</description>
                    <addressOffset>0xc4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK18</name>
                    <displayName>RLK18</displayName>
                    <description>Read lock regist 18</description>
                    <addressOffset>0xc8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK19</name>
                    <displayName>RLK19</displayName>
                    <description>Read lock regist 19</description>
                    <addressOffset>0xcc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK20</name>
                    <displayName>RLK20</displayName>
                    <description>Read lock regist 20</description>
                    <addressOffset>0xd0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK21</name>
                    <displayName>RLK21</displayName>
                    <description>Read lock regist 21</description>
                    <addressOffset>0xd4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK22</name>
                    <displayName>RLK22</displayName>
                    <description>Read lock regist 22</description>
                    <addressOffset>0xd8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK23</name>
                    <displayName>RLK23</displayName>
                    <description>Read lock regist 23</description>
                    <addressOffset>0xdc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK24</name>
                    <displayName>RLK24</displayName>
                    <description>Read lock regist 24</description>
                    <addressOffset>0xe0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK25</name>
                    <displayName>RLK25</displayName>
                    <description>Read lock regist 25</description>
                    <addressOffset>0xe4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK26</name>
                    <displayName>RLK26</displayName>
                    <description>Read lock regist 26</description>
                    <addressOffset>0xe8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLK27</name>
                    <displayName>RLK27</displayName>
                    <description>Read lock regist 27</description>
                    <addressOffset>0xec</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>Lock semaphore by reading</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Bus master identification</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Process identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
