burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="I2C0">
            <name>I2C1</name>
            <baseAddress>0x40005800</baseAddress>
            <interrupt>
                <name>I2C1_EV</name>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>I2C1_ER</name>
                <value>34</value>
            </interrupt>
            <interrupt>
                <name>I2C1_WAKE</name>
                <value>202</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="I2C0">
            <name>I2C2</name>
            <baseAddress>0x4000C000</baseAddress>
            <interrupt>
                <name>I2C2_EV</name>
                <value>72</value>
            </interrupt>
            <interrupt>
                <name>I2C2_ER</name>
                <value>73</value>
            </interrupt>
            <interrupt>
                <name>I2C2_WAKE</name>
                <value>203</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="I2C0">
            <name>I2C3</name>
            <baseAddress>0x40005C00</baseAddress>
            <interrupt>
                <name>I2C3_EV</name>
                <value>95</value>
            </interrupt>
            <interrupt>
                <name>I2C3_ER</name>
                <value>96</value>
            </interrupt>
            <interrupt>
                <name>I2C3_WAKE</name>
                <value>204</value>
            </interrupt>
        </peripheral>

        <peripheral>
            <name>IPA</name>
            <description>Image processing accelerator</description>
            <groupName>IPA</groupName>
            <baseAddress>0x52001000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC00</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>IPA</name>
                <value>90</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL</name>
                    <displayName>CTL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TEN</name>
                            <description>Transfer enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THU</name>
                            <description>Transfer hang up</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TST</name>
                            <description>Transfer stop</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAEIE</name>
                            <description>Enable bit for transfer access error interrupt</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTFIE</name>
                            <description>Enable bit for full transfer finish interrupt</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TLMIE</name>
                            <description>Enable bit for transfer line mark interrupt</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LACIE</name>
                            <description>Enable bit for LUT access conflict interrupt</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LLFIE</name>
                            <description>Enable bit for LUT loading finish interrupt</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WCFIE</name>
                            <description>Enable bit for wrong configuration interrupt</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PFCM</name>
                            <description>Pixel format convert mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <displayName>INTF</displayName>
                    <description>
                        Interrupt flag
                        register
                    </description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TAEIF</name>
                            <description>Transfer access error interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTFIF</name>
                            <description>Full transfer finish interrupt flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TLMIF</name>
                            <description>Transfer line mark interrupt flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LACIF</name>
                            <description>LUT access conflict interrupt flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LLFIF</name>
                            <description>LUT loading finish interrupt flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WCFIF</name>
                            <description>Wrong configuration interrupt flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTC</name>
                    <displayName>INTC</displayName>
                    <description>
                        Interrupt flag clear
                        register
                    </description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TAEIFC</name>
                            <description>Clear bit for transfer access error interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFIFC</name>
                            <description>Clear bit for full transfer finish interrupt flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TLMIFC</name>
                            <description>Clear bit for transfer line mark interrupt flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LACIFC</name>
                            <description>Clear bit for LUT access conflict interrupt flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LLFIFC</name>
                            <description>Clear bit for LUT loading finish interrupt flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WCFIFC</name>
                            <description>Clear bit for wrong configuration interrupt flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FMADDR</name>
                    <displayName>FMADDR</displayName>
                    <description>
                        Foreground memory base address
                        register
                    </description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMADDR</name>
                            <description>Foreground memory base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLOFF</name>
                    <displayName>FLOFF</displayName>
                    <description>Foreground line offset register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FLOFF</name>
                            <description>Foreground line offset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BMADDR</name>
                    <displayName>BMADDR</displayName>
                    <description>Background memory base address register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BMADDR</name>
                            <description>Background memory base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BLOFF</name>
                    <displayName>BLOFF</displayName>
                    <description>
                        Background line offset
                        register
                    </description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BLOFF</name>
                            <description>Background line offset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPCTL</name>
                    <displayName>FPCTL</displayName>
                    <description>
                        Foreground pixel control
                        register
                    </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPF</name>
                            <description>Foreground pixel format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FLPF</name>
                            <description>Foreground LUT pixel format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLLEN</name>
                            <description>Foreground LUT loading enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FCNP</name>
                            <description>Foreground LUT number of pixel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>FAVCA</name>
                            <description>Foreground alpha value calculation algorithm</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSSM</name>
                            <description>Chroma Sub-Sampling mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FIIMEN</name>
                            <description>Foreground input interlace mode enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FPDAV</name>
                            <description>Foreground pre- defined alpha value</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPV</name>
                    <displayName>FPV</displayName>
                    <description>Foreground pixel value register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPDBV</name>
                            <description>Foreground pre-defined blue value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>FPDGV</name>
                            <description>Foreground pre-defined green value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>FPDRV</name>
                            <description>Foreground pre-defined red value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPCTL</name>
                    <displayName>BPCTL</displayName>
                    <description>
                        Background pixel control
                        register
                    </description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BPF</name>
                            <description>Background pixel format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BLPF</name>
                            <description>Background LUT pixel format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BLLEN</name>
                            <description>Background LUT loading enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BCNP</name>
                            <description>Background LUT number of pixel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BAVCA</name>
                            <description>Background alpha value calculation algorithm</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BPDAV</name>
                            <description>Background pre- defined alpha value</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPV</name>
                    <displayName>BPV</displayName>
                    <description>
                        Background pixel value
                        register
                    </description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BPDBV</name>
                            <description>Background pre-defined blue value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BPDGV</name>
                            <description>Background pre-defined green value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BPDRV</name>
                            <description>Background pre-defined red value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLMADDR</name>
                    <displayName>FLMADDR</displayName>
                    <description>
                        Foreground LUT memory base address
                        register
                    </description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FLMBADDR</name>
                            <description>Foreground LUT memory base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
