burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>BLMADDR</name>
                    <displayName>BLMADDR</displayName>
                    <description>
                        Background LUT memory base address
                        register
                    </description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BLMADDR</name>
                            <description>Background LUT memory base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPCTL</name>
                    <displayName>DPCTL</displayName>
                    <description>
                        Destination pixel control
                        register
                    </description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPF</name>
                            <description>Destination pixel format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>ROT</name>
                            <description>Indicates the clockwise rotation to be applied at the output</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>HORDEC</name>
                            <description>Horizontal pre decimation filter control</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>VERDEC</name>
                            <description>Verticle pre decimation filter control</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPV_ARGB8888</name>
                    <displayName>DPV_ARGB8888</displayName>
                    <description>
                        Destination pixel value
                        register(When the destination pixel format is ARGB8888)
                    </description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPDBV</name>
                            <description>Destination pre-defined blue value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DPDGV</name>
                            <description>Destination pre-defined green value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DPDRV</name>
                            <description>Destination pre-defined red value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DPDAV</name>
                            <description>Destination pre-defined alpha value</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPV_RGB888</name>
                    <displayName>DPV_RGB888</displayName>
                    <description>
                        Destination pixel value
                        register(When the destination pixel format is RGB888)
                    </description>
                    <alternateRegister>DPV_ARGB8888</alternateRegister>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPDBV</name>
                            <description>Destination pre-defined blue value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DPDGV</name>
                            <description>Destination pre-defined green value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DPDRV</name>
                            <description>Destination pre-defined red value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPV_RGB565</name>
                    <displayName>DPV_RGB565</displayName>
                    <description>
                        Destination pixel value
                        register(When the destination pixel format is RGB565)
                    </description>
                    <alternateRegister>DPV_ARGB8888</alternateRegister>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPDBV</name>
                            <description>Destination pre-defined blue value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DPDGV</name>
                            <description>Destination pre-defined green value</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>DPDRV</name>
                            <description>Destination pre-defined red value</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPV_ARGB1555</name>
                    <displayName>DPV_ARGB1555</displayName>
                    <description>
                        Destination pixel value
                        register(When the destination pixel format is ARGB1555)
                    </description>
                    <alternateRegister>DPV_ARGB8888</alternateRegister>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPDBV</name>
                            <description>Destination pre-defined blue value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DPDGV</name>
                            <description>Destination pre-defined green value</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DPDRV</name>
                            <description>Destination pre-defined red value</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DPDAV</name>
                            <description>Destination pre-defined alpha value</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPV_ARGB4444</name>
                    <displayName>DPV_ARGB4444</displayName>
                    <description>
                        Destination pixel value
                        register(When the destination pixel format is ARGB4444,)
                    </description>
                    <alternateRegister>DPV_ARGB8888</alternateRegister>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPDBV</name>
                            <description>Destination pre-defined blue value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPDGV</name>
                            <description>Destination pre-defined green value</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPDRV</name>
                            <description>Destination pre-defined red value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DPDAV</name>
                            <description>Destination pre-defined alpha value</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMADDR</name>
                    <displayName>DMADDR</displayName>
                    <description>
                        Destination memory base address
                        register
                    </description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMADDR</name>
                            <description>Destination memory base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLOFF</name>
                    <displayName>DLOFF</displayName>
                    <description>
                        Destination line offset
                        register
                    </description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DLOFF</name>
                            <description>Destination line offset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMS</name>
                    <displayName>IMS</displayName>
                    <description>
                        Image size
                        register
                    </description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WIDTH</name>
                            <description>Width of the image to be processed</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                        <field>
                            <name>HEIGHT</name>
                            <description>Height of the image to be processed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LM</name>
                    <displayName>LM</displayName>
                    <description>
                        Line mark
                        register
                    </description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LM</name>
                            <description>line mark</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ITCTL</name>
                    <displayName>ITCTL</displayName>
                    <description>
                        Inter-timer control
                        register
                    </description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ITEN</name>
                            <description>Inter-timer enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NCCI</name>
                            <description>Number of clock cycles interval</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BSCTL</name>
                    <displayName>BSCTL</displayName>
                    <description>Color space conversion coefficient register0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x10001000</resetValue>
                    <fields>
                        <field>
                            <name>YSCALE</name>
                            <description>Y scaling factor for the Foreground</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                        <field>
                            <name>XSCALE</name>
                            <description>X scaling factor for the Foreground</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIMS</name>
                    <displayName>DIMS</displayName>
                    <description>Scaling destination image size register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DWIDTH</name>
                            <description>Width of the image to be processed</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                        <field>
                            <name>DHEIGHT</name>
                            <description>Height of the image to be processed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EF_UV_MADDR</name>
                    <displayName>EF_UV_MADDR</displayName>
                    <description>Foreground even frame or UV memory base address register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EFUVMADDR</name>
                            <description>Foreground Even Frame/UV memory base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCC_CFG0</name>
                    <displayName>CSCC_CFG0</displayName>
                    <description>Color space conversion coefficient register0</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x04000000</resetValue>
                    <fields>
                        <field>
                            <name>CONVMOD</name>
                            <description>Color space convert mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C0</name>
                            <description>Y multiplier coefficient. For YUV</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>UVOFF</name>
                            <description>Phase offset implicited for UV/CbCr data</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>YOFF</name>
                            <description>Amplitude offset implicited for Y data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>CCSC_CFG1</name>
                    <displayName>CCSC_CFG1</displayName>
                    <description>Color space conversion coefficient configure register 1</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x01230208</resetValue>
                    <fields>
                        <field>
                            <name>C4</name>
                            <description>U/Cb Blue multiplier coefficient. For YUV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>C1</name>
                            <description>V/Cr Red multiplier coefficient</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>CCSC_CFG2</name>
                    <displayName>CCSC_CFG2</displayName>
                    <description>Color space conversion coefficient register2</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x076B079C</resetValue>
                    <fields>
                        <field>
                            <name>C3</name>
                            <description>U/Cb Green multiplier coefficient. For YUV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>C2</name>
                            <description>V/Cr Green multiplier coefficient</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
