burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CH6CFG</name>
                    <displayName>CH6CFG</displayName>
                    <description>Channel 6 configure regist</description>
                    <addressOffset>0x1d0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BWMOD</name>
                            <description>Bufferable write mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWREQMOD</name>
                            <description>Software request mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGMOD</name>
                            <description>Trigger mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAMOD</name>
                            <description>Padding and alignement mode</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKEN</name>
                            <description>Pack enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTLEN</name>
                            <description>Buffer transfer length</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBURST</name>
                            <description>Transfer burst type of destination</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBURST</name>
                            <description>Transfer burst type of source</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIOS</name>
                            <description>Offset size of destination increment</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIOS</name>
                            <description>Offset size of source increment</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DWIDTH</name>
                            <description>Data size of destination</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWIDTH</name>
                            <description>Data size of source</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIMOD</name>
                            <description>Destination increment mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIMOD</name>
                            <description>Source increment mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6BTCFG</name>
                    <displayName>CH6BTCFG</displayName>
                    <description>Channel 6 block transfer configure regist</description>
                    <addressOffset>0x1d4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BRNUM</name>
                            <description>Multi-block number</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DADDRUM</name>
                            <description>Multi-block destination address update mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUM</name>
                            <description>Multi-block source address update mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBNUM</name>
                            <description>Transfer byte number in block</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6SADDR</name>
                    <displayName>CH6SADDR</displayName>
                    <description>Channel 6 source address regist</description>
                    <addressOffset>0x1d8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SADDR</name>
                            <description>Source address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6DADDR</name>
                    <displayName>CH6DADDR</displayName>
                    <description>Channel 6 destination address regist</description>
                    <addressOffset>0x1dc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDR</name>
                            <description>Destination address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6MBADDRU</name>
                    <displayName>CH6MBADDRU</displayName>
                    <description>Channel 6 multi-block address update regist</description>
                    <addressOffset>0x1e0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDRUV</name>
                            <description>Destination address update value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUV</name>
                            <description>Source address update value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6LADDR</name>
                    <displayName>CH6LADDR</displayName>
                    <description>Channel 6 link address regist</description>
                    <addressOffset>0x1e4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Link address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6CTL1</name>
                    <displayName>CH6CTL1</displayName>
                    <description>Channel 6 control register</description>
                    <addressOffset>0x1e8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DBSEL</name>
                            <description>Destination bus select</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBSEL</name>
                            <description>Source bus select</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGSEL</name>
                            <description>Trigger select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6MADDR</name>
                    <displayName>CH6MADDR</displayName>
                    <description>Channel 6 mask address regist</description>
                    <addressOffset>0x1f0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MADDR</name>
                            <description>Mask address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6MDATA</name>
                    <displayName>CH6MDATA</displayName>
                    <description>Channel 6 mask data regist</description>
                    <addressOffset>0x1f4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MDATA</name>
                            <description>Mask data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7STAT0</name>
                    <displayName>CH7STAT0</displayName>
                    <description>Channel 7 status register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REQAF</name>
                            <description>Channel x request active flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TCF</name>
                            <description>Channel x buffer transfer complete flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BTCF</name>
                            <description>Channel x block transfer complete flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MBTCF</name>
                            <description>Channel x multi-block transfer complete flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CHTCF</name>
                            <description>Channel x channel transfer complete flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERR</name>
                            <description>Channel x transfer error flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7STATC</name>
                    <displayName>CH7STATC</displayName>
                    <description>Channel 7 status clear regist</description>
                    <addressOffset>0x204</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TCFC</name>
                            <description>Channel x buffer transfer complete flag clear</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTCFC</name>
                            <description>Channel x buffer block transfer complete flag clear</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MBTCFC</name>
                            <description>Channel x buffer multi-block transfer complete flag clear</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHTCFC</name>
                            <description>Channel x channel transfer complete flag clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ERRC</name>
                            <description>Channel x transfer error flag clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7STAT1</name>
                    <displayName>CH7STAT1</displayName>
                    <description>Channel 7 status register</description>
                    <addressOffset>0x208</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BZERR</name>
                            <description>Block size error flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASERR</name>
                            <description>Address and size error flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDTERR</name>
                            <description>Mask data error flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LDTERR</name>
                            <description>Link data transfer error flag in the last transfer of the channel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TERRD</name>
                            <description>Transfer error direction</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRADDR</name>
                            <description>Transfer error address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
