burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CH11BTCFG</name>
                    <displayName>CH11BTCFG</displayName>
                    <description>Channel 11 block transfer configure regist</description>
                    <addressOffset>0x314</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BRNUM</name>
                            <description>Multi-block number</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DADDRUM</name>
                            <description>Multi-block destination address update mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUM</name>
                            <description>Multi-block source address update mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBNUM</name>
                            <description>Transfer byte number in block</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11SADDR</name>
                    <displayName>CH11SADDR</displayName>
                    <description>Channel 11 source address regist</description>
                    <addressOffset>0x318</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SADDR</name>
                            <description>Source address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11DADDR</name>
                    <displayName>CH11DADDR</displayName>
                    <description>Channel 11 destination address regist</description>
                    <addressOffset>0x31c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDR</name>
                            <description>Destination address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11MBADDRU</name>
                    <displayName>CH11MBADDRU</displayName>
                    <description>Channel 11 multi-block address update regist</description>
                    <addressOffset>0x320</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDRUV</name>
                            <description>Destination address update value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUV</name>
                            <description>Source address update value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11LADDR</name>
                    <displayName>CH11LADDR</displayName>
                    <description>Channel 11 link address regist</description>
                    <addressOffset>0x324</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Link address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11CTL1</name>
                    <displayName>CH11CTL1</displayName>
                    <description>Channel 11 control register</description>
                    <addressOffset>0x328</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DBSEL</name>
                            <description>Destination bus select</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBSEL</name>
                            <description>Source bus select</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGSEL</name>
                            <description>Trigger select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11MADDR</name>
                    <displayName>CH11MADDR</displayName>
                    <description>Channel 11 mask address regist</description>
                    <addressOffset>0x330</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MADDR</name>
                            <description>Mask address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH11MDATA</name>
                    <displayName>CH11MDATA</displayName>
                    <description>Channel 11 mask data regist</description>
                    <addressOffset>0x334</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MDATA</name>
                            <description>Mask data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH12STAT0</name>
                    <displayName>CH12STAT0</displayName>
                    <description>Channel 12 status register</description>
                    <addressOffset>0x340</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REQAF</name>
                            <description>Channel x request active flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TCF</name>
                            <description>Channel x buffer transfer complete flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BTCF</name>
                            <description>Channel x block transfer complete flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MBTCF</name>
                            <description>Channel x multi-block transfer complete flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CHTCF</name>
                            <description>Channel x channel transfer complete flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERR</name>
                            <description>Channel x transfer error flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH12STATC</name>
                    <displayName>CH12STATC</displayName>
                    <description>Channel 12 status clear regist</description>
                    <addressOffset>0x344</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TCFC</name>
                            <description>Channel x buffer transfer complete flag clear</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTCFC</name>
                            <description>Channel x buffer block transfer complete flag clear</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MBTCFC</name>
                            <description>Channel x buffer multi-block transfer complete flag clear</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHTCFC</name>
                            <description>Channel x channel transfer complete flag clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ERRC</name>
                            <description>Channel x transfer error flag clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH12STAT1</name>
                    <displayName>CH12STAT1</displayName>
                    <description>Channel 12 status register</description>
                    <addressOffset>0x348</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BZERR</name>
                            <description>Block size error flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASERR</name>
                            <description>Address and size error flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDTERR</name>
                            <description>Mask data error flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LDTERR</name>
                            <description>Link data transfer error flag in the last transfer of the channel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TERRD</name>
                            <description>Transfer error direction</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRADDR</name>
                            <description>Transfer error address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH12CTL0</name>
                    <displayName>CH12CTL0</displayName>
                    <description>Channel 12 control register</description>
                    <addressOffset>0x34c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWREQ</name>
                            <description>Software request</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WES</name>
                            <description>Word endianess swapping in double word</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HWES</name>
                            <description>Half word endianess swapping in word</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BES</name>
                            <description>Byte endianess swapping in half word</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMODEN</name>
                            <description>Secure mode enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRIO</name>
                            <description>Priority level</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCIE</name>
                            <description>Buffer transfer complete interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTCIE</name>
                            <description>Block transfer complete interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBTCIE</name>
                            <description>Multi-block transfer complete interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHTCIE</name>
                            <description>Channel transfer complete interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>Transfer error interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
