burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CH13CTL0</name>
                    <displayName>CH13CTL0</displayName>
                    <description>Channel 13 control register</description>
                    <addressOffset>0x38c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWREQ</name>
                            <description>Software request</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WES</name>
                            <description>Word endianess swapping in double word</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HWES</name>
                            <description>Half word endianess swapping in word</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BES</name>
                            <description>Byte endianess swapping in half word</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMODEN</name>
                            <description>Secure mode enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRIO</name>
                            <description>Priority level</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCIE</name>
                            <description>Buffer transfer complete interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTCIE</name>
                            <description>Block transfer complete interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBTCIE</name>
                            <description>Multi-block transfer complete interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHTCIE</name>
                            <description>Channel transfer complete interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>Transfer error interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13CFG</name>
                    <displayName>CH13CFG</displayName>
                    <description>Channel 13 configure regist</description>
                    <addressOffset>0x390</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BWMOD</name>
                            <description>Bufferable write mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWREQMOD</name>
                            <description>Software request mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGMOD</name>
                            <description>Trigger mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAMOD</name>
                            <description>Padding and alignement mode</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKEN</name>
                            <description>Pack enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTLEN</name>
                            <description>Buffer transfer length</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBURST</name>
                            <description>Transfer burst type of destination</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBURST</name>
                            <description>Transfer burst type of source</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIOS</name>
                            <description>Offset size of destination increment</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIOS</name>
                            <description>Offset size of source increment</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DWIDTH</name>
                            <description>Data size of destination</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWIDTH</name>
                            <description>Data size of source</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIMOD</name>
                            <description>Destination increment mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIMOD</name>
                            <description>Source increment mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13BTCFG</name>
                    <displayName>CH13BTCFG</displayName>
                    <description>Channel 13 block transfer configure regist</description>
                    <addressOffset>0x394</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BRNUM</name>
                            <description>Multi-block number</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DADDRUM</name>
                            <description>Multi-block destination address update mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUM</name>
                            <description>Multi-block source address update mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBNUM</name>
                            <description>Transfer byte number in block</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13SADDR</name>
                    <displayName>CH13SADDR</displayName>
                    <description>Channel 13 source address regist</description>
                    <addressOffset>0x398</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SADDR</name>
                            <description>Source address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13DADDR</name>
                    <displayName>CH13DADDR</displayName>
                    <description>Channel 13 destination address regist</description>
                    <addressOffset>0x39c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDR</name>
                            <description>Destination address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13MBADDRU</name>
                    <displayName>CH13MBADDRU</displayName>
                    <description>Channel 13 multi-block address update regist</description>
                    <addressOffset>0x3a0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDRUV</name>
                            <description>Destination address update value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUV</name>
                            <description>Source address update value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13LADDR</name>
                    <displayName>CH13LADDR</displayName>
                    <description>Channel 13 link address regist</description>
                    <addressOffset>0x3a4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Link address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13CTL1</name>
                    <displayName>CH13CTL1</displayName>
                    <description>Channel 13 control register</description>
                    <addressOffset>0x3a8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DBSEL</name>
                            <description>Destination bus select</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBSEL</name>
                            <description>Source bus select</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGSEL</name>
                            <description>Trigger select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13MADDR</name>
                    <displayName>CH13MADDR</displayName>
                    <description>Channel 13 mask address regist</description>
                    <addressOffset>0x3b0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MADDR</name>
                            <description>Mask address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH13MDATA</name>
                    <displayName>CH13MDATA</displayName>
                    <description>Channel 13 mask data regist</description>
                    <addressOffset>0x3b4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MDATA</name>
                            <description>Mask data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH14STAT0</name>
                    <displayName>CH14STAT0</displayName>
                    <description>Channel 14 status register</description>
                    <addressOffset>0x3c0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REQAF</name>
                            <description>Channel x request active flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TCF</name>
                            <description>Channel x buffer transfer complete flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BTCF</name>
                            <description>Channel x block transfer complete flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MBTCF</name>
                            <description>Channel x multi-block transfer complete flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CHTCF</name>
                            <description>Channel x channel transfer complete flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERR</name>
                            <description>Channel x transfer error flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
