burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CH15CTL1</name>
                    <displayName>CH15CTL1</displayName>
                    <description>Channel 15 control register</description>
                    <addressOffset>0x428</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DBSEL</name>
                            <description>Destination bus select</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBSEL</name>
                            <description>Source bus select</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGSEL</name>
                            <description>Trigger select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH15MADDR</name>
                    <displayName>CH15MADDR</displayName>
                    <description>Channel 15 mask address regist</description>
                    <addressOffset>0x430</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MADDR</name>
                            <description>Mask address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH15MDATA</name>
                    <displayName>CH15MDATA</displayName>
                    <description>Channel 15 mask data regist</description>
                    <addressOffset>0x434</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MDATA</name>
                            <description>Mask data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

        <peripheral>
            <name>MDIO</name>
            <description>Management data input/output</description>
            <baseAddress>0x40009400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>MDIO_GLOBAL</name>
                <value>120</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL</name>
                    <displayName>CTL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PHYB</name>
                            <description>MDIO PHY bit length</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>Software reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFRM</name>
                    <displayName>RFRM</displayName>
                    <description>Received frame information register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTA</name>
                            <description>Received frame field TA</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RDEV</name>
                            <description>Received frame field DEVADD</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>RPHY</name>
                            <description>Received frame field  PHYADR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ROP</name>
                            <description>Received frame field OP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDATA</name>
                    <displayName>RDATA</displayName>
                    <description>Received data register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDATA</name>
                            <description>Received frame field DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RADDR</name>
                    <displayName>RADDR</displayName>
                    <description>Received address register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RADDR</name>
                            <description>Received frame field ADDRESS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDATA</name>
                    <displayName>TDATA</displayName>
                    <description>Transfer data register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>TDATA</name>
                            <description>Transfer data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Configuration register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EDEVADD</name>
                            <description>Expected DEVADD</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EPHYSEL</name>
                            <description>Selects expected PHYADR</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PHYSW</name>
                            <description>Software provided PHYADR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RBNE</name>
                            <description>Read data buffer not empty flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVR</name>
                            <description>Receive overrun flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UDR</name>
                            <description>Transmit underrun flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO</name>
                            <description>Timeout flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TANM</name>
                            <description>Set at end bit of TA of a write data frame or a write address frame</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PHYNM</name>
                            <description>Set at end bit of PHYADR if PHYADR nonmatches</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PHYM</name>
                            <description>Set at end bit of PHYADR if PHYADR matches</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DEVNM</name>
                            <description>Set at end bit of DEVADD if DEVADD nonmatches</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DEVM</name>
                            <description>Set at end bit of DEVADD if DEVADD matches</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDFRM</name>
                            <description>Set at end bit of a read data frame if DEVADD and PHYADR both match</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDINCFRM</name>
                            <description>Set at end bit of a post read increment address frame if DEVADD and PHYADR both match</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDRFRM</name>
                            <description>Set at end bit of a write address frame if DEVADD and PHYADR both match</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WRFRM</name>
                            <description>Set at end bit of a write data frame if DEVADD and PHYADR both match</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>Interrupt enable register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RBNEIE</name>
                            <description>interrupt is requested when RBDE bit in MDIO_STAT register becomes active</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVRIE</name>
                            <description>interrupt is requested when OVR bit in MDIO_STAT register becomes active</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDRIE</name>
                            <description>interrupt is requested when UDR bit in MDIO_STAT register becomes active</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>interrupt is requested when TO bit in MDIO_STAT register becomes active</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TANMIE</name>
                            <description>interrupt is requested when TANM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHYNMIE</name>
                            <description>interrupt is requested when PHYNM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHYMIE</name>
                            <description>interrupt is requested when PHYM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEVNMIE</name>
                            <description>interrupt is requested when DEVNM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEVMIE</name>
                            <description>interrupt is requested when DEVM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDFRMIE</name>
                            <description>interrupt is requested when RDFRM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDINCFRMIE</name>
                            <description>interrupt is requested when RDINCFRM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRFRMIE</name>
                            <description>interrupt is requested when ADDRFRM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WRFRMIE</name>
                            <description>interrupt is requested when WRFRM bit in MDIO_STAT register becomes active</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PIN</name>
                    <displayName>PIN</displayName>
                    <description>pin value register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PHYPIN</name>
                            <description>Pin value read from hardware PRTADR[4:0] pins</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TO</name>
                    <displayName>TO</displayName>
                    <description>Timeout register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TOCNT</name>
                            <description>MDIO time out</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>TOEN</name>
                            <description>Timeout enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
