burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>WPTCFG</name>
                    <displayName>WPTCFG</displayName>
                    <description>Wrap transfer configuration register</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>DADTR</name>
                            <description>Data double transfer rate</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAMOD</name>
                            <description>Data mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALTESZ</name>
                            <description>Alternate bytes size</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABDTR</name>
                            <description>Alternate bytes double transfer rate</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALTEMOD</name>
                            <description>Alternate bytes mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRSZ</name>
                            <description>Address size</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRDTR</name>
                            <description>Address double transfer rate</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRMOD</name>
                            <description>Address mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSSZ</name>
                            <description>Instruction size</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IMOD</name>
                            <description>Instruction mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WPTIMCFG</name>
                    <displayName>WPTIMCFG</displayName>
                    <description>Wrap timing configuration register</description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SSAMPLE</name>
                            <description>shift sample</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEHQC</name>
                            <description>Delay hold 1/4 cycle</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DUMYC</name>
                            <description>Number of dummy cycles</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WPINS</name>
                    <displayName>WPINS</displayName>
                    <description>Wrap instruction register</description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTRUCTION</name>
                            <description>Instruction</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WPALTE</name>
                    <displayName>WPALTE</displayName>
                    <description>Wrap alternate byte register</description>
                    <addressOffset>0x160</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ALTE</name>
                            <description>Alternate bytes</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WTCFG</name>
                    <displayName>WTCFG</displayName>
                    <description>Write transfer configuration register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADTR</name>
                            <description>Data double transfer rate</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAMOD</name>
                            <description>data mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALTESZ</name>
                            <description>Alternate bytes size</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABDTR</name>
                            <description>Alternate bytes double transfer rate</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALTEMOD</name>
                            <description>Alternate bytes mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRSZ</name>
                            <description>Address size</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRDTR</name>
                            <description>Alternate bytes double transfer rate</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRMOD</name>
                            <description>address mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSSZ</name>
                            <description>Instruction size</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IMOD</name>
                            <description>Instruction mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WTIMCFG</name>
                    <displayName>WTIMCFG</displayName>
                    <description>Write timing configuration register</description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>DUMYC</name>
                            <description>Number of dummy cycles</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WINS</name>
                    <displayName>WINS</displayName>
                    <description>Write instruction register</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTRUCTION</name>
                            <description>Instruction</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WALTE</name>
                    <displayName>WALTE</displayName>
                    <description>Write alternate byte register</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ALTE</name>
                            <description>Alternate bytes</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HBLCFG</name>
                    <displayName>HBLCFG</displayName>
                    <description>HyperBus lantency configuration register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RWRTIM</name>
                            <description>Read write recovery time</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACCTM</name>
                            <description>Access time</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WZLAT</name>
                            <description>Write zero latency</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMOD</name>
                            <description>Latency mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
