burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>RAMECCMU0</name>
            <description>RAM ECC monitor unit0</description>
            <groupName>RAMECCMU</groupName>
            <baseAddress>0x52009000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ECC</name>
                <value>145</value>
            </interrupt>
            <registers>
                <register>
                    <name>INT</name>
                    <displayName>INT</displayName>
                    <description>RAMECCMU global interruput register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GEIE</name>
                            <description>Global ECC interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GESERRIE</name>
                            <description>Global ECC single error interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GEDERRIE</name>
                            <description>Global ECC double error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GEDERRBWIE</name>
                            <description>Global ECC double error on byte write interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M0CTL</name>
                    <displayName>M0CTL</displayName>
                    <description>monitor 0 control register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRIE</name>
                            <description>ECC single error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRIE</name>
                            <description>ECC double error interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWIE</name>
                            <description>ECC double error on byte write interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRLATEN</name>
                            <description>ECC error latching enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M0STAT</name>
                    <displayName>M0STAT</displayName>
                    <description>monitor 0 status register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRDCF</name>
                            <description>ECC single error detected and corrected flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRDF</name>
                            <description>ECC double error detected flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWDF</name>
                            <description>ECC double error on byte write detected flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M0FADDR</name>
                    <displayName>M0FADDR</displayName>
                    <description>monitor 0 failing address register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFADDR</name>
                            <description>ECC error failing address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M0FDL</name>
                    <displayName>M0FDL</displayName>
                    <description>monitor 0 failing data low register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDL</name>
                            <description>ECC failing data low bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M0FDH</name>
                    <displayName>M0FDH</displayName>
                    <description>monitor 0 failing data high  register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDH</name>
                            <description>ECC failing data high bitss</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M0FECODE</name>
                    <displayName>M0FECODE</displayName>
                    <description>monitor 0 failing ECC error code register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFECODE</name>
                            <description>ECC failing error code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M1CTL</name>
                    <displayName>M1CTL</displayName>
                    <description>monitor 1 control register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRIE</name>
                            <description>ECC single error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRIE</name>
                            <description>ECC double error interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWIE</name>
                            <description>ECC double error on byte write interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRLATEN</name>
                            <description>ECC error latching enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M1STAT</name>
                    <displayName>M1STAT</displayName>
                    <description>monitor 1 status register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRDCF</name>
                            <description>ECC single error detected and corrected flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRDF</name>
                            <description>ECC double error detected flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWDF</name>
                            <description>ECC double error on byte write detected flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M1FADDR</name>
                    <displayName>M1FADDR</displayName>
                    <description>monitor 1 failing address register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFADDR</name>
                            <description>ECC error failing address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M1FDL</name>
                    <displayName>M1FDL</displayName>
                    <description>monitor 1 failing data low register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDL</name>
                            <description>ECC failing data low bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M1FDH</name>
                    <displayName>M1FDH</displayName>
                    <description>monitor 0 failing data high  register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDH</name>
                            <description>ECC failing data high bitss</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M1FECODE</name>
                    <displayName>M1FECODE</displayName>
                    <description>monitor 1 failing ECC error code register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFECODE</name>
                            <description>ECC failing error code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M2CTL</name>
                    <displayName>M2CTL</displayName>
                    <description>monitor 0 control register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRIE</name>
                            <description>ECC single error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRIE</name>
                            <description>ECC double error interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWIE</name>
                            <description>ECC double error on byte write interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRLATEN</name>
                            <description>ECC error latching enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M2STAT</name>
                    <displayName>M2STAT</displayName>
                    <description>monitor 0 status register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRDCF</name>
                            <description>ECC single error detected and corrected flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRDF</name>
                            <description>ECC double error detected flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWDF</name>
                            <description>ECC double error on byte write detected flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M2FADDR</name>
                    <displayName>M2FADDR</displayName>
                    <description>monitor 0 failing address register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFADDR</name>
                            <description>ECC error failing address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M2FDL</name>
                    <displayName>M2FDL</displayName>
                    <description>monitor 0 failing data low register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDL</name>
                            <description>ECC failing data low bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M2FDH</name>
                    <displayName>M2FDH</displayName>
                    <description>monitor 0 failing data high  register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDH</name>
                            <description>ECC failing data high bitss</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M2FECODE</name>
                    <displayName>M2FECODE</displayName>
                    <description>monitor 0 failing ECC error code register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFECODE</name>
                            <description>ECC failing error code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M3CTL</name>
                    <displayName>M3CTL</displayName>
                    <description>monitor 0 control register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRIE</name>
                            <description>ECC single error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRIE</name>
                            <description>ECC double error interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWIE</name>
                            <description>ECC double error on byte write interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRLATEN</name>
                            <description>ECC error latching enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

