burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>M3STAT</name>
                    <displayName>M3STAT</displayName>
                    <description>monitor 0 status register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRDCF</name>
                            <description>ECC single error detected and corrected flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRDF</name>
                            <description>ECC double error detected flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWDF</name>
                            <description>ECC double error on byte write detected flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M3FADDR</name>
                    <displayName>M3FADDR</displayName>
                    <description>monitor 0 failing address register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFADDR</name>
                            <description>ECC error failing address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M3FDL</name>
                    <displayName>M3FDL</displayName>
                    <description>monitor 0 failing data low register</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDL</name>
                            <description>ECC failing data low bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M3FDH</name>
                    <displayName>M3FDH</displayName>
                    <description>monitor 0 failing data high  register</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDH</name>
                            <description>ECC failing data high bitss</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M3FECODE</name>
                    <displayName>M3FECODE</displayName>
                    <description>monitor 0 failing ECC error code register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFECODE</name>
                            <description>ECC failing error code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M4CTL</name>
                    <displayName>M4CTL</displayName>
                    <description>monitor 0 control register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRIE</name>
                            <description>ECC single error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRIE</name>
                            <description>ECC double error interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWIE</name>
                            <description>ECC double error on byte write interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCERRLATEN</name>
                            <description>ECC error latching enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M4STAT</name>
                    <displayName>M4STAT</displayName>
                    <description>monitor 0 status register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCSERRDCF</name>
                            <description>ECC single error detected and corrected flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRDF</name>
                            <description>ECC double error detected flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECCDERRBWDF</name>
                            <description>ECC double error on byte write detected flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M4FADDR</name>
                    <displayName>M4FADDR</displayName>
                    <description>monitor 0 failing address register</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFADDR</name>
                            <description>ECC error failing address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M4FDL</name>
                    <displayName>M4FDL</displayName>
                    <description>monitor 0 failing data low register</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDL</name>
                            <description>ECC failing data low bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M4FDH</name>
                    <displayName>M4FDH</displayName>
                    <description>monitor 0 failing data high  register</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFDH</name>
                            <description>ECC failing data high bitss</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>M4FECODE</name>
                    <displayName>M4FECODE</displayName>
                    <description>monitor 0 failing ECC error code register</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCFECODE</name>
                            <description>ECC failing error code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
