burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RCU</name>
            <description>Reset and clock unit</description>
            <groupName>RCU</groupName>
            <baseAddress>0x58024400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RCU</name>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL</name>
                    <displayName>CTL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0xC0008040</resetValue>
                    <fields>
                        <field>
                            <name>IRC64MSTB</name>
                            <description>IRC64M Internal 64MHz RC Oscillator stabilization flag</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC64MEN</name>
                            <description>Internal 64MHz RC oscillator enable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2STB</name>
                            <description>PLL2 clock stabilization flag</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL2EN</name>
                            <description>PLL2 enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1STB</name>
                            <description>PLL1 clock stabilization flag</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL1EN</name>
                            <description>PLL1 enable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0STB</name>
                            <description>PLL0 clock stabilization flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL0EN</name>
                            <description>PLL0 enable</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKMEN</name>
                            <description>HXTAL clock monitor enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HXTALBPS</name>
                            <description>High speed crystal oscillator (HXTAL) clock bypass mode enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HXTALSTB</name>
                            <description>High speed crystal oscillator (HXTAL) clock stabilization flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HXTALEN</name>
                            <description>High Speed crystal oscillator (HXTAL) enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRC64MCALIB</name>
                            <description>Internal 64MHz RC Oscillator calibration value</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>9</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC64MADJ</name>
                            <description>Internal 64MHz RC Oscillator clock trim adjust value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL0</name>
                    <displayName>PLL0</displayName>
                    <description>PLL0 register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x01002020</resetValue>
                    <fields>
                        <field>
                            <name>PLLSTBSRC</name>
                            <description>PLLs stabilization signal sources</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLL0R</name>
                            <description>The PLL0R output frequency division factor from PLL0 VCO clock</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0P</name>
                            <description>The PLL0P output frequency division factor from PLL0 VCO clock</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0N</name>
                            <description>The PLL0 VCO clock multiplication factor</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>9</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0PSC</name>
                            <description>The PLL0 VCO source clock prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG0</name>
                    <displayName>CFG0</displayName>
                    <description>Clock configuration register 0</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>I2C0SEL</name>
                            <description>I2C0 clock source selection</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB3PSC</name>
                            <description>APB3 prescaler selection</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB4PSC</name>
                            <description>APB4 prescaler selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCDIV</name>
                            <description>RTC clock divider factor</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB2PSC</name>
                            <description>APB2 prescaler selection</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB1PSC</name>
                            <description>APB1 prescaler selection</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBPSC</name>
                            <description>AHB and AXI prescaler selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCSS</name>
                            <description>System clock switch status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCS</name>
                            <description>System clock switch</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT</name>
                    <displayName>INT</displayName>
                    <description>Clock interrupt register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCKMIC</name>
                            <description>LXTAL clock stuck interrupt clear</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>LCKMIF</name>
                            <description>LXTAL clock stuck interrupt flag</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LPIRC4MSTBIC</name>
                            <description>LPIRC4M stabilization interrupt clear</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>LPIRC4MSTBIE</name>
                            <description>LPIRC4M stabilization interrupt enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPIRC4MSTBIF</name>
                            <description>LPIRC4M Clock Stuck Interrupt Flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKMIC</name>
                            <description>HXTAL clock stuck interrupt clear</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLL2STBIC</name>
                            <description>PLL2 stabilization interrupt clear</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLL1STBIC</name>
                            <description>PLL1 stabilization interrupt clear</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLL0STBIC</name>
                            <description>PLL0 stabilization interrupt clear</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>HXTALSTBIC</name>
                            <description>HXTAL stabilization interrupt clear</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IRC64MSTBIC</name>
                            <description>IRC64M stabilization interrupt clear</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>LXTALSTBIC</name>
                            <description>LXTAL stabilization interrupt clear</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IRC32KSTBIC</name>
                            <description>IRC32K Stabilization interrupt clear</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLL2STBIE</name>
                            <description>PLL2 stabilization interrupt enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1STBIE</name>
                            <description>PLL1 Stabilization interrupt enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0STBIE</name>
                            <description>PLL0 Stabilization interrupt enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HXTALSTBIE</name>
                            <description>HXTAL Stabilization interrupt enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRC64MSTBIE</name>
                            <description>IRC64M Stabilization interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LXTALSTBIE</name>
                            <description>LXTAL Stabilization interrupt enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRC32KSTBIE</name>
                            <description>IRC32K Stabilization interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKMIF</name>
                            <description>HXTAL Clock Stuck Interrupt Flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL2STBIF</name>
                            <description>PLL2 stabilization interrupt flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL1STBIF</name>
                            <description>PLL1 stabilization interrupt flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL0STBIF</name>
                            <description>PLL0 stabilization interrupt flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HXTALSTBIF</name>
                            <description>HXTAL stabilization interrupt flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC64MSTBIF</name>
                            <description>IRC64M stabilization interrupt flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LXTALSTBIF</name>
                            <description>LXTAL stabilization interrupt flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC32KSTBIF</name>
                            <description>IRC32K stabilization interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
