burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>AHB1SPEN</name>
                    <displayName>AHB1SPEN</displayName>
                    <description>AHB1 sleep mode enable register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x7EE3C00F</resetValue>
                    <fields>
                        <field>
                            <name>USBHS1ULPISPEN</name>
                            <description>USBHS1 ULPI clock enable when sleep mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1SPEN</name>
                            <description>USBHS1 clock enable when sleep mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET0PTPSPEN</name>
                            <description>Ethernet0 PTP clock enable when sleep mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET0RXSPEN</name>
                            <description>Ethernet0 RX clock enable when sleep mode</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET0TXSPEN</name>
                            <description>Ethernet0 TX clock enable when sleep mode</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET0SPEN</name>
                            <description>Ethernet0 clock enable when sleep mode</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAMUXSPEN</name>
                            <description>DMAMUX clock enable when sleep mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA1SPEN</name>
                            <description>DMA1 clock enable when sleep mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA0SPEN</name>
                            <description>DMA0 clock enable when sleep mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1SPEN</name>
                            <description>SRAM1 clock enable when sleep mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM0SPEN</name>
                            <description>SRAM0 clock enable when sleep mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0ULPISPEN</name>
                            <description>USBHS0 ULPI clock enable when sleep mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0SPEN</name>
                            <description>USBHS0 clock enable when sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET1PTPSPEN</name>
                            <description>Ethernet1 PTP clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET1RXSPEN</name>
                            <description>Ethernet1 RX clock enable when sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET1TXSPEN</name>
                            <description>Ethernet1 TX clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET1SPEN</name>
                            <description>Ethernet1 clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB2SPEN</name>
                    <displayName>AHB2SPEN</displayName>
                    <description>AHB2 sleep mode enable register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000001DF</resetValue>
                    <fields>
                        <field>
                            <name>RAMECCMU1SPEN</name>
                            <description>RAMECCMU1 clock enable when sleep mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMUSPEN</name>
                            <description>TMU clock enable when sleep mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRNGSPEN</name>
                            <description>TRNG clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HAUSPEN</name>
                            <description>HAU enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAUSPEN</name>
                            <description>CAU clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIO1SPEN</name>
                            <description>SDIO1 clock enable when sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FACSPEN</name>
                            <description>FAC clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCISPEN</name>
                            <description>DCI clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB3SPEN</name>
                    <displayName>AHB3SPEN</displayName>
                    <description>AHB3 sleep mode enable register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000C77F</resetValue>
                    <fields>
                        <field>
                            <name>FMCSPEN</name>
                            <description>FMC clock enable when sleep mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AXISRAMSPEN</name>
                            <description>AXI SRAM clock enable when sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMECCMU0SPEN</name>
                            <description>RAMECCMU0 clock enable when sleep mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTDEC1SPEN</name>
                            <description>RTDEC1 clock enable when sleep mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTDEC0SPEN</name>
                            <description>RTDEC0 clock enable when sleep mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPI1SPEN</name>
                            <description>OSPI1 clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPI0SPEN</name>
                            <description>OSPI0 clock enable when sleep mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPIMSPEN</name>
                            <description>OSPIM clock enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDMASPEN</name>
                            <description>MDMA clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIO0SPEN</name>
                            <description>SDIO0 clock enable when sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IPASPEN</name>
                            <description>IPA clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXMCSPEN</name>
                            <description>EXMC clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB4SPEN</name>
                    <displayName>AHB4SPEN</displayName>
                    <description>AHB4 sleep mode enable register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000063FF</resetValue>
                    <fields>
                        <field>
                            <name>CRCSPEN</name>
                            <description>CRC clock enable when sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKPSRAMSPEN</name>
                            <description>Backup SRAM clock enable when sleep mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKSPEN</name>
                            <description>GPIO port K clock enable when sleep mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PJSPEN</name>
                            <description>GPIO port J clock enable when sleep mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHSPEN</name>
                            <description>GPIO port H clock enable when sleep mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGSPEN</name>
                            <description>GPIO port G clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PFSPEN</name>
                            <description>GPIO port F clock enable when sleep mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PESPEN</name>
                            <description>GPIO port E clock enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDSPEN</name>
                            <description>GPIO port D clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCSPEN</name>
                            <description>GPIO port C clock enable when sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBSPEN</name>
                            <description>GPIO port B clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PASPEN</name>
                            <description>GPIO port A clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
