burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>APB1SPEN</name>
                    <displayName>APB1SPEN</displayName>
                    <description>APB1 sleep mode enable register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0xF9FFEFFF</resetValue>
                    <fields>
                        <field>
                            <name>UART7SPEN</name>
                            <description>UART7 clock enable when sleep mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART6SPEN</name>
                            <description>UART6 clock enable when sleep mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DACSPEN</name>
                            <description>DAC clock enable when sleep mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DACHOLDSPEN</name>
                            <description>DAC hold clock enable when sleep mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTCSPEN</name>
                            <description>CTC clock enable when sleep mode</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C3SPEN</name>
                            <description>I2C3 clock enable when sleep mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C2SPEN</name>
                            <description>I2C2 clock enable when sleep mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1SPEN</name>
                            <description>I2C1 clock enable when sleep mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C0SPEN</name>
                            <description>I2C0 clock enable when sleep mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART4SPEN</name>
                            <description>UART4 clock enable when sleep mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART3SPEN</name>
                            <description>UART3 clock enable when sleep mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART2SPEN</name>
                            <description>USART2 clock enable when sleep mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1SPEN</name>
                            <description>USART1 clock enable when sleep mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDIOSPEN</name>
                            <description>MDIO clock enable when sleep mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI2SPEN</name>
                            <description>SPI2 clock enable when sleep mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI1SPEN</name>
                            <description>SPI1 clock enable when sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSPDIFSPEN</name>
                            <description>RSPDIF clock enable when sleep mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER51SPEN</name>
                            <description>TIMER51 clock enable when sleep mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER50SPEN</name>
                            <description>TIMER50 clock enable when sleep mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER31SPEN</name>
                            <description>TIMER31 clock enable when sleep mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER30SPEN</name>
                            <description>TIMER30 clock enable when sleep mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23SPEN</name>
                            <description>TIMER23 clock enable when sleep mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22SPEN</name>
                            <description>TIMER22 clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER6SPEN</name>
                            <description>TIMER6 clock enable when sleep mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER5SPEN</name>
                            <description>TIMER5 clock enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4SPEN</name>
                            <description>TIMER4 clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3SPEN</name>
                            <description>TIMER3 clock enable when sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2SPEN</name>
                            <description>TIMER2 clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1SPEN</name>
                            <description>TIMER1 clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB2SPEN</name>
                    <displayName>APB2SPEN</displayName>
                    <description>APB2 sleep mode enable register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0xFFFF3733</resetValue>
                    <fields>
                        <field>
                            <name>TRIGSELSPEN</name>
                            <description>TRIGSEL clock enable when sleep mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDOUTSPEN</name>
                            <description>EDOUT clock enable when sleep mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER44SPEN</name>
                            <description>TIMER44 clock enable when sleep mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER43SPEN</name>
                            <description>TIMER43 clock enable when sleep mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER42SPEN</name>
                            <description>TIMER42 clock enable when sleep mode</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER41SPEN</name>
                            <description>TIMER41 clock enable when sleep mode</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER40SPEN</name>
                            <description>TIMER40 clock enable when sleep mode</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAI2SPEN</name>
                            <description>SAI2 clock enable when sleep mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAI1SPEN</name>
                            <description>SAI1 clock enable when sleep mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAI0SPEN</name>
                            <description>SAI0 clock enable when sleep mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI5SPEN</name>
                            <description>SPI5 clock enable when sleep mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI4SPEN</name>
                            <description>SPI4 clock enable when sleep mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPDFSPEN</name>
                            <description>HPDF clock enable when sleep mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER16SPEN</name>
                            <description>TIMER16 clock enable when sleep mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER15SPEN</name>
                            <description>TIMER15 clock enable when sleep mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER14SPEN</name>
                            <description>TIMER14 clock enable when sleep mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI3SPEN</name>
                            <description>SPI3 clock enable when sleep mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI0SPEN</name>
                            <description>SPI0 clock enable when sleep mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC2SPEN</name>
                            <description>ADC2 clock enable when sleep mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC1SPEN</name>
                            <description>ADC1 clock enable when sleep mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC0SPEN</name>
                            <description>ADC0 clock enable when sleep mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART5SPEN</name>
                            <description>USART5 clock enable when sleep mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART0SPEN</name>
                            <description>USART0 clock enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER7SPEN</name>
                            <description>TIMER7 clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER0SPEN</name>
                            <description>TIMER0 clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB3SPEN</name>
                    <displayName>APB3SPEN</displayName>
                    <description>APB3 sleep mode enable register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <field>
                            <name>WWDGTSPEN</name>
                            <description>WWDGT clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TLISPEN</name>
                            <description>TLI clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
