burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CFG2</name>
                    <displayName>CFG2</displayName>
                    <description>Clock configuration register 2</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SAI2B1SEL</name>
                            <description>SAI2 Block 1 clock selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAI2B0SEL</name>
                            <description>SAI2 Block 0 clock selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAI1SEL</name>
                            <description>SAI1 clock selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAI0SEL</name>
                            <description>SA0 and HPDF audio clock selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT1SEL</name>
                            <description>CKOUT1 clock source selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT1DIV</name>
                            <description>The CK_OUT1 divider which the CK_OUT1 frequency can be reduced</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT0SEL</name>
                            <description>CKOUT0 clock source selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT0DIV</name>
                            <description>The CK_OUT0 divider which the CK_OUT0 frequency can be reduced</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG3</name>
                    <displayName>CFG3</displayName>
                    <description>Clock configuration register 3</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADC2SEL</name>
                            <description>ADC2 clock source selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC01SEL</name>
                            <description>ADC0 and ADC1 clock source selection</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSPWUSSEL</name>
                            <description>Deep-sleep wakeup system clock source selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIO1SEL</name>
                            <description>SDIO1 clock source selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C3SEL</name>
                            <description>I2C3 clock source selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C2SEL</name>
                            <description>I2C2 clock source selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1SEL</name>
                            <description>I2C1 clock source selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLALL</name>
                    <displayName>PLLALL</displayName>
                    <description>PLL configuration register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLLSEL</name>
                            <description>PLLs clock source selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2VCOSEL</name>
                            <description>PLL2 VCO selection</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2RNG</name>
                            <description>PLL2 input clock range</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1VCOSEL</name>
                            <description>PLL1 VCO selection</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1RNG</name>
                            <description>PLL1 input clock range</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0VCOSEL</name>
                            <description>PLL0 VCO selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0RNG</name>
                            <description>PLL0 input clock range</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL0FRA</name>
                    <displayName>PLL0FRA</displayName>
                    <description>PLL0 fraction configuration register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLL0FRAEN</name>
                            <description>PLL0 fractional latch enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0FRAN</name>
                            <description>Fractional part of the multiplication factor for PLL0 VCO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL1FRA</name>
                    <displayName>PLL1FRA</displayName>
                    <description>PLL1 fraction configuration register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLL1FRAEN</name>
                            <description>PLL1 fractional latch enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1FRAN</name>
                            <description>Fractional part of the multiplication factor for PLL1 VCO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL2FRA</name>
                    <displayName>PLL2FRA</displayName>
                    <description>PLL2 fraction configuration register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLL2FRAEN</name>
                            <description>PLL2 fractional latch enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2FRAN</name>
                            <description>Fractional part of the multiplication factor for PLL2 VCO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDCTL0</name>
                    <displayName>ADDCTL0</displayName>
                    <description>Additional clock control register 0</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x80000000</resetValue>
                    <fields>
                        <field>
                            <name>IRC48MCALIB</name>
                            <description>Internal 48MHz RC oscillator calibration value register</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC48MSTB</name>
                            <description>Internal 48MHz RC oscillator clock stabilization Flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC48MEN</name>
                            <description>Internal 48MHz RC oscillator enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL48MSEL</name>
                            <description>PLL48M clock selection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CK48MSEL</name>
                            <description>48MHz clock selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDCTL1</name>
                    <displayName>ADDCTL1</displayName>
                    <description>Additional clock control register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00007080</resetValue>
                    <fields>
                        <field>
                            <name>PLLUSBHS1STB</name>
                            <description>PLLUSBHS1 clock stabilization flag</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1EN</name>
                            <description>PLLUSBHS1 clock enable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STB</name>
                            <description>PLLUSBHS0 clock stabilization flag</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0EN</name>
                            <description>PLLUSBHS0 clock enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPIRC4MDSPEN</name>
                            <description>LPIRC4M clock enable in deepsleep mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRC64MDIV</name>
                            <description>IRC64M clock divider</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPIRC4MCALIB</name>
                            <description>LPIRC4M calibration value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LPIRC4MADJ</name>
                            <description>LPIRC4M frequency clock trim adjust value</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPIRC4MSTB</name>
                            <description>LPIRC4M clock stabilization flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LPIRC4MEN</name>
                            <description>LPIRC4M clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDINT</name>
                    <displayName>ADDINT</displayName>
                    <description>Additional clock interrupt register</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IRC48MSTBIC</name>
                            <description>Internal 48 MHz RC oscillator Stabilization interrupt clear</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1STBIC</name>
                            <description>Internal PLL of USBHS1 Stabilization interrupt clear</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STBIC</name>
                            <description>Internal PLL of USBHS0 Stabilization interrupt clear</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IRC48MSTBIE</name>
                            <description>Internal 48 MHz RC oscillator Stabilization interrupt enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1STBIE</name>
                            <description>Internal PLL of USBHS1 Stabilization interrupt enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STBIE</name>
                            <description>Internal PLL of USBHS0 Stabilization interrupt enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRC48MSTBIF</name>
                            <description>IRC48M stabilization interrupt flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1STBIF</name>
                            <description>Internal PLL of USBHS1 stabilization interrupt flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STBIF</name>
                            <description>Internal PLL of USBHS0 stabilization interrupt flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
