burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CFG4</name>
                    <displayName>CFG4</displayName>
                    <description>Clock configuration register 4</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EXMCSEL</name>
                            <description>EXMC clock source selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIO0SEL</name>
                            <description>SDIO0 clock source selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBCLKCTL</name>
                    <displayName>USBCLKCTL</displayName>
                    <description>USB clock control register</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>USBHS1PSC</name>
                            <description>USBHS1 clock prescaler selection</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0PSC</name>
                            <description>USBHS0 clock prescaler selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS148MSEL</name>
                            <description>USBHS1 48M clock source selection</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1SWEN</name>
                            <description>USBHS1 clock source selection enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1PRESEL</name>
                            <description>PLLUSBHS1 clock source preselection</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1SEL</name>
                            <description>USBHS1 clock source selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS048MSEL</name>
                            <description>USBHS0 48M clock source selection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0SWEN</name>
                            <description>USBHS0 clock source selection enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0PRESEL</name>
                            <description>PLLUSBHS0 clock source preselection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0SEL</name>
                            <description>USBHS0 clock source selection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLUSBCFG</name>
                    <displayName>PLLUSBCFG</displayName>
                    <description>PLLUSB configuration register</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLLUSBHS1MF</name>
                            <description>The PLLUSBHS1 clock multiplication factor</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1DV</name>
                            <description>USBHS1 clock divider factor</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1PREDV</name>
                            <description>PLLUSBHS1PREDV clock divide factor</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0MF</name>
                            <description>The PLLUSBHS0 clock multiplication factor</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0DV</name>
                            <description>USBHS0 clock divider factor</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0PREDV</name>
                            <description>PLLUSBHS0PREDV clock divide factor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDAPB2RST</name>
                    <displayName>ADDAPB2RST</displayName>
                    <description>APB2 additional reset register</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CAN2RST</name>
                            <description>CAN2 reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN1RST</name>
                            <description>CAN1 reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN0RST</name>
                            <description>CAN0 reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDAPB2EN</name>
                    <displayName>ADDAPB2EN</displayName>
                    <description>APB2 additional enable register</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CAN2EN</name>
                            <description>CAN2 clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN1EN</name>
                            <description>CAN1 clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN0EN</name>
                            <description>CAN0 clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDAPB2SPEN</name>
                    <displayName>ADDAPB2SPEN</displayName>
                    <description>APB2 additional sleep enable register</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000007</resetValue>
                    <fields>
                        <field>
                            <name>CAN2SPEN</name>
                            <description>CAN2 clock enable in sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN1SPEN</name>
                            <description>CAN1 clock enable in sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN0SPEN</name>
                            <description>CAN0 clock enable in sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG5</name>
                    <displayName>CFG5</displayName>
                    <description>Clock configuration register 5</description>
                    <addressOffset>0XF0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI5SEL</name>
                            <description>SPI5 / I2S5 clock selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI4SEL</name>
                            <description>SPI4 clock selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI3SEL</name>
                            <description>SPI3 clock selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI2SEL</name>
                            <description>SPI2 / I2S2 clock selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI1SEL</name>
                            <description>SPI1 / I2S1 clock selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI0SEL</name>
                            <description>SPI0 / I2S0 clock selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
