burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>DTH</name>
                    <displayName>DTH</displayName>
                    <description>RX data threshold register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>THLO</name>
                            <description>Low threshold</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>THHI</name>
                            <description>High threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>RTDEC0</name>
            <description>Real-time decryption</description>
            <groupName>RTDEC</groupName>
            <baseAddress>0x5200B800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTDEC0_GLOBAL</name>
                <value>151</value>
            </interrupt>
            <registers>
                <register>
                    <name>ARE0_CFG</name>
                    <displayName>ARE0_CFG</displayName>
                    <description>Area 0 configuration regist</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_FMVER</name>
                            <description>Area firmware version bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_CRC</name>
                            <description>8-bit CRC of area key bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>RTDEC mode bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_LK</name>
                            <description>Area key lock bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_CFG_LK</name>
                            <description>Area configure lock bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_EN</name>
                            <description>Area real-time decryption enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_CFG</name>
                    <displayName>ARE1_CFG</displayName>
                    <description>Area 1 configuration regist</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_FMVER</name>
                            <description>Area firmware version bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_CRC</name>
                            <description>8-bit CRC of area key bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>RTDEC mode bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_LK</name>
                            <description>Area key lock bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_CFG_LK</name>
                            <description>Area configure lock bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_EN</name>
                            <description>Area real-time decryption enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_CFG</name>
                    <displayName>ARE2_CFG</displayName>
                    <description>Area 2 configuration regist</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_FMVER</name>
                            <description>Area firmware version bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_CRC</name>
                            <description>8-bit CRC of area key bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>RTDEC mode bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_LK</name>
                            <description>Area key lock bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_CFG_LK</name>
                            <description>Area configure lock bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_EN</name>
                            <description>Area real-time decryption enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_CFG</name>
                    <displayName>ARE3_CFG</displayName>
                    <description>Area 3 configuration regist</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_FMVER</name>
                            <description>Area firmware version bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_CRC</name>
                            <description>8-bit CRC of area key bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>RTDEC mode bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARE_K_LK</name>
                            <description>Area key lock bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_CFG_LK</name>
                            <description>Area configure lock bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARE_EN</name>
                            <description>Area real-time decryption enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_SADDR</name>
                    <displayName>ARE0_SADDR</displayName>
                    <description>Area 0 start address regist</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_SADDR</name>
                            <description>Area x start address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_SADDR</name>
                    <displayName>ARE1_SADDR</displayName>
                    <description>Area 1 start address regist</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_SADDR</name>
                            <description>Area x start address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_SADDR</name>
                    <displayName>ARE2_SADDR</displayName>
                    <description>Area 2 start address regist</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_SADDR</name>
                            <description>Area x start address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_SADDR</name>
                    <displayName>ARE3_SADDR</displayName>
                    <description>Area 3 start address regist</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_SADDR</name>
                            <description>Area x start address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_EADDR</name>
                    <displayName>ARE0_EADDR</displayName>
                    <description>Area 0 end address regist</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ARE_EADDR</name>
                            <description>Area x end address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_EADDR</name>
                    <displayName>ARE1_EADDR</displayName>
                    <description>Area 1 end address regist</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ARE_EADDR</name>
                            <description>Area x end address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_EADDR</name>
                    <displayName>ARE2_EADDR</displayName>
                    <description>Area 2 end address regist</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ARE_EADDR</name>
                            <description>Area x end address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_EADDR</name>
                    <displayName>ARE3_EADDR</displayName>
                    <description>Area 3 end address regist</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ARE_EADDR</name>
                            <description>Area x end address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_NONCE0</name>
                    <displayName>ARE0_NONCE0</displayName>
                    <description>Area 0 nonce 0 register 0</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE0</name>
                            <description>Area 0 nonce address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_NONCE0</name>
                    <displayName>ARE1_NONCE0</displayName>
                    <description>Area 1 nonce register 0</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE0</name>
                            <description>Area 1 nonce 0 address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_NONCE0</name>
                    <displayName>ARE2_NONCE0</displayName>
                    <description>Area 2 nonce register 0</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE0</name>
                            <description>Area 2 nonce 0 address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_NONCE0</name>
                    <displayName>ARE3_NONCE0</displayName>
                    <description>Area 3 nonce register 0</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE0</name>
                            <description>Area 3 nonce 0 address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_NONCE1</name>
                    <displayName>ARE0_NONCE1</displayName>
                    <description>Area 0 nonce register 1</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE1</name>
                            <description>Area 0 nonce 1 address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_NONCE1</name>
                    <displayName>ARE1_NONCE1</displayName>
                    <description>Area 1 nonce register 1</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE1</name>
                            <description>Area 1 nonce 1 address bits, ARE_RANDNUM[63:32]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
