burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>ARE2_NONCE1</name>
                    <displayName>ARE2_NONCE1</displayName>
                    <description>Area 2 nonce register 1</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE1</name>
                            <description>Area 2 nonce 1 address bits, ARE_RANDNUM[63:32]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_NONCE1</name>
                    <displayName>ARE3_NONCE1</displayName>
                    <description>Area 3 nonce register</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_NONCE1</name>
                            <description>Area 3 nonce 1 address bits, ARE_RANDNUM[63:32]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_KEY0</name>
                    <displayName>ARE0_KEY0</displayName>
                    <description>Area 0 key register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY0</name>
                            <description>Area x key bits, ARE_KEY[31:0]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_KEY0</name>
                    <displayName>ARE1_KEY0</displayName>
                    <description>Area 1 key register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY0</name>
                            <description>Area x key bits, ARE_KEY[31:0]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_KEY0</name>
                    <displayName>ARE2_KEY0</displayName>
                    <description>Area 2 key register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY0</name>
                            <description>Area x key bits, ARE_KEY[31:0]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_KEY0</name>
                    <displayName>ARE3_KEY0</displayName>
                    <description>Area 3 key register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY0</name>
                            <description>Area x key bits, ARE_KEY[31:0]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_KEY1</name>
                    <displayName>ARE0_KEY1</displayName>
                    <description>Area 0 key register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY1</name>
                            <description>Area x key bits, ARE_KEY[63:32]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_KEY1</name>
                    <displayName>ARE1_KEY1</displayName>
                    <description>Area 1 key register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY1</name>
                            <description>Area x key bits, ARE_KEY[63:32]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_KEY1</name>
                    <displayName>ARE2_KEY1</displayName>
                    <description>Area 2 key register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY1</name>
                            <description>Area x key bits, ARE_KEY[63:32]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_KEY1</name>
                    <displayName>ARE3_KEY1</displayName>
                    <description>Area 3 key register</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY1</name>
                            <description>Area x key bits, ARE_KEY[63:32]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_KEY2</name>
                    <displayName>ARE0_KEY2</displayName>
                    <description>Area 0 key register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY2</name>
                            <description>Area x key bits, ARE_KEY[95:64]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_KEY2</name>
                    <displayName>ARE1_KEY2</displayName>
                    <description>Area 1 key register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY2</name>
                            <description>Area x key bits, ARE_KEY[95:64]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_KEY2</name>
                    <displayName>ARE2_KEY2</displayName>
                    <description>Area 2 key register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY2</name>
                            <description>Area x key bits, ARE_KEY[95:64]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_KEY2</name>
                    <displayName>ARE3_KEY2</displayName>
                    <description>Area 3 key register</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY2</name>
                            <description>Area x key bits, ARE_KEY[95:64]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE0_KEY3</name>
                    <displayName>ARE0_KEY3</displayName>
                    <description>Area 0 key register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY3</name>
                            <description>Area x key bits, ARE_KEY[127:96]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE1_KEY3</name>
                    <displayName>ARE1_KEY3</displayName>
                    <description>Area 1 key register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY3</name>
                            <description>Area x key bits, ARE_KEY[127:96]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE2_KEY3</name>
                    <displayName>ARE2_KEY3</displayName>
                    <description>Area 2 key register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY3</name>
                            <description>Area x key bits, ARE_KEY[127:96]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARE3_KEY3</name>
                    <displayName>ARE3_KEY3</displayName>
                    <description>Area 3 key register</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARE_KEY3</name>
                            <description>Area x key bits, ARE_KEY[127:96]</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <displayName>INTF</displayName>
                    <description>Interrupt flag register</description>
                    <addressOffset>0x300</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEF</name>
                            <description>Key error interrupt flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ECONEF</name>
                            <description>Execute-only or execute-never error interrupt flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SECEF</name>
                            <description>Security error interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTC</name>
                    <displayName>INTC</displayName>
                    <description>Interrupt flag clear register</description>
                    <addressOffset>0x304</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEC</name>
                            <description>Key error flag clear</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ECONEC</name>
                            <description>Execute-only or execute-never error flag clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SECEC</name>
                            <description>Security error interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>Interrupt enable register</description>
                    <addressOffset>0x308</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEIE</name>
                            <description>Enable bit for key error interrupt</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECONEIE</name>
                            <description>Enable bit for execute-only or execute-never error interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SECEIE</name>
                            <description>Enable bit for security error interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
