burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>TAMP</name>
                    <displayName>TAMP</displayName>
                    <description>
                        tamper and alternate function configuration
                        register
                    </description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIOC15MODE</name>
                            <description>GPIOC15 work mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIOC15VALUE</name>
                            <description>GPIOC15 value</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIOC14MODE</name>
                            <description>GPIOC14 work mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIOC14VALUE</name>
                            <description>GPIOC14 value</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIOC13MODE</name>
                            <description>GPIOC13 work mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GPIOC13VALUE</name>
                            <description>GPIOC13 value</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISPU</name>
                            <description>RTC_TAMPx pull-up disable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRCH</name>
                            <description>Pre-charge duration time of RTC_TAMPx</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FLT</name>
                            <description>RTC_TAMPx filter count setting</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FREQ</name>
                            <description>Sampling frequency of tamper event detection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TPTS</name>
                            <description>Make tamper function used for timestamp function</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1EG</name>
                            <description>Tamper 1 event trigger edge</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1EN</name>
                            <description>Tamper 1 detection enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPIE</name>
                            <description>Tamper detection interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP0EG</name>
                            <description>Tamper 0 event trigger edge</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP0EN</name>
                            <description>Tamper 0 detection enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRM0SS</name>
                    <displayName>ALRM0SS</displayName>
                    <description>alarm 0 sub second register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSKSSC</name>
                            <description>Mask control bit of SSC</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SSC</name>
                            <description>Alarm sub second value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRM1SS</name>
                    <displayName>ALRM1SS</displayName>
                    <description>alarm 1 sub second register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MSKSSC</name>
                            <description>Mask control bit of SSC</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SSC</name>
                            <description>Alarm sub second value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Configuration register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT2EN</name>
                            <description>RTC_OUT pin select</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRMOUTTYPE</name>
                            <description>RTC_ALARM Output Type</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP0</name>
                    <displayName>BKP0</displayName>
                    <description>backup register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP1</name>
                    <displayName>BKP1</displayName>
                    <description>backup register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP2</name>
                    <displayName>BKP2</displayName>
                    <description>backup register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP3</name>
                    <displayName>BKP3</displayName>
                    <description>backup register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP4</name>
                    <displayName>BKP4</displayName>
                    <description>backup register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>BKP5</name>
                    <displayName>BKP5</displayName>
                    <description>backup register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP6</name>
                    <displayName>BKP6</displayName>
                    <description>backup register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP7</name>
                    <displayName>BKP7</displayName>
                    <description>backup register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP8</name>
                    <displayName>BKP8</displayName>
                    <description>backup register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP9</name>
                    <displayName>BKP9</displayName>
                    <description>backup register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>BKP data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>BKP10</name>
                    <displayName>BKP10</displayName>
                    <description>Backup registe 10</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP11</name>
                    <displayName>BKP11</displayName>
                    <description>Backup registe 11</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP12</name>
                    <displayName>BKP12</displayName>
                    <description>Backup registe 12</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP13</name>
                    <displayName>BKP13</displayName>
                    <description>Backup registe 13</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP14</name>
                    <displayName>BKP14</displayName>
                    <description>Backup registe 14</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP15</name>
                    <displayName>BKP15</displayName>
                    <description>Backup registe 15</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP16</name>
                    <displayName>BKP16</displayName>
                    <description>Backup registe 16</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP17</name>
                    <displayName>BKP17</displayName>
                    <description>Backup registe 17</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP18</name>
                    <displayName>BKP18</displayName>
                    <description>Backup registe 18</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP19</name>
                    <displayName>BKP19</displayName>
                    <description>Backup registe 19</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
