burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>BKP20</name>
                    <displayName>BKP20</displayName>
                    <description>Backup registe 20</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP21</name>
                    <displayName>BKP21</displayName>
                    <description>Backup registe 21</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP22</name>
                    <displayName>BKP22</displayName>
                    <description>Backup registe 22</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP23</name>
                    <displayName>BKP23</displayName>
                    <description>Backup registe 23</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP24</name>
                    <displayName>BKP24</displayName>
                    <description>Backup registe 24</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP25</name>
                    <displayName>BKP25</displayName>
                    <description>Backup registe 25</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP26</name>
                    <displayName>BKP26</displayName>
                    <description>Backup registe 26</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP27</name>
                    <displayName>BKP27</displayName>
                    <description>Backup registe 27</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP28</name>
                    <displayName>BKP28</displayName>
                    <description>Backup registe 28</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP29</name>
                    <displayName>BKP29</displayName>
                    <description>Backup registe 29</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP30</name>
                    <displayName>BKP30</displayName>
                    <description>Backup registe 30</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP31</name>
                    <displayName>BKP31</displayName>
                    <description>Backup registe 31</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>0x20</size>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
