burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>PDMCTL</name>
                    <displayName>PDMCTL</displayName>
                    <description>PDM control register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKL1EN</name>
                            <description>PDM clock line 1 enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKL0EN</name>
                            <description>PDM clock line 0 enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MICNUMSEL</name>
                            <description>Select microphones number</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDMEN</name>
                            <description>PDM enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDMCFG</name>
                    <displayName>PDMCFG</displayName>
                    <description>PDM configuration register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPR2</name>
                            <description>The 2nd group of right channel microphone data flow delay period</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPL2</name>
                            <description>The 2nd group of left channel microphone data flow delay period</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPR1</name>
                            <description>The 1st group of right channel microphone data flow delay period</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPL1</name>
                            <description>The 1st group of left channel microphone data flow delay period</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPR0</name>
                            <description>The 0 group of right channel microphone data flow delay period</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPL0</name>
                            <description>The 0 group of left channel microphone data flow delay period</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

        <peripheral derivedFrom="SAI0">
            <name>SAI1</name>
            <baseAddress>0x40015C00</baseAddress>
            <interrupt>
                <name>SAI1</name>
                <value>91</value>
            </interrupt>
        </peripheral>

        <peripheral derivedFrom="SAI0">
            <name>SAI2</name>
            <baseAddress>0x40016000</baseAddress>
            <interrupt>
                <name>SAI2</name>
                <value>114</value>
            </interrupt>
        </peripheral>

        <peripheral>
            <name>SYSCFG</name>
            <description>System and memory architectur</description>
            <groupName>SYSCFG</groupName>
            <baseAddress>0x58000400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PMCFG</name>
                    <displayName>PMCFG</displayName>
                    <description>Peripheral mode configuration register</description>
                    <addressOffset>0x004</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0F000000</resetValue>
                    <fields>
                        <field>
                            <name>PC3SWON</name>
                            <description>PC3 switch open</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PC2SWON</name>
                            <description>PC2 switch open</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA1SWON</name>
                            <description>PA1 switch open</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA0SWON</name>
                            <description>PA0 switch open</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET0_PHY_SEL</name>
                            <description>Ethernet0 PHY interface selection</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENET1_PHY_SEL</name>
                            <description>Ethernet1 PHY interface selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB9FMPEN</name>
                            <description>PB9 pin Fm+ mode enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB8FMPEN</name>
                            <description>PB8 pin Fm+ mode enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB7FMPEN</name>
                            <description>PB7 pin Fm+ mode enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB6FMPEN</name>
                            <description>PB6 pin Fm+ mode enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C3FMPEN</name>
                            <description>I2C3 Fm+</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C2FMPEN</name>
                            <description>I2C2 Fm+</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1FMPEN</name>
                            <description>I2C1 Fm+</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C0FMPEN</name>
                            <description>I2C0 Fm+</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTISS0</name>
                    <displayName>EXTISS0</displayName>
                    <description>EXTI sources selection register 0</description>
                    <addressOffset>0x008</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EXTI3_SS</name>
                            <description>EXTI 3 sources selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI2_SS</name>
                            <description>EXTI 2 sources selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI1_SS</name>
                            <description>EXTI 1 sources selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI0_SS</name>
                            <description>EXTI 0 sources selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTISS1</name>
                    <displayName>EXTISS1</displayName>
                    <description>EXTI sources selection register 1</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>0x20</size>
                    <resetValue>00000000</resetValue>
                    <fields>
                        <field>
                            <name>EXTI7_SS</name>
                            <description>EXTI 7 sources selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI6_SS</name>
                            <description>EXTI 6 sources selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI5_SS</name>
                            <description>EXTI 5 sources selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI4_SS</name>
                            <description>EXTI 4 sources selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTISS2</name>
                    <displayName>EXTISS2</displayName>
                    <description>EXTI sources selection register 2</description>
                    <addressOffset>0x010</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EXTI11_SS</name>
                            <description>EXTI 11 sources selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI10_SS</name>
                            <description>EXTI 10 sources selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI9_SS</name>
                            <description>EXTI 9 sources selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI8_SS</name>
                            <description>EXTI 8 sources selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTISS3</name>
                    <displayName>EXTISS3</displayName>
                    <description>EXTI sources selection register 3</description>
                    <addressOffset>0x014</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EXTI15_SS</name>
                            <description>EXTI 15 sources selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI14_SS</name>
                            <description>EXTI 14 sources selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI13_SS</name>
                            <description>EXTI 13 sources selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTI12_SS</name>
                            <description>EXTI 12 sources selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LKCTL</name>
                    <displayName>LKCTL</displayName>
                    <description>Lockup control register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AXIRAM_LOCK</name>
                            <description>Region 0 AXI-SRAM ECC double error lock bit</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITCM_LOCK</name>
                            <description>Region 0 ITCM-RAM ECC double error lock bit</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTCM_LOCK</name>
                            <description>Region 0 DTCM ECC double error lock bit</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM0_LOCK</name>
                            <description>Region 1 SRAM0 ECC double error lockup bit</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1_LOCK</name>
                            <description>Region 1 SRAM1 ECC double error lockup bit</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKPRAM_LOCK</name>
                            <description>Region 2 backup SRAM ECC double error lockup bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPU_LOCK</name>
                            <description>CPU lockup bit</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVD_LOCK</name>
                            <description>Low voltage detector lockup bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
