burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CPSCTL</name>
                    <displayName>CPSCTL</displayName>
                    <description>I/O compensation control register</description>
                    <addressOffset>0x020</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IOLV</name>
                            <description>I/O in low voltage state</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IOSPDOP</name>
                            <description>I/O speed optimization, High-speed at low-voltage</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPS_RDY</name>
                            <description>Compensation cell ready flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CPS_EN</name>
                            <description>I/O compensation cell enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSCCCFG</name>
                    <displayName>CPSCCCFG</displayName>
                    <description>I/O compensation cell code configuration register</description>
                    <addressOffset>0x028</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCPSCC</name>
                            <description>PMOS compensation cell code</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NCPSCC</name>
                            <description>NMOS compensation cell code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL0</name>
                    <displayName>TIMERCISEL0</displayName>
                    <description>Timer input selection register 0</description>
                    <addressOffset>0x034</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER0_CI3_SEL</name>
                            <description>Selects TIMER0_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER0_CI2_SEL</name>
                            <description>Selects TIMER0_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER0_CI1_SEL</name>
                            <description>Selects TIMER0_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER0_CI0_SEL</name>
                            <description>Selects TIMER0_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER7_CI3_SEL</name>
                            <description>Selects TIMER7_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER7_CI2_SEL</name>
                            <description>Selects TIMER7_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER7_CI1_SEL</name>
                            <description>Selects TIMER7_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER7_CI0_SEL</name>
                            <description>Selects TIMER7_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL1</name>
                    <displayName>TIMERCISEL1</displayName>
                    <description>Timer input selection register 1</description>
                    <addressOffset>0x038</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER1_CI3_SEL</name>
                            <description>TIMER1_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1_CI2_SEL</name>
                            <description>TIMER1_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1_CI1_SEL</name>
                            <description>TIMER1_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1_CI0_SEL</name>
                            <description>TIMER1_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI3_SEL</name>
                            <description>TIMER2_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI2_SEL</name>
                            <description>TIMER2_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI1_SEL</name>
                            <description>TIMER2_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI0_SEL</name>
                            <description>TIMER2_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL2</name>
                    <displayName>TIMERCISEL2</displayName>
                    <description>Timer input selection register 2</description>
                    <addressOffset>0x03C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER3_CI3_SEL</name>
                            <description>TIMER3_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3_CI2_SEL</name>
                            <description>TIMER3_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3_CI1_SEL</name>
                            <description>TIMER3_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3_CI0_SEL</name>
                            <description>TIMER3_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI3_SEL</name>
                            <description>TIMER4_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI2_SEL</name>
                            <description>TIMER4_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI1_SEL</name>
                            <description>TIMER4_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI0_SEL</name>
                            <description>TIMER4_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL3</name>
                    <displayName>TIMERCISEL3</displayName>
                    <description>Timer input selection register 3</description>
                    <addressOffset>0x040</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER22_CI3_SEL</name>
                            <description>TIMER22_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22_CI2_SEL</name>
                            <description>TIMER22_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22_CI1_SEL</name>
                            <description>TIMER22_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22_CI0_SEL</name>
                            <description>TIMER22_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI3_SEL</name>
                            <description>TIMER23_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI2_SEL</name>
                            <description>TIMER23_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI1_SEL</name>
                            <description>TIMER23_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI0_SEL</name>
                            <description>TIMER23_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL4</name>
                    <displayName>TIMERCISEL4</displayName>
                    <description>Timer input selection register 4</description>
                    <addressOffset>0x044</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER30_CI3_SEL</name>
                            <description>TIMER30_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER30_CI2_SEL</name>
                            <description>TIMER30_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER30_CI1_SEL</name>
                            <description>TIMER30_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER30_CI0_SEL</name>
                            <description>TIMER30_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER31_CI3_SEL</name>
                            <description>TIMER31_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER31_CI2_SEL</name>
                            <description>TIMER31_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER31_CI1_SEL</name>
                            <description>TIMER31_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER31_CI0_SEL</name>
                            <description>TIMER31_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL5</name>
                    <displayName>TIMERCISEL5</displayName>
                    <description>Timer input selection register 5</description>
                    <addressOffset>0x048</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER42_CI1_SEL</name>
                            <description>Selects TIMER42_CI1 input</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER42_CI0_SEL</name>
                            <description>Selects TIMER42_CI0 input</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER41_CI1_SEL</name>
                            <description>Selects TIMER41_CI1 input</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER41_CI0_SEL</name>
                            <description>Selects TIMER41_CI0 input</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER40_CI1_SEL</name>
                            <description>Selects TIMER40_CI1 input</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER40_CI0_SEL</name>
                            <description>Selects TIMER40_CI0 input</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER14_CI1_SEL</name>
                            <description>Selects TIMER14_CI1 input</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER14_CI0_SEL</name>
                            <description>Selects TIMER14_CI0 input</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
