burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>TIMERCISEL6</name>
                    <displayName>TIMERCISEL6</displayName>
                    <description>Timer input selection register 6</description>
                    <addressOffset>0x04C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER44_CI1_SEL</name>
                            <description>Selects TIMER44_CI1 input</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER44_CI0_SEL</name>
                            <description>Selects TIMER44_CI0 input</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER43_CI1_SEL</name>
                            <description>Selects TIMER43_CI1 input</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER43_CI0_SEL</name>
                            <description>Selects TIMER43_CI0 input</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER16_CI0_SEL</name>
                            <description>Selects TIMER16_CI0 input</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER15_CI0_SEL</name>
                            <description>Selects TIMER15_CI0 input</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPUICAC</name>
                    <displayName>CPUICAC</displayName>
                    <description>CPU ICACHE error status registe</description>
                    <addressOffset>0x054</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CPU_ICDET</name>
                            <description>The ICACHE error detection information</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CPU_ICERR</name>
                            <description>The ICACHE error bank information</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPUDCAC</name>
                    <displayName>CPUDCAC</displayName>
                    <description>CPU DCACHE error status register</description>
                    <addressOffset>0x058</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CPU_DCDET</name>
                            <description>The DCACHE error detection information</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CPU_DCERR</name>
                            <description>The DCACHE error bank information</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUINTEN</name>
                    <displayName>FPUINTEN</displayName>
                    <description>FPU interrupt enable register</description>
                    <addressOffset>0x05C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000001F</resetValue>
                    <fields>
                        <field>
                            <name>IXIE</name>
                            <description>Inexact interrupt enable bit</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDIE</name>
                            <description>Input denormal interrupt enable bit</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFIE</name>
                            <description>Overflow interrupt enable bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UFIE</name>
                            <description>Underflow interrupt enable bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DZIE</name>
                            <description>Divide by 0 interrupt enable bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IOPIZ</name>
                            <description>Invalid operation interrupt enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMCFG0</name>
                    <displayName>SRAMCFG0</displayName>
                    <description>SYSCFG SRAM configuration register 0</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SECURE_SRAM_SIZE</name>
                            <description>These bits indicate the size of secure sram</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMCFG1</name>
                    <displayName>SRAMCFG1</displayName>
                    <description>SYSCFG SRAM configuration register 1</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TCM_WAITSTATE</name>
                            <description>TCM wait state configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>TIMER0CFG0</name>
                    <displayName>TIMER0CFG0</displayName>
                    <description>TIMER0 configuration register 0</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER1CFG0</name>
                    <displayName>TIMER1CFG0</displayName>
                    <description>TIMER1 configuration register 0</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER2CFG0</name>
                    <displayName>TIMER2CFG0</displayName>
                    <description>TIMER2 configuration register 0</description>
                    <addressOffset>0x118</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER3CFG0</name>
                    <displayName>TIMER3CFG0</displayName>
                    <description>TIMER3 configuration register 0</description>
                    <addressOffset>0x124</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER4CFG0</name>
                    <displayName>TIMER4CFG0</displayName>
                    <description>TIMER4 configuration register 0</description>
                    <addressOffset>0x130</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
