burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
<register>
                    <name>TIMER7CFG0</name>
                    <displayName>TIMER7CFG0</displayName>
                    <description>TIMER7 configuration register 0</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER14CFG0</name>
                    <displayName>TIMER14CFG0</displayName>
                    <description>TIMER14 configuration register 0</description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER22CFG0</name>
                    <displayName>TIMER22CFG0</displayName>
                    <description>TIMER22 configuration register 0</description>
                    <addressOffset>0x154</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER23CFG0</name>
                    <displayName>TIMER23CFG0</displayName>
                    <description>TIMER23 configuration register 0</description>
                    <addressOffset>0x160</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER30CFG0</name>
                    <displayName>TIMER30CFG0</displayName>
                    <description>TIMER30 configuration register 0</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER31CFG0</name>
                    <displayName>TIMER31CFG0</displayName>
                    <description>TIMER31 configuration register 0</description>
                    <addressOffset>0x178</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>	
		<register>
                    <name>TIMER40CFG0</name>
                    <displayName>TIMER40CFG0</displayName>
                    <description>TIMER40 configuration register 0</description>
                    <addressOffset>0x184</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER41CFG0</name>
                    <displayName>TIMER41CFG0</displayName>
                    <description>TIMER41 configuration register 0</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER42CFG0</name>
                    <displayName>TIMER42CFG0</displayName>
                    <description>TIMER42 configuration register 0</description>
                    <addressOffset>0x19C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER43CFG0</name>
                    <displayName>TIMER43CFG0</displayName>
                    <description>TIMER43 configuration register 0</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER44CFG0</name>
                    <displayName>TIMER44CFG0</displayName>
                    <description>TIMER44 configuration register 0</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
