burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>TIMER0CFG1</name>
                    <displayName>TIMER0CFG1</displayName>
                    <description>TIMER0 configuration register 1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>		
		<register>
                    <name>TIMER1CFG1</name>
                    <displayName>TIMER1CFG1</displayName>
                    <description>TIMER1 configuration register 1</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER2CFG1</name>
                    <displayName>TIMER2CFG1</displayName>
                    <description>TIMER2 configuration register 1</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER3CFG1</name>
                    <displayName>TIMER3CFG1</displayName>
                    <description>TIMER3 configuration register 1</description>
                    <addressOffset>0x128</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER4CFG1</name>
                    <displayName>TIMER4CFG1</displayName>
                    <description>TIMER4 configuration register 1</description>
                    <addressOffset>0x134</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER7CFG1</name>
                    <displayName>TIMER7CFG1</displayName>
                    <description>TIMER7 configuration register 1</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER14CFG1</name>
                    <displayName>TIMER14CFG1</displayName>
                    <description>TIMER14 configuration register 1</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER22CFG1</name>
                    <displayName>TIMER22CFG1</displayName>
                    <description>TIMER22 configuration register 1</description>
                    <addressOffset>0x158</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER23CFG1</name>
                    <displayName>TIMER23CFG1</displayName>
                    <description>TIMER23 configuration register 1</description>
                    <addressOffset>0x164</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER30CFG1</name>
                    <displayName>TIMER30CFG1</displayName>
                    <description>TIMER30 configuration register 1</description>
                    <addressOffset>0x170</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER31CFG1</name>
                    <displayName>TIMER31CFG1</displayName>
                    <description>TIMER31 configuration register 1</description>
                    <addressOffset>0x17C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER40CFG1</name>
                    <displayName>TIMER40CFG1</displayName>
                    <description>TIMER40 configuration register 1</description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER41CFG1</name>
                    <displayName>TIMER41CFG1</displayName>
                    <description>TIMER41 configuration register 1</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
