burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
		<register>
                    <name>TIMER42CFG1</name>
                    <displayName>TIMER42CFG1</displayName>
                    <description>TIMER42 configuration register 1</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER43CFG1</name>
                    <displayName>TIMER43CFG1</displayName>
                    <description>TIMER43 configuration register 1</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER44CFG1</name>
                    <displayName>TIMER44CFG1</displayName>
                    <description>TIMER44 configuration register 1</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER0CFG2</name>
                    <displayName>TIMER0CFG2</displayName>
                    <description>TIMER0 configuration register 2</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER1CFG2</name>
                    <displayName>TIMER1CFG2</displayName>
                    <description>TIMER1 configuration register 2</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER2CFG2</name>
                    <displayName>TIMER2CFG2</displayName>
                    <description>TIMER2 configuration register 2</description>
                    <addressOffset>0x120</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER3CFG2</name>
                    <displayName>TIMER3CFG2</displayName>
                    <description>TIMER3 configuration register 2</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER4CFG2</name>
                    <displayName>TIMER4CFG2</displayName>
                    <description>TIMER4 configuration register 2</description>
                    <addressOffset>0x138</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER7CFG2</name>
                    <displayName>TIMER7CFG2</displayName>
                    <description>TIMER7 configuration register 2</description>
                    <addressOffset>0x144</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER14CFG2</name>
                    <displayName>TIMER14CFG2</displayName>
                    <description>TIMER14 configuration register 2</description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER22CFG2</name>
                    <displayName>TIMER22CFG2</displayName>
                    <description>TIMER22 configuration register 2</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER23CFG2</name>
                    <displayName>TIMER23CFG2</displayName>
                    <description>TIMER23 configuration register 2</description>
                    <addressOffset>0x168</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER30CFG2</name>
                    <displayName>TIMER30CFG2</displayName>
                    <description>TIMER30 configuration register 2</description>
                    <addressOffset>0x174</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER31CFG2</name>
                    <displayName>TIMER31CFG2</displayName>
                    <description>TIMER31 configuration register 2</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER40CFG2</name>
                    <displayName>TIMER40CFG2</displayName>
                    <description>TIMER40 configuration register 2</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER41CFG2</name>
                    <displayName>TIMER41CFG2</displayName>
                    <description>TIMER41 configuration register 2</description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER42CFG2</name>
                    <displayName>TIMER42CFG2</displayName>
                    <description>TIMER42 configuration register 2</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER43CFG2</name>
                    <displayName>TIMER43CFG2</displayName>
                    <description>TIMER43 configuration register 2</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>TIMER44CFG2</name>
                    <displayName>TIMER44CFG2</displayName>
                    <description>TIMER44 configuration register 2</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
		<register>
                    <name>USERCFG0</name>
                    <displayName>USERCFG0</displayName>
                    <description>User configuration register 0</description>
                    <addressOffset>0x300</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BOOT_MODE</name>
                            <description>Boot mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BORLEV</name>
                            <description>BOR Brownout reset threshold level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USERCFG1</name>
                    <displayName>USERCFG1</displayName>
                    <description>User configuration register 1</description>
                    <addressOffset>0x304</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ANA_VERSION</name>
                            <description>The analog version signal</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
