burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDMAEND</name>
                            <description>IDMA transfer end</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IDMERR</name>
                            <description>IDMA transfer error</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLKSTOP</name>
                            <description>CLK stopped in Voltage switch procedure</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VSEND</name>
                            <description>Voltage switch critical timing section end</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ACKTO</name>
                            <description>Boot acknowledgment timeout</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ACKFAIL</name>
                            <description>Boot acknowledgment received and check fail</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDIOINT</name>
                            <description>SD I/O interrupt received</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DAT0BSYEND</name>
                            <description>CMD response busy,DAT0 driver low</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DAT0BSY</name>
                            <description>CMD response busy,Inverted DAT0 line</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFE</name>
                            <description>Receive FIFO is empty</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFE</name>
                            <description>Transmit FIFO is empty</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFF</name>
                            <description>Receive FIFO is full</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFF</name>
                            <description>Transmit FIFO is full</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFH</name>
                            <description>Receive FIFO is half full: at least half the number of words can be read in the FIFO</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TFH</name>
                            <description>Transmit FIFO is half empty: at least half the number of words can be written into the FIFO</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMDSTA</name>
                            <description>Data path active state</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATSTA</name>
                            <description>Command path active state</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATABOR</name>
                            <description>Data transfer aborted by CMD12</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTBLKEND</name>
                            <description>Data block sent/received (CRC check passed)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATHOLD</name>
                            <description>Data transfer hold</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTEND</name>
                            <description>Data end (data counter, DATACNT is zero)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMDSEND</name>
                            <description>Command sent (no response required)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMDRECV</name>
                            <description>Command response received (CRC check passed)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXORE</name>
                            <description>Received FIFO overrun error occurs</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXURE</name>
                            <description>Transmit FIFO underrun error occurs</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTTMOUT</name>
                            <description>Data timeout</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMDTMOUT</name>
                            <description>Command response timeout</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTCRCERR</name>
                            <description>Data block sent/received (CRC check failed)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CCRCERR</name>
                            <description>Command response received (CRC check failed)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTC</name>
                    <displayName>INTC</displayName>
                    <description>Interrupt clear register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDMAENDC</name>
                            <description>IDMAEND flag clear bit</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IDMAERRC</name>
                            <description>IDMERR flag clear bit</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLKSTOPC</name>
                            <description>CLKSTOP  flag clear bit</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>VSENDC</name>
                            <description>VSEND flag clear bit</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ACKTOC</name>
                            <description>ACKTO flag clear bit</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ACKFAILC</name>
                            <description>ACKFAIL flag clear bit</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SDIOINTC</name>
                            <description>SDIOINT flag clear bit</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DAT0BSYENDC</name>
                            <description>DAT0BSYEND flag clear bit</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DATABORC</name>
                            <description>DATABOR flag clear bit</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DTBLKENDC</name>
                            <description>DTBLKEND flag clear bit</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DATHOLDC</name>
                            <description>DATHOLD flag clear bit</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DTENDC</name>
                            <description>DTEND flag clear bit</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDSENDC</name>
                            <description>CMDSEND flag clear bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDRECVC</name>
                            <description>CMDRECV flag clear bit</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RXOREC</name>
                            <description>RXORE flag clear bit</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TXUREC</name>
                            <description>TXURE flag clear bit</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DTTMOUTC</name>
                            <description>DTTMOUT flag clear bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDTMOUTC</name>
                            <description>CMDTMOUT flag clear bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DTCRCERRC</name>
                            <description>DTCRCERR flag clear bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CCRCERRC</name>
                            <description>CCRCERR flag clear bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
