burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>Interrupt enable register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDMAENDIE</name>
                            <description>IDMA transfer end interrupt enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDMAERRIE</name>
                            <description>IDMA transfer error interrupt enable</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKSTOPIE</name>
                            <description>Voltage Switch clock stopped interrupt enable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VSENDIE</name>
                            <description>Voltage switch critical timing section end interrupt enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACKTOIE</name>
                            <description>Boot acknowledgment timeout enable</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACKFAILIE</name>
                            <description>Boot acknowledgment received and check fail interrupt enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIOINTIE</name>
                            <description>SD I/O interrupt received interrupt enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAT0BSYENDIE</name>
                            <description>DAT0 line signal changed from busy to ready interrupt enable</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TFEIE</name>
                            <description>Transmit FIFO empty interrupt enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFFIE</name>
                            <description>Receive FIFO full interrupt enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFHIE</name>
                            <description>Receive FIFO half full interrupt enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TFHIE</name>
                            <description>Transmit FIFO half empty interrupt enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATABORIE</name>
                            <description>Data transfer abort interrupt enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTBLKENDIE</name>
                            <description>Data block end interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATHOLDIE</name>
                            <description>Data hold interrupt enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTENDIE</name>
                            <description>Data end interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDSENDIE</name>
                            <description>Command sent interrupt enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDRECVIE</name>
                            <description>Command response received interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXOREIE</name>
                            <description>Received FIFO overrun error interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXUREIE</name>
                            <description>Transmit FIFO underrun error interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTTMOUTIE</name>
                            <description>Data timeout interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDTMOUTIE</name>
                            <description>Command response timeout interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTCRCERRIE</name>
                            <description>Data CRC fail interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CCRCERRIE</name>
                            <description>Command response CRC fail interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ACKTIMER</name>
                    <displayName>ACKTIMER</displayName>
                    <description>FIFO ACK timer register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ACKTIME</name>
                            <description>Boot ACK timeout period</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIFO</name>
                    <displayName>FIFO</displayName>
                    <description>FIFO data register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FIFODT</name>
                            <description>Receive FIFO data or transmit FIFO data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDMACTL</name>
                    <displayName>IDMACTL</displayName>
                    <description>FIFO internal DMA control register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BUFSEL</name>
                            <description>IDMA double buffer selection bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFMOD</name>
                            <description>Double buffer selection bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDMAEN</name>
                            <description>FIFO internal DMA enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDMASIZE</name>
                    <displayName>IDMASIZE</displayName>
                    <description>FIFO internal DMA buffer size register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDMASIZE</name>
                            <description>Number of bytes per buffer</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDMAADDR0</name>
                    <displayName>IDMAADDR0</displayName>
                    <description>IDMA buffer 0 base address register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDMAADDR0</name>
                            <description>The address is a multiple of 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDMAADDR1</name>
                    <displayName>IDMAADDR1</displayName>
                    <description>IDMA buffer 1 base address register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDMAADDR1</name>
                            <description>The address is a multiple of 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
