burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

<peripheral>
      <name>TRIGSEL</name>
      <description>Trigger selection controller</description>
      <groupName>TRIGSEL</groupName>
      <baseAddress>0x40018400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
<register>
        <name>EXTOUT0</name>
        <displayName>EXTOUT0</displayName>
        <description>Trigger selection for EXTOUT0 register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL1</name>
            <description>Trigger input source selection for output1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>EXTOUT1</name>
        <displayName>EXTOUT1</displayName>
        <description>Trigger selection for EXTOUT1 register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>未知模式</access>
          </field>
          <field>
            <name>INSEL1</name>
            <description>Trigger input source selection for output1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>EXTOUT2</name>
        <displayName>EXTOUT2</displayName>
        <description>Trigger selection for EXTOUT2 register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL1</name>
            <description>Trigger input source selection for output1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>EXTOUT3</name>
        <displayName>EXTOUT3</displayName>
        <description>Trigger selection for EXTOUT3 register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>未知模式</access>
          </field>
          <field>
            <name>INSEL1</name>
            <description>Trigger input source selection for output1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>ADC0</name>
        <displayName>ADC0</displayName>
        <description>Trigger selection for ADC0 register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00001113</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>ADC1</name>
        <displayName>ADC1</displayName>
        <description>Trigger selection for ADC1 register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00001113</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>ADC2</name>
        <displayName>ADC2</displayName>
        <description>Trigger selection for ADC2 register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00001113</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>DACOUT0</name>
        <displayName>DACOUT0</displayName>
        <description>Trigger selection for DAC_OUT0 register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000025</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>DACOUT1</name>
        <displayName>DACOUT1</displayName>
        <description>Trigger selection for DAC_OUT1 register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000025</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER0BRKIN</name>
        <displayName>TIMER0BRKIN</displayName>
        <description>Trigger selection for TIMER0_BRKIN register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00232221</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL2</name>
            <description>Trigger input source selection for output2</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL1</name>
            <description>Trigger input source selection for output1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER7BRKIN</name>
        <displayName>TIMER7BRKIN</displayName>
        <description>Trigger selection for TIMER7_BRKIN register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x0051504F</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL2</name>
            <description>Trigger input source selection for output2</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL1</name>
            <description>Trigger input source selection for output1</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER14BRKIN</name>
        <displayName>TIMER14BRKIN</displayName>
        <description>Trigger selection for TIMER14_BRKIN register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000059</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER15BRKIN</name>
        <displayName>TIMER15BRKIN</displayName>
        <description>Trigger selection for TIMER15_BRKIN register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000005E</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER16BRKIN</name>
        <displayName>TIMER16BRKIN</displayName>
        <description>Trigger selection for TIMER16_BRKIN register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000063</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER40BRKIN</name>
        <displayName>TIMER40BRKIN</displayName>
        <description>Trigger selection for TIMER40_BRKIN register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000082</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER41BRKIN</name>
        <displayName>TIMER41BRKIN</displayName>
        <description>Trigger selection for TIMER41_BRKIN register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000089</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER42BRKIN</name>
        <displayName>TIMER42BRKIN</displayName>
        <description>Trigger selection for TIMER42_BRKIN register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000090</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER43BRKIN</name>
        <displayName>TIMER43BRKIN</displayName>
        <description>Trigger selection for TIMER43_BRKIN register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000097</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER44BRKIN</name>
        <displayName>TIMER44BRKIN</displayName>
        <description>Trigger selection for TIMER44_BRKIN register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000009e</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>CAN0</name>
        <displayName>CAN0</displayName>
        <description>Trigger selection for CAN0 register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000003d</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>CAN1</name>
        <displayName>CAN1</displayName>
        <description>Trigger selection for CAN1 register</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000003d</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>CAN2</name>
        <displayName>CAN2</displayName>
        <description>Trigger selection for CAN2 register</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000003d</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>LPDTS</name>
        <displayName>LPDTS</displayName>
        <description>Trigger selection for LPDTS register</description>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER0ETI</name>
        <displayName>TIMER0ETI</displayName>
        <description>Trigger selection for TIMER0_ETI register</description>
        <addressOffset>0x5C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000024</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER1ETI</name>
        <displayName>TIMER1ETI</displayName>
        <description>Trigger selection for TIMER1_ETI register</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000002a</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
