burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
<register>
        <name>TIMER2ETI</name>
        <displayName>TIMER2ETI</displayName>
        <description>Trigger selection for TIMER2_ETI register</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000030</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER3ETI</name>
        <displayName>TIMER3ETI</displayName>
        <description>Trigger selection for TIMER3_ETI register</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000036</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER4ETI</name>
        <displayName>TIMER4ETI</displayName>
        <description>Trigger selection for TIMER4_ETI register</description>
        <addressOffset>0x6C</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000003c</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER7ETI</name>
        <displayName>TIMER7ETI</displayName>
        <description>Trigger selection for TIMER7_ETI register</description>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000052</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER22ETI</name>
        <displayName>TIMER22ETI</displayName>
        <description>Trigger selection for TIMER22_ETI register</description>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000069</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER23ETI</name>
        <displayName>TIMER23ETI</displayName>
        <description>Trigger selection for TIMER23_ETI register</description>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000006f</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER30ETI</name>
        <displayName>TIMER30ETI</displayName>
        <description>Trigger selection for TIMER30_ETI register</description>
        <addressOffset>0x7C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000075</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER31ETI</name>
        <displayName>TIMER31ETI</displayName>
        <description>Trigger selection for TIMER31_ETI register</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000007b</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>EDOUT</name>
        <displayName>EDOUT</displayName>
        <description>Trigger selection for EDOUT register</description>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>HPDF</name>
        <displayName>HPDF</displayName>
        <description>Trigger selection for HPDF_ITRG register</description>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER0ITI14</name>
        <displayName>TIMER0ITI14</displayName>
        <description>Trigger selection for TIMER0_ITI14 register</description>
        <addressOffset>0x8C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER1ITI14</name>
        <displayName>TIMER1ITI14</displayName>
        <description>Trigger selection for TIMER1_ITI14 register</description>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER2ITI14</name>
        <displayName>TIMER2ITI14</displayName>
        <description>Trigger selection for TIMER2_ITI14 register</description>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER3ITI14</name>
        <displayName>TIMER3ITI14</displayName>
        <description>Trigger selection for TIMER3_ITI14 register</description>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER4ITI14</name>
        <displayName>TIMER4ITI14</displayName>
        <description>Trigger selection for TIMER4_ITI14 register</description>
        <addressOffset>0x9C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER7ITI14</name>
        <displayName>TIMER7ITI14</displayName>
        <description>Trigger selection for TIMER7_ITI14 register</description>
        <addressOffset>0xA0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER14ITI14</name>
        <displayName>TIMER14ITI14</displayName>
        <description>Trigger selection for TIMER14_ITI14 register</description>
        <addressOffset>0xA4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER22ITI14</name>
        <displayName>TIMER22ITI14</displayName>
        <description>Trigger selection for TIMER22_ITI14 register</description>
        <addressOffset>0xA8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER23ITI14</name>
        <displayName>TIMER23ITI14</displayName>
        <description>Trigger selection for TIMER23_ITI14 register</description>
        <addressOffset>0xAC</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER30ITI14</name>
        <displayName>TIMER30ITI14</displayName>
        <description>Trigger selection for TIMER30_ITI14 register</description>
        <addressOffset>0xB0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER31ITI14</name>
        <displayName>TIMER31ITI14</displayName>
        <description>Trigger selection for TIMER31_ITI14 register</description>
        <addressOffset>0xB4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER40ITI14</name>
        <displayName>TIMER40ITI14</displayName>
        <description>Trigger selection for TIMER40_ITI14 register</description>
        <addressOffset>0xB8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER41ITI14</name>
        <displayName>TIMER41ITI14</displayName>
        <description>Trigger selection for TIMER41_ITI14 register</description>
        <addressOffset>0xBC</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER42ITI14</name>
        <displayName>TIMER42ITI14</displayName>
        <description>Trigger selection for TIMER42_ITI14 register</description>
        <addressOffset>0xC0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
        </register>
<register>
        <name>TIMER43ITI14</name>
        <displayName>TIMER43ITI14</displayName>
        <description>Trigger selection for TIMER43_ITI14 register</description>
        <addressOffset>0xC4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
       </register>
      <register>
        <name>TIMER44ITI14</name>
        <displayName>TIMER44ITI14</displayName>
        <description>Trigger selection for TIMER44_ITI14 register</description>
        <addressOffset>0xC8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
          <field>
            <name>LK</name>
            <description>TRIGSEL register lock</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INSEL0</name>
            <description>Trigger input source selection for output0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
      </fields>
      </register>
