burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TLI</name>
            <description>TFT-LCD interface</description>
            <groupName>TLI</groupName>
            <baseAddress>0x50001000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TLI_ER</name>
                <value>89</value>
            </interrupt>
            <interrupt>
                <name>TLI</name>
                <value>88</value>
            </interrupt>
            <registers>
                <register>
                    <name>SPSZ</name>
                    <displayName>SPSZ</displayName>
                    <description>Synchronous pulse size register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VPSZ</name>
                            <description>size of vertical synchronous pluse</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HPSZ</name>
                            <description>size of horizontal synchronous pluse</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BPSZ</name>
                    <displayName>BPSZ</displayName>
                    <description>Back-porch size register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VBPSZ</name>
                            <description>Size of the vertical back porch plus synchronous pulse</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HBPSZ</name>
                            <description>Size of the horizontal back porch plus synchronous pulse</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ASZ</name>
                    <displayName>ASZ</displayName>
                    <description>Active size register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VASZ</name>
                            <description>Size of the vertical active area width plus back porch and synchronous pulse</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HASZ</name>
                            <description>Size of the horizontal active area width plus back porch and synchronous pulse</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSZ</name>
                    <displayName>TSZ</displayName>
                    <description>Total size register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VTSZ</name>
                            <description>Vertical total size of the display</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>HTSZ</name>
                            <description>Horizontal total size of the display</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL</name>
                    <displayName>CLT</displayName>
                    <description>Control register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00002220</resetValue>
                    <fields>
                        <field>
                            <name>HPPS</name>
                            <description>Horizontal Pulse Polarity Selection</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VPPS</name>
                            <description>Vertical Pulse Polarity Selection</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEPS</name>
                            <description>Data Enable Polarity Selection</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKPS</name>
                            <description>Pixel Clock Polarity Selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DFEN</name>
                            <description>Dither Function Enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDB</name>
                            <description>Red channel Dither Bits Number</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>GDB</name>
                            <description>Green channel Dither Bits Number</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BDB</name>
                            <description>Blue channel Dither Bits Number</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TLIEN</name>
                            <description>TLI enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RL</name>
                    <displayName>RL</displayName>
                    <description>Reload layer register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FBR</name>
                            <description>Frame Blank Reload</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RQR</name>
                            <description>Request Reload</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BGC</name>
                    <displayName>BGC</displayName>
                    <description>Background color register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BVR</name>
                            <description>Background value red</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BVG</name>
                            <description>Background value green</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>BVB</name>
                            <description>Background value blue</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>Interrupt enable register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCRIE</name>
                            <description>Layer Configuration Reloaded Interrupt Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEIE</name>
                            <description>Transaction Error Interrupt Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIE</name>
                            <description>FIFO Error Interrupt Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LMIE</name>
                            <description>Line Mark Interrupt Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <displayName>INTF</displayName>
                    <description>Interrupt flag register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCRF</name>
                            <description>Layer Configuration Reloaded Flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEF</name>
                            <description>Transaction Error Flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEF</name>
                            <description>FIFO Error Flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LMF</name>
                            <description>Line Mark Flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTC</name>
                    <displayName>INTC</displayName>
                    <description>Interrupt flag clear register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCRC</name>
                            <description>Layer Configuration Reloaded Flag Clear</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEC</name>
                            <description>Transaction Error Flag Clear</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEC</name>
                            <description>FIFO Error Flag Clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>Line Mark Flag Clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LM</name>
                    <displayName>LM</displayName>
                    <description>Line mark register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LM</name>
                            <description>Line Mark value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPPOS</name>
                    <displayName>CPPOS</displayName>
                    <description>Current pixel position register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HPOS</name>
                            <description>Horizontal position</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>VPOS</name>
                            <description>Vertical position</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000000F</resetValue>
                    <fields>
                        <field>
                            <name>HS</name>
                            <description>Current HS staus of the TLI</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VS</name>
                            <description>Current VS staus of the TLI</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HDE</name>
                            <description>Current HDE status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VDE</name>
                            <description>Current VDE status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>L0CTL</name>
                    <displayName>L0CTL</displayName>
                    <description>Layer 0 control register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LUTEN</name>
                            <description>LUT enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CKEYEN</name>
                            <description>Color keying enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEN</name>
                            <description>Layer enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>L1CTL</name>
                    <displayName>L1CTL</displayName>
                    <description>Layer 1 control register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LUTEN</name>
                            <description>LUT enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CKEYEN</name>
                            <description>Color keying enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEN</name>
                            <description>Layer enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>L0HPOS</name>
                    <displayName>L0HPOS</displayName>
                    <description>Layer 0 horizontal position parameters register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WLP</name>
                            <description>Window left position</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>WRP</name>
                            <description>Window right position</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
