burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>SWEVG</name>
                    <displayName>SWEVG</displayName>
                    <description>Software event generation register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3COMADDG</name>
                            <description>Channel 3 additional compare event generation</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CH2COMADDG</name>
                            <description>Channel 2 additional compare event generation</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CH1COMADDG</name>
                            <description>Channel 1 additional compare event generation</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CH0COMADDG</name>
                            <description>Channel 0 additional compare event generation</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MCH3G</name>
                            <description>Multi mode channel 3 capture or compare event generation</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MCH2G</name>
                            <description>Multi mode channel 2 capture or compare event generation</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MCH1G</name>
                            <description>Multi mode channel 1 capture or compare event generation</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MCH0G</name>
                            <description>Multi mode channel 0 capture or compare event generation</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BRK1G</name>
                            <description>Break1 event generation</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BRK0G</name>
                            <description>Break0 event generation</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TRGG</name>
                            <description>Trigger event generation</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMTG</name>
                            <description>Channel commutation event generation</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CH3G</name>
                            <description>Channel 3 capture or compare event generation</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CH2G</name>
                            <description>Channel 2 capture or compare event generation</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CH1G</name>
                            <description>Channel 1 capture or compare event generation</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CH0G</name>
                            <description>Channel 0 capture or compare event generation</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>UPG</name>
                            <description>Update event generation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTL0_Output</name>
                    <displayName>CHCTL0_Output</displayName>
                    <description>
                        Channel control register 0 (output
                        mode)
                    </description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH1MS_2</name>
                            <description>2th bit of CH1MS</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH0MS_2</name>
                            <description>2th bit of CH0MS</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1COMADDSEN</name>
                            <description>Channel 1 additional compare output shadow enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH0COMADDSEN</name>
                            <description>Channel 0 additional compare output shadow enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1COMCTL_3</name>
                            <description>Bit 3 of channel 1 compare output control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH0COMCTL_3</name>
                            <description>Bit 3 of channel 1 compare output control</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1COMCEN</name>
                            <description>Channel 1 output compare clear enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1COMCTL</name>
                            <description>Channel 1 compare output control</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CH1COMSEN</name>
                            <description>Channel 1 output compare shadow enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1MS</name>
                            <description>Channel 1 mode selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH0COMCEN</name>
                            <description>Channel 0 output compare clear enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH0COMCTL</name>
                            <description>Channel 0 compare output control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CH0COMSEN</name>
                            <description>Channel 0 compare output shadow enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH0MS</name>
                            <description>Channel 0 I/O mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTL0_Input</name>
                    <displayName>CHCTL0_Input</displayName>
                    <description>
                        Channel control register 0 (input
                        mode)
                    </description>
                    <alternateRegister>CHCTL0_Output</alternateRegister>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH1MS_2</name>
                            <description>2th bit of CH1MS</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH0MS_2</name>
                            <description>2th bit of CH0MS</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1CAPFLT</name>
                            <description>Channel 1 input capture filter control</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CH1CAPPSC</name>
                            <description>Channel 1 input capture prescaler</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH1MS</name>
                            <description>Channel 1 mode selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH0CAPFLT</name>
                            <description>Channel 0 input capture filter control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CH0CAPPSC</name>
                            <description>Channel 0 input capture prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH0MS</name>
                            <description>Channel 0 mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTL1_Output</name>
                    <displayName>CHCTL1_Output</displayName>
                    <description>
                        Channel control register 1 (output
                        mode)
                    </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH3MS_2</name>
                            <description>2th bit of CH3MS</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2MS_2</name>
                            <description>2th bit of CH2MS</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3COMADDSEN</name>
                            <description>Channel 3 additional compare output shadow enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2COMADDSEN</name>
                            <description>Channel 2 additional compare output shadow enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3COMCTL_3</name>
                            <description>BIT 3 of channel 3 compare output control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2COMCTL_3</name>
                            <description>BIT 3 of channel 2 compare output control</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3COMCEN</name>
                            <description>Channel 3 output compare clear enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3COMCTL</name>
                            <description>Channel 3 compare output control</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CH3COMSEN</name>
                            <description>Channel 3 output compare shadow enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3MS</name>
                            <description>Channel 3 mode selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH2COMCEN</name>
                            <description>Channel 2 output compare clear enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2COMCTL</name>
                            <description>Channel 2 compare output control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CH2COMSEN</name>
                            <description>Channel 2 compare output shadow enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2MS</name>
                            <description>Channel 2 I/O mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTL1_Input</name>
                    <displayName>CHCTL1_Input</displayName>
                    <description>
                        Channel control register 1 (input
                        mode)
                    </description>
                    <alternateRegister>CHCTL1_Output</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH3MS_2</name>
                            <description>2th bit of CH3MS</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2MS_2</name>
                            <description>2th bit of CH2MS</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3CAPFLT</name>
                            <description>Channel 3 input capture filter control</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CH3CAPPSC</name>
                            <description>Channel 3 input capture prescaler</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH3MS</name>
                            <description>Channel 3 mode selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH2CAPFLT</name>
                            <description>Channel 2 input capture filter control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CH2CAPPSC</name>
                            <description>Channel 2 input capture prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH2MS</name>
                            <description>Channel 2 mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
