burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>MCHCTL0_Output</name>
                    <displayName>MCHCTL0_Output</displayName>
                    <description>
                        Multi mode channel control register 0 (output
                        mode)
                    </description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH0MS_2</name>
                            <description>Multi mode channel 0 I/O mode selection</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                       <field>
                            <name>MCH0COMCTL_3</name>
                            <description>Multi mode channel 0 compare output control</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH1MS</name>
                            <description>Multi mode channel 1 I/O mode selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH0COMCTL</name>
                            <description>Multi mode channel 0 output compare control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCH0COMSEN</name>
                            <description>Multi mode channel 0 output compare shadow enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH0MS</name>
                            <description>Multi mode channel 0 I/O mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCHCTL0_Input</name>
                    <displayName>MCHCTL0_Input</displayName>
                    <description>
                        Multi mode channel control register 0 (input
                        mode)
                    </description>
                    <alternateRegister>MCHCTL0_Output</alternateRegister>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH0MS_2</name>
                            <description>Multi mode channel 0 I/O mode selection</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH0CAPFLT</name>
                            <description>Multi mode channel 0 input capture filter control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCH0CAPPSC</name>
                            <description>Multi mode channel 0 input capture prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH0MS</name>
                            <description>Multi mode channel 0 I/O mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCHFCTL2</name>
                    <displayName>MCHFCTL2</displayName>
                    <description>Multi mode channel control register  2</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH0FP</name>
                            <description>Multi mode channel 0 capture/compare free polarity</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCH0CV</name>
                    <displayName>MCH0CV</displayName>
                    <description>Multi mode channel 0 capture/compare value register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH0VAL</name>
                            <description>Capture/compare value of multi mode channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0COMV_ADD</name>
                    <displayName>CH0COMV_ADD</displayName>
                    <description>Channel 0 additional compare value register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH0COMVAL_ADD</name>
                            <description>Additional compare value of channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1COMV_ADD</name>
                    <displayName>CH1COMV_ADD</displayName>
                    <description>Channel 1 additional compare value register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH1COMVAL_ADD</name>
                            <description>Additional compare value of channel 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL2</name>
                    <displayName>CTL2</displayName>
                    <description>Control register 2</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FF000FF</resetValue>
                    <fields>
                        <field>
                            <name>CH1CPWMEN</name>
                            <description>Channel 1 composite PWM mode enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH0CPWMEN</name>
                            <description>Channel 0 composite PWM mode enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH0MSEL</name>
                            <description>Multi mode channel 0 mode select</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH1OMPSEL</name>
                            <description>Channel 1 output match pulse select</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH0OMPSEL</name>
                            <description>Channel 0 output match pulse select</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFCTL0</name>
                    <displayName>AFCTL0</displayName>
                    <description>alternate function control register 0</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>BRK0CMP1P</name>
                            <description>BRK CMP1 input polarity</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRK0CMP0P</name>
                            <description>BRK CMP0 input polarity</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRK0IN0P</name>
                            <description>BREAK0 BRKIN0 alternate function input polarity</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRK0CMP1EN</name>
                            <description>BRK CMP1 enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRK0CMP0EN</name>
                            <description>BRK CMP0 enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRK0HPDFEN</name>
                            <description>BRK HPDF input enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRK0IN0EN</name>
                            <description>BREAK0 BRKIN0 alternate function input enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>CREP1</name>
                    <displayName>CREP1</displayName>
                    <description>Counter repetition register 1</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CREP1</name>
                            <description>Counter repetition value 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DMACFG</name>
                    <displayName>DMACFG</displayName>
                    <description>DMA configuration register</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMATC</name>
                            <description>DMA transfer count</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMATA</name>
                            <description>DMA transfer access start address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMATB</name>
                    <displayName>DMATB</displayName>
                    <description>DMA transfer buffer register</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DMATB</name>
                            <description>DMA transfer buffer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Configuration register</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                       <field>
                            <name>CCUSEL</name>
                            <description>Commutation control shadow register update select</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CREPSEL</name>
                            <description>The counter repetition register select</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHVSEL</name>
                            <description>Write CHxVAL register selection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>The output value selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
