burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

        <peripheral derivedFrom="TIMER15">
            <name>TIMER16</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x40014800</baseAddress>
            <interrupt>
                <name>TIMER16</name>
                <value>118</value>
            </interrupt>
        </peripheral>

        <peripheral derivedFrom="TIMER14">
            <name>TIMER40</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x4001D000</baseAddress>
            <interrupt>
                <name>TIMER40</name>
                <value>165</value>
            </interrupt>
        </peripheral>


        <peripheral derivedFrom="TIMER14">
            <name>TIMER41</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x4001D400</baseAddress>
            <interrupt>
                <name>TIMER41</name>
                <value>166</value>
            </interrupt>
        </peripheral>

        <peripheral derivedFrom="TIMER14">
            <name>TIMER42</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x4001D800</baseAddress>
            <interrupt>
                <name>TIMER42</name>
                <value>167</value>
            </interrupt>
        </peripheral>

        <peripheral derivedFrom="TIMER14">
            <name>TIMER43</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x4001DC00</baseAddress>
            <interrupt>
                <name>TIMER43</name>
                <value>168</value>
            </interrupt>
        </peripheral>

        <peripheral derivedFrom="TIMER14">
            <name>TIMER44</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x4001F000</baseAddress>
            <interrupt>
                <name>TIMER44</name>
                <value>169</value>
            </interrupt>
        </peripheral>

        <peripheral>
            <name>TIMER5</name>
            <description>Basic-timers</description>
            <groupName>TIMER</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIMER5_DAC</name>
                <value>54</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL0</name>
                    <displayName>CTL0</displayName>
                    <description>control register 0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UPIFBUEN</name>
                            <description>UPIF bit backup enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARSE</name>
                            <description>Auto-reload preload enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPM</name>
                            <description>One-pulse mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPS</name>
                            <description>Update request source</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPDIS</name>
                            <description>Update disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Counter enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL1</name>
                    <displayName>CTL1</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MMC0</name>
                            <description>Master mode selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAINTEN</name>
                    <displayName>DMAINTEN</displayName>
                    <description>DMA/Interrupt enable register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UPDEN</name>
                            <description>Update DMA request enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPIE</name>
                            <description>Update interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <displayName>INTF</displayName>
                    <description>status register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UPIF</name>
                            <description>Update interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWEVG</name>
                    <displayName>SWEVG</displayName>
                    <description>event generation register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UPG</name>
                            <description>Update generation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT</name>
                    <displayName>CNT</displayName>
                    <description>counter</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Low counter value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSC</name>
                    <displayName>PSC</displayName>
                    <description>prescaler</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>Prescaler value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CARL</name>
                    <displayName>CARL</displayName>
                    <description>Counter auto-reload low register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CARL</name>
                            <description>Low Auto-reload value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
