burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>CTL2</name>
                    <displayName>CTL2</displayName>
                    <description>Control register 2</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1</name>
                            <description>Address 1 of the USART terminal</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDM1</name>
                            <description>Address detection mode 1</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUIE</name>
                            <description>Wakeup from Deep-sleep mode interrupt enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUM</name>
                            <description>Wakeup mode from Deep-sleep mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCRTNUM</name>
                            <description>Smartcard auto-retry number</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AMEN1</name>
                            <description>Match Address Mode Enable 1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEP</name>
                            <description>Driver enable polarity mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEM</name>
                            <description>Driver enable mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDRE</name>
                            <description>Disable DMA on reception error</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVRD</name>
                            <description>Overrun disable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSB</name>
                            <description>One sample bit method</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSIE</name>
                            <description>CTS interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSEN</name>
                            <description>CTS enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTSEN</name>
                            <description>RTS enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DENT</name>
                            <description>DMA enable for transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DENR</name>
                            <description>DMA enable for reception</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCEN</name>
                            <description>Smartcard mode enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NKEN</name>
                            <description>NACK enable in Smartcard mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HDEN</name>
                            <description>Half-duplex enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRLP</name>
                            <description>IrDA low-power</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IREN</name>
                            <description>IrDA mode enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>Error interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BAUD</name>
                    <displayName>BAUD</displayName>
                    <description>Baud rate generator register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BRR_INT</name>
                            <description>Integer of baud-rate divider</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRR_DIV</name>
                            <description>Fraction of baud-rate divider</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GP</name>
                    <displayName>GP</displayName>
                    <description>Prescaler and guard time configuration register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GUAT</name>
                            <description>Guard time value in smartcard mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSC</name>
                            <description>Prescaler value for dividing the system clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RT</name>
                    <displayName>RT</displayName>
                    <description>Receiver timeout register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BL</name>
                            <description>Block Length</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RT</name>
                            <description>Receiver timeout threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>Command register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXFCMD</name>
                            <description>Transmit data flush request</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RXFCMD</name>
                            <description>Receive data flush command</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MMCMD</name>
                            <description>Mute mode command</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SBKCMD</name>
                            <description>Send break command</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ABDCMD</name>
                            <description>Auto baudrate detection command</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000000C0</resetValue>
                    <fields>
                        <field>
                            <name>REA</name>
                            <description>Receive enable acknowledge flag</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TEA</name>
                            <description>Transmit enable acknowledge flag</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WUF</name>
                            <description>Wakeup from Deep-sleep mode flag</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RWU</name>
                            <description>Receiver wakeup from mute mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SBF</name>
                            <description>Send break flag</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AMF0</name>
                            <description>ADDR0 match flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BSY</name>
                            <description>Busy flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ABDF</name>
                            <description>Auto baudrate detection flag</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ABDE</name>
                            <description>Auto baudrate detection error</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AMF1</name>
                            <description>ADDR1 match flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EBF</name>
                            <description>End of block flag</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTF</name>
                            <description>Receiver timeout flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTS</name>
                            <description>CTS level</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTSF</name>
                            <description>CTS change flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LBDF</name>
                            <description>LIN break detected flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TBE_TFNF</name>
                            <description>When FIFO is disabled:</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TC</name>
                            <description>Transmission completed</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RBNE_RFNE</name>
                            <description>Interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IDLEF</name>
                            <description>IDLE line detected flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ORERR</name>
                            <description>Overrun error</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NERR</name>
                            <description>Noise error flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FERR</name>
                            <description>Frame error flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PERR</name>
                            <description>Parity error flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
