burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>DIEP1INTF</name>
                    <displayName>DIEP1INTF</displayName>
                    <description>
                        device endpoint-1 interrupt
                        register
                    </description>
                    <addressOffset>0x128</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>NAK</name>
                            <description>NAK handshake sent by USBHS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTXFUD</name>
                            <description>Endpoint Tx FIFO underrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CITO</name>
                            <description>Control in timeout interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP2INTF</name>
                    <displayName>DIEP2INTF</displayName>
                    <description>
                        device endpoint-2 interrupt
                        register
                    </description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>NAK</name>
                            <description>NAK handshake sent by USBHS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTXFUD</name>
                            <description>Endpoint Tx FIFO underrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CITO</name>
                            <description>Control in timeout interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP3INTF</name>
                    <displayName>DIEP3INTF</displayName>
                    <description>
                        device endpoint-3 interrupt
                        register
                    </description>
                    <addressOffset>0x168</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>NAK</name>
                            <description>NAK handshake sent by USBHS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTXFUD</name>
                            <description>Endpoint Tx FIFO underrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CITO</name>
                            <description>Control in timeout interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DIEP4INTF</name>
                    <displayName>DIEP4INTF</displayName>
                    <description>
                        device endpoint-4 interrupt
                        register
                    </description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>NAK</name>
                            <description>NAK handshake sent by USBHS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTXFUD</name>
                            <description>Endpoint Tx FIFO underrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CITO</name>
                            <description>Control in timeout interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DIEP5INTF</name>
                    <displayName>DIEP5INTF</displayName>
                    <description>
                        device endpoint-5 interrupt
                        register
                    </description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>NAK</name>
                            <description>NAK handshake sent by USBHS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTXFUD</name>
                            <description>Endpoint Tx FIFO underrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CITO</name>
                            <description>Control in timeout interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DIEP6INTF</name>
                    <displayName>DIEP6INTF</displayName>
                    <description>
                        device endpoint-6 interrupt
                        register
                    </description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>NAK</name>
                            <description>NAK handshake sent by USBHS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTXFUD</name>
                            <description>Endpoint Tx FIFO underrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CITO</name>
                            <description>Control in timeout interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DIEP7INTF</name>
                    <displayName>DIEP7INTF</displayName>
                    <description>
                        device endpoint-7 interrupt
                        register
                    </description>
                    <addressOffset>0x1E8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>NAK</name>
                            <description>NAK handshake sent by USBHS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTXFUD</name>
                            <description>Endpoint Tx FIFO underrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CITO</name>
                            <description>Control in timeout interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DOEP0INTF</name>
                    <displayName>DOEP0INTF</displayName>
                    <description>
                        device out endpoint-0 interrupt flag
                        register
                    </description>
                    <addressOffset>0x308</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NYET</name>
                            <description>NYET handshake is sent</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BTBSTP</name>
                            <description>Back-to-back SETUP packets</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPRXFOVR</name>
                            <description>Endpoint Rx FIFO overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPF</name>
                            <description>Setup phase finished</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
