burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>DOEP1DMAADDR</name>
                    <displayName>DOEP1DMAADDR</displayName>
                    <description>Device OUT endpoint 1 DMA address register</description>
                    <addressOffset>0x334</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DOEP2DMAADDR</name>
                    <displayName>DOEP2DMAADDR</displayName>
                    <description>Device OUT endpoint 2 DMA address register</description>
                    <addressOffset>0x354</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DOEP3DMAADDR</name>
                    <displayName>DOEP3DMAADDR</displayName>
                    <description>Device OUT endpoint 3 DMA address register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DOEP4DMAADDR</name>
                    <displayName>DOEP4DMAADDR</displayName>
                    <description>Device OUT endpoint 4 DMA address register</description>
                    <addressOffset>0x394</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DOEP5DMAADDR</name>
                    <displayName>DOEP5DMAADDR</displayName>
                    <description>Device OUT endpoint 5 DMA address register</description>
                    <addressOffset>0x3B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP6DMAADDR</name>
                    <displayName>DOEP6DMAADDR</displayName>
                    <description>Device OUT endpoint 6 DMA address register</description>
                    <addressOffset>0x3D4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DOEP7DMAADDR</name>
                    <displayName>DOEP7DMAADDR</displayName>
                    <description>Device OUT endpoint 7 DMA address register</description>
                    <addressOffset>0x3F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>DIEP0TFSTAT</name>
                    <displayName>DIEP0TFSTAT</displayName>
                    <description>
                        device IN endpoint  0 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x118</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP1TFSTAT</name>
                    <displayName>DIEP1TFSTAT</displayName>
                    <description>
                        device IN endpoint 1 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x138</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP2TFSTAT</name>
                    <displayName>DIEP2TFSTAT</displayName>
                    <description>
                        device IN endpoint  2 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x158</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP3TFSTAT</name>
                    <displayName>DIEP3TFSTAT</displayName>
                    <description>
                        device IN endpoint  3 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x178</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP4TFSTAT</name>
                    <displayName>DIEP4TFSTAT</displayName>
                    <description>
                        device IN endpoint  4 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP5TFSTAT</name>
                    <displayName>DIEP5TFSTAT</displayName>
                    <description>
                        device IN endpoint 5 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP6TFSTAT</name>
                    <displayName>DIEP6TFSTAT</displayName>
                    <description>
                        device IN endpoint  6 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x1D8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP7TFSTAT</name>
                    <displayName>DIEP7TFSTAT</displayName>
                    <description>
                        device IN endpoint 7 transmit FIFO
                        status register
                    </description>
                    <addressOffset>0x1F8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IEPTFS</name>
                            <description>
                                IN endpoint TxFIFO space
                                remaining
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
