burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>USBHS0_PWRCLK</name>
            <description>USB on the go high speed</description>
            <groupName>USBHS0</groupName>
            <baseAddress>0x40040E00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PWRCLKCTL</name>
                    <displayName>PWRCLKCTL</displayName>
                    <description>
                        power and clock gating control
                        register (PWRCLKCTL)
                    </description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SUCLK</name>
                            <description>Stop the USB clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHCLK</name>
                            <description>Stop HCLK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUSP</name>
                            <description>PHY is in suspend status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCGEN</name>
                            <description>internal clock gating enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SSLEEP</name>
                            <description>PHY is in shallow sleep status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DSLEEP</name>
                            <description>PHY is in deep sleep status</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

        <peripheral>
            <name>USBHS1_GLOBAL</name>
            <description>USB high speed global registers</description>
            <groupName>USBHS1</groupName>
            <baseAddress>0x40080000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>USBHS1_EP1_OUT</name>
                <value>172</value>
            </interrupt>
            <interrupt>
                <name>USBHS1_EP1_IN</name>
                <value>173</value>
            </interrupt>
            <interrupt>
                <name>USBHS1_WAKEUP</name>
                <value>174</value>
            </interrupt>
            <interrupt>
                <name>USBHS1_GLOBAL</name>
                <value>175</value>
            </interrupt>
            <registers>
                <register>
                    <name>GOTGCS</name>
                    <displayName>GOTGCS</displayName>
                    <description>
                        Global OTG control and status register
                        (USBFS_GOTGCS)
                    </description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000800</resetValue>
                    <fields>
                        <field>
                            <name>SRPS</name>
                            <description>SRP success</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SRPREQ</name>
                            <description>SRP request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VOE</name>
                            <description>Override enable of VBUS valid</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VOV</name>
                            <description>Override value of VBUS valid</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVOE</name>
                            <description>Override enable of A-peripheral session valid</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVOV</name>
                            <description>Override value of A-peripheral session valid</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BVOE</name>
                            <description>Override enable of B-peripheral session valid</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BVOV</name>
                            <description>Override value of B-peripheral session valid</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNPS</name>
                            <description>HNP success</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HNPREQ</name>
                            <description>HNP request</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HHNPEN</name>
                            <description>Host HNP enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DHNPEN</name>
                            <description>Device HNP enabled</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EHE</name>
                            <description>Embedded host enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDPS</name>
                            <description>ID pin status</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DI</name>
                            <description>Debounce interval</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASV</name>
                            <description>A-session valid</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BSV</name>
                            <description>B-session valid</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OV</name>
                            <description>Select OTG version</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GOTGINTF</name>
                    <displayName>GOTGINTF</displayName>
                    <description>
                        Global OTG interrupt flag register
                        (USBHS_GOTGINTF)
                    </description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SESEND</name>
                            <description>Session end</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRPEND</name>
                            <description>
                                Session request success status
                                change
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HNPEND</name>
                            <description>HNP end</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HNPDET</name>
                            <description>Host negotiation request detected</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADTO</name>
                            <description>A-device timeout</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DF</name>
                            <description>Debounce finish</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDCHG</name>
                            <description>There is a change in the value of ID input</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAHBCS</name>
                    <displayName>GAHBCS</displayName>
                    <description>
                        Global AHB control and status register
                        (USBHS_GAHBCS)
                    </description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GINTEN</name>
                            <description>Global interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BURST</name>
                            <description>The AHB burst type used by DMA</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMA function Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFTH</name>
                            <description>Tx FIFO threshold</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PTXFTH</name>
                            <description>Periodic Tx FIFO threshold</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GUSBCS</name>
                    <displayName>GUSBCS</displayName>
                    <description>
                        Global USB control and status register
                        (USBHS_GUSBCSR)
                    </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000A00</resetValue>
                    <fields>
                        <field>
                            <name>TOC</name>
                            <description>Timeout calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HS_EFT_FE</name>
                            <description>HS current software enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBPHY_HS</name>
                            <description>Embedded HS PHY selected</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBPHY_FS</name>
                            <description>Embedded FS PHY selected</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRPCEN</name>
                            <description>SRP capability enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNPCEN</name>
                            <description>HNP capability enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UTT</name>
                            <description>USB turnaround time</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIEVD</name>
                            <description>ULPI external VBUS driver</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIEOI</name>
                            <description>ULPI external over-current indicator</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FHM</name>
                            <description>Force host mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FDM</name>
                            <description>Force device mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRSTCTL</name>
                    <displayName>GRSTCTL</displayName>
                    <description>Global reset control register (USBHS_GRSTCTL)</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x80000000</resetValue>
                    <fields>
                        <field>
                            <name>CSRST</name>
                            <description>Core soft reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCSRST</name>
                            <description>HCLK soft reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HFCRST</name>
                            <description>Host frame counter reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFF</name>
                            <description>RxFIFO flush</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFF</name>
                            <description>TxFIFO flush</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>TxFIFO number</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMABSY</name>
                            <description>DMA Busy</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMAIDL</name>
                            <description>DMA Idle state</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
