burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>GRSTATR_Host</name>
                    <displayName>GRSTATR_Host</displayName>
                    <description>
                        Global Receive status read(Host
                        mode)
                    </description>
                    <alternateRegister>GRSTATR_Device</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNUM</name>
                            <description>Channel number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BCOUNT</name>
                            <description>Byte count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RPCKST</name>
                            <description>Reivece packet status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>GRSTATP_Device</name>
                    <displayName>GRSTATP_Device</displayName>
                    <description>
                        Global Receive status pop(Device
                        mode)
                    </description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BCOUNT</name>
                            <description>Byte count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RPCKST</name>
                            <description>Recieve packet status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRSTATP_Host</name>
                    <displayName>GRSTATP_Host</displayName>
                    <description>
                        Global Receive status pop(Host
                        mode)
                    </description>
                    <alternateRegister>GRSTATP_Device</alternateRegister>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNUM</name>
                            <description>Channel number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BCOUNT</name>
                            <description>Byte count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RPCKST</name>
                            <description>Reivece packet status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRFLEN</name>
                    <displayName>GRFLEN</displayName>
                    <description>
                        Global Receive FIFO size register
                        (USBHS_GRFLEN)
                    </description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>RXFD</name>
                            <description>Rx FIFO depth</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HNPTFLEN</name>
                    <displayName>HNPTFLEN</displayName>
                    <description>
                        Host non-periodic transmit FIFO length register
                        (Host mode)
                    </description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000200</resetValue>
                    <fields>
                        <field>
                            <name>HNPTXRSAR</name>
                            <description>
                                host non-periodic transmit Tx RAM start
                                address
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>HNPTXFD</name>
                            <description>host non-periodic TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP0TFLEN</name>
                    <displayName>DIEP0TFLEN</displayName>
                    <description>
                        Device IN endpoint 0 transmit FIFO length
                        (Device mode)
                    </description>
                    <alternateRegister>HNPTFLEN</alternateRegister>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000200</resetValue>
                    <fields>
                        <field>
                            <name>IEP0TXFD</name>
                            <description>in endpoint 0 Tx FIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>IEP0TXRSAR</name>
                            <description>in endpoint 0 Tx RAM start address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HNPTFQSTAT</name>
                    <displayName>HNPTFQSTAT</displayName>
                    <description>
                        Host non-periodic transmit FIFO/queue
                        status register (HNPTFQSTAT)
                    </description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00080200</resetValue>
                    <fields>
                        <field>
                            <name>NPTXFS</name>
                            <description>Non-periodic TxFIFO space</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>NPTXRQS</name>
                            <description>
                                Non-periodic transmit request queue
                                space
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>NPTXRQTOP</name>
                            <description>
                                Top of the non-periodic transmit request
                                queue
                            </description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GCCFG</name>
                    <displayName>GCCFG</displayName>
                    <description>Global core configuration register (USBFS_GCCFG)</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DCDF</name>
                            <description>Data connect detection status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDF</name>
                            <description>Primary detection status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDF</name>
                            <description>Secondary detection status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PS2F</name>
                            <description>PS2 detection status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BCDEN</name>
                            <description>Battery charging detection enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCDMEN</name>
                            <description>Data connect detection mode enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDMEN</name>
                            <description>Primary detection mode enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDMEN</name>
                            <description>Secondary detection mode enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRON</name>
                            <description>Power on</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOFOEN</name>
                            <description>SOF output enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VDEN</name>
                            <description>Enable of VBUS sensing comparator to detect VBUS valid</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CID</name>
                    <displayName>CID</displayName>
                    <description>core ID register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00001000</resetValue>
                    <fields>
                        <field>
                            <name>CID</name>
                            <description>Core ID</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GLPMCFG</name>
                    <displayName>GLPMCFG</displayName>
                    <description>Global core LPM configuration register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LPMEN</name>
                            <description>LPM enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKLPM</name>
                            <description>ACK in LPM transaction enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BESL</name>
                            <description>Best effort service latency</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>REW</name>
                            <description>RemoteWake value</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSEN</name>
                            <description>Shallow sleep enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BESLTH</name>
                            <description>BESL threshold</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DSEN</name>
                            <description>Deep sleep enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPMRSP</name>
                            <description>Response of LPM</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>LPMSLPS</name>
                            <description>Sleep status</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RSOK</name>
                            <description>Resume can be sent after sleep state</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPMCHI</name>
                            <description>Channel number index when send LPM transaction</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>LPMRC</name>
                            <description>LPM retry count</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>LPMSND</name>
                            <description>Send LPM transaction</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPMRCS</name>
                            <description>LPM retry count status</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BESLEN</name>
                            <description>LPM Errata selection enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>PWRD</name>
                    <displayName>PWRD</displayName>
                    <description>Power down register (USBHS_PWRD)</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADPMEN</name>
                            <description>ADP module enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADPF</name>
                            <description>ADP event interrupt flag</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

