burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>ADPCTL</name>
                    <displayName>ADPCTL</displayName>
                    <description>ADP control andstatus register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00001000</resetValue>
                    <fields>
                        <field>
                            <name>DSCHGPR</name>
                            <description>Time of probe discharge</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESOPR</name>
                            <description>The resolution of CHGT value</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERPR</name>
                            <description>Period of probe</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHGT</name>
                            <description>The latest time that VBUS ramps from VADPSINK to VADPPRB</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PREN</name>
                            <description>ADP probe enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNEN</name>
                            <description>ADP sense enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPRST</name>
                            <description>ADP reset</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADPEN</name>
                            <description>ADP enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPPRF</name>
                            <description>ADP probe interrupt flag</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPSNF</name>
                            <description>ADP sense interrupt flag</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPTF</name>
                            <description>ADP timeout interrupt flag</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPPRFM</name>
                            <description>The mask of ADP probe interrupt flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPSNFM</name>
                            <description>The mask of ADP sense interrupt flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADPTFM</name>
                            <description>The mask of ADP timeout interrupt flag</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RWR</name>
                            <description>Read and write request</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>HPTFLEN</name>
                    <displayName>HPTFLEN</displayName>
                    <description>Host periodic transmit FIFO length register (HPTFLEN)</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000600</resetValue>
                    <fields>
                        <field>
                            <name>HPTXFSAR</name>
                            <description>
                                Host periodic TxFIFO start
                                address
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>HPTXFD</name>
                            <description>Host periodic TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP1TFLEN</name>
                    <displayName>DIEP1TFLEN</displayName>
                    <description>
                        device IN endpoint transmit FIFO size
                        register
                    </description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>IEPTXRSAR</name>
                            <description>
                                IN endpoint FIFO transmit RAM start
                                address
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>IEPTXFD</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP2TFLEN</name>
                    <displayName>DIEP2TFLEN</displayName>
                    <description>
                        device IN endpoint transmit FIFO size
                        register
                    </description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>IEPTXRSAR</name>
                            <description>
                                IN endpoint FIFO transmit RAM start
                                address
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>IEPTXFD</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP3TFLEN</name>
                    <displayName>DIEP3TFLEN</displayName>
                    <description>
                        device IN endpoint transmit FIFO size
                        register
                    </description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>IEPTXRSAR</name>
                            <description>
                                IN endpoint FIFO4 transmit RAM start
                                address
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>IEPTXFD</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP4TFLEN</name>
                    <displayName>DIEP4TFLEN</displayName>
                    <description>
                        device IN endpoint transmit FIFO size
                        register
                    </description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>IEPTXRSAR</name>
                            <description>
                                IN endpoint FIFO4 transmit RAM start
                                address
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>IEPTXFD</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP5TFLEN</name>
                    <displayName>DIEP5TFLEN</displayName>
                    <description>
                        device IN endpoint transmit FIFO size
                        register (FS_DIEP5TXFLEN)
                    </description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>IEPTXRSAR</name>
                            <description>
                                IN endpoint FIFO4 transmit RAM start
                                address
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>IEPTXFD</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
