burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>USBHS1_HOST</name>
            <description>USB on the go high speed host</description>
            <groupName>USBHS1</groupName>
            <baseAddress>0x40080400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>HCTL</name>
                    <displayName>HCTL</displayName>
                    <description>
                        host configuration register
                        (HCTL)
                    </description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPDFSLS</name>
                            <description>Speed limited to FS and LS</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HFT</name>
                    <displayName>HFT</displayName>
                    <description>
                        Host frame interval
                        register
                    </description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000BB80</resetValue>
                    <fields>
                        <field>
                            <name>FRI</name>
                            <description>Frame interval</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HFINFR</name>
                    <displayName>HFINFR</displayName>
                    <description>
                        OTG_FS host frame number/frame time
                        remaining register (HFINFR)
                    </description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0xBB800000</resetValue>
                    <fields>
                        <field>
                            <name>FRNUM</name>
                            <description>Frame number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FRT</name>
                            <description>Frame remaining time</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPTFQSTAT</name>
                    <displayName>HPTFQSTAT</displayName>
                    <description>
                        Host periodic transmit FIFO/queue
                        status register (HPTFQSTAT)
                    </description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00080200</resetValue>
                    <fields>
                        <field>
                            <name>PTXFS</name>
                            <description>
                                Periodic transmit data FIFO space
                                available
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXREQS</name>
                            <description>
                                Periodic transmit request queue space
                                available
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTXREQT</name>
                            <description>
                                Top of the periodic transmit request
                                queue
                            </description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HACHINT</name>
                    <displayName>HACHINT</displayName>
                    <description>
                        Host all channels interrupt
                        register
                    </description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HACHINT</name>
                            <description>Host all channel interrupts</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HACHINTEN</name>
                    <displayName>HACHINTEN</displayName>
                    <description>
                        host all channels interrupt mask
                        register
                    </description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CINTEN</name>
                            <description>Channel interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPCS</name>
                    <displayName>HPCS</displayName>
                    <description>Host port control and status register (USBFS_HPCS)</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCST</name>
                            <description>Port connect status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCD</name>
                            <description>Port connect detected</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Port enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEDC</name>
                            <description>Port enable/disable change</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PREM</name>
                            <description>Port resume</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSP</name>
                            <description>Port suspend</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRST</name>
                            <description>Port reset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLST</name>
                            <description>Port line status</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PP</name>
                            <description>Port power</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTEST</name>
                            <description>Port Test control</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PS</name>
                            <description>Port speed</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH0CTL</name>
                    <displayName>HCH0CTL</displayName>
                    <description>
                        host channel-0 characteristics
                        register (HCH0CTL)
                    </description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH1CTL</name>
                    <displayName>HCH1CTL</displayName>
                    <description>
                        host channel-1 characteristics
                        register (HCH1CTL)
                    </description>
                    <addressOffset>0x120</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH2CTL</name>
                    <displayName>HCH2CTL</displayName>
                    <description>
                        host channel-2 characteristics
                        register (HCH2CTL)
                    </description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
