burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
               <register>
          <name>HCH13STCTL</name>
          <displayName>HCH13STCTL</displayName>
          <description>host channel-13 split transaction control register
          (HCH13STCTL)</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PADDR</name>
              <description>Port address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>HADDR</name>
              <description>HUB address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>ISOPCE</name>
              <description>Isochronous OUT payload continuation encoding</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CSPLT</name>
              <description>Complete split enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLEN</name>
              <description> Enable high speed split transaction</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
               <register>
          <name>HCH14STCTL</name>
          <displayName>HCH11STCTL</displayName>
          <description>host channel-14 split transaction control register
          (HCH14STCTL)</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PADDR</name>
              <description>Port address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>HADDR</name>
              <description>HUB address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>ISOPCE</name>
              <description>Isochronous OUT payload continuation encoding</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CSPLT</name>
              <description>Complete split enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLEN</name>
              <description> Enable high speed split transaction</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HCH15STCTL</name>
          <displayName>HCH15STCTL</displayName>
          <description>host channel-15 split transaction control register
          (HCH15STCTL)</description>
          <addressOffset>0x2E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PADDR</name>
              <description>Port address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>HADDR</name>
              <description>HUB address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>ISOPCE</name>
              <description>Isochronous OUT payload continuation encoding</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CSPLT</name>
              <description>Complete split enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLEN</name>
              <description> Enable high speed split transaction</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
                <register>
                    <name>HCH0INTF</name>
                    <displayName>HCH0INTF</displayName>
                    <description>
                        host channel-0 interrupt register
                        (USBHS_HCHxINTF)
                    </description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH1INTF</name>
                    <displayName>HCH1INTF</displayName>
                    <description>
                        host channel-1 interrupt register
                        (HCH1INTF)
                    </description>
                    <addressOffset>0x128</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH2INTF</name>
                    <displayName>HCH2INTF</displayName>
                    <description>
                        host channel-2 interrupt register
                        (HCH2INTF)
                    </description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH3INTF</name>
                    <displayName>HCH3INTF</displayName>
                    <description>
                        host channel-3 interrupt register
                        (HCH3INTF)
                    </description>
                    <addressOffset>0x168</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
