burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>HCH4INTF</name>
                    <displayName>HCH4INTF</displayName>
                    <description>
                        host channel-4 interrupt register
                        (HCH4INTF)
                    </description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH5INTF</name>
                    <displayName>HCH5INTF</displayName>
                    <description>
                        host channel-5 interrupt register
                        (HCH5INTF)
                    </description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH6INTF</name>
                    <displayName>HCH6INTF</displayName>
                    <description>
                        host channel-6 interrupt register
                        (HCH6INTF)
                    </description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH7INTF</name>
                    <displayName>HCH7INTF</displayName>
                    <description>
                        host channel-7 interrupt register
                        (HCH7INTF)
                    </description>
                    <addressOffset>0x1E8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH8INTF</name>
                    <displayName>HCH8INTF</displayName>
                    <description>
                        host channel-8 interrupt register
                        (HCH8INTF)
                    </description>
                    <addressOffset>0x208</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

