burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>HCH9INTF</name>
                    <displayName>HCH9INTF</displayName>
                    <description>
                        host channel-9 interrupt register
                        (HCH9INTF)
                    </description>
                    <addressOffset>0x228</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>HCH10INTF</name>
                    <displayName>HCH10INTF</displayName>
                    <description>
                        host channel-10 interrupt register
                        (HCH10INTF)
                    </description>
                    <addressOffset>0x248</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>HCH11INTF</name>
                    <displayName>HCH11INTF</displayName>
                    <description>
                        host channel-11 interrupt register
                        (HCH11INTF)
                    </description>
                    <addressOffset>0x268</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>HCH12INTF</name>
                    <displayName>HCH12INTF</displayName>
                    <description>
                        host channel-12 interrupt register
                        (HCH12INTF)
                    </description>
                    <addressOffset>0x288</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>HCH13INTF</name>
                    <displayName>HCH13INTF</displayName>
                    <description>
                        host channel-13 interrupt register
                        (HCH13INTF)
                    </description>
                    <addressOffset>0x2A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>

