burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>USBHS1_PWRCLK</name>
            <description>USB on the go high speed</description>
            <groupName>USBHS1</groupName>
            <baseAddress>0x40080E00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PWRCLKCTL</name>
                    <displayName>PWRCLKCTL</displayName>
                    <description>
                        power and clock gating control
                        register (PWRCLKCTL)
                    </description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SUCLK</name>
                            <description>Stop the USB clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHCLK</name>
                            <description>Stop HCLK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUSP</name>
                            <description>PHY is in suspend status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCGEN</name>
                            <description>internal clock gating enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SSLEEP</name>
                            <description>PHY is in shallow sleep status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DSLEEP</name>
                            <description>PHY is in deep sleep status</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>VREF</name>
            <description>VREF</description>
            <groupName>VREF</groupName>
            <baseAddress>0x58003C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CS</name>
                    <displayName>CS</displayName>
                    <description>Control and status register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <field>
                            <name>VREFS</name>
                            <description>Voltage reference select</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VREFRDY</name>
                            <description>VREF ready</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HIPM</name>
                            <description>High impedance mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VREFEN</name>
                            <description>VREF enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CALIB</name>
                    <displayName>CALIB</displayName>
                    <description>Calibration register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VREFCAL</name>
                            <description>VREF calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
