burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>IPR18</name>
                    <displayName>IPR18</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x348</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR19</name>
                    <displayName>IPR19</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x34C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR20</name>
                    <displayName>IPR20</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x350</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR21</name>
                    <displayName>IPR21</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x354</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR22</name>
                    <displayName>IPR22</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x358</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR23</name>
                    <displayName>IPR23</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x35C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR24</name>
                    <displayName>IPR24</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x360</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR25</name>
                    <displayName>IPR25</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x364</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR26</name>
                    <displayName>IPR26</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x368</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR27</name>
                    <displayName>IPR27</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x36C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR28</name>
                    <displayName>IPR28</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x370</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR29</name>
                    <displayName>IPR29</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR30</name>
                    <displayName>IPR30</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x378</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR31</name>
                    <displayName>IPR31</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x37C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
