burakenez/gd32h7xx-cmake-vscode/Examples/TIMER/TIMERs_cascadesynchro/GD32H7xx.svd
                <register>
                    <name>IPR32</name>
                    <displayName>IPR32</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x380</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR33</name>
                    <displayName>IPR33</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x384</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR34</name>
                    <displayName>IPR34</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x388</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR35</name>
                    <displayName>IPR35</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x38C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR36</name>
                    <displayName>IPR36</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x390</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR37</name>
                    <displayName>IPR37</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x394</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IPR38</name>
                    <displayName>IPR38</displayName>
                    <description>Interrupt Priority Register</description>
                    <addressOffset>0x398</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPR_N0</name>
                            <description>IPR_N0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N1</name>
                            <description>IPR_N1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N2</name>
                            <description>IPR_N2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>IPR_N3</name>
                            <description>IPR_N3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISER3</name>
                    <displayName>ISER3</displayName>
                    <description>Interrupt Set-Enable Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <register>
                    <name>ICER3</name>
                    <displayName>ICER3</displayName>
                    <description>
                        Interrupt Clear-Enable
                        Register
                    </description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <register>
                    <name>ISPR3</name>
                    <displayName>ISPR3</displayName>
                    <description>Interrupt Set-Pending Register</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <register>
                    <name>ICPR3</name>
                    <displayName>ICPR3</displayName>
                    <description>
                        Interrupt Clear-Pending
                        Register
                    </description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <register>
                    <name>IABR3</name>
                    <displayName>IABR3</displayName>
                    <description>Interrupt Active Bit Register</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
